[
  {
    "brand": "Hoka",
    "title": "Hoka One One Clifton 8 'Eggnog Shifting Sand'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-clifton-eggnog-1119393-essn",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the Hoka One One Clifton 8 in the delectable 'Eggnog Shifting Sand' colorway. This shoe is a true testimony to the Hoka One One brand and all that it stands for - comfort, style, and innovation.\n\nWith its seamless upper construction and breathable mesh material, the Hoka One One Clifton 8 provides the ultimate next-to-skin comfort. The EVA foam midsole and early stage Meta-Rocker technology ensure a smooth ride with every step you take, while the rubber outsole and integrated rubber pods provide exceptional durability and traction.\n\nThe 'Eggnog Shifting Sand' colorway boasts a unique blend of soft cream and warm beige tones, making it a versatile choice for any wardrobe. Whether you're hitting the pavement for your daily jog, running errands around town, or simply lounging at home, the Hoka One One Clifton 8 in 'Eggnog Shifting Sand' will take you everywhere you need to go in style and comfort.\n\nOrder your pair today and experience the superior quality and craftsmanship of Hoka One One for yourself!",
    "price": "$172",
    "variants": {
      "cream": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_73ea9199-22a0-44d0-b6db-3f34b519e443_540x.jpg?v=1680748971"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "Hoka One One Bondi 7 'Black'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-wmns-bondi-7-black-1110519-bblc",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the (WMNS) Hoka One One Bondi 7 'Black' - the ultimate comfort shoe for your feet. With its sleek and stylish design, this shoe is perfect for running, walking, and everything in between. \n\nThe Bondi 7 features a full-length EVA midsole that provides exceptional cushioning and support, reducing the impact on your feet with each stride. You'll love the plush feeling of the shoes on your feet, as they provide a luxurious ride that you can't find elsewhere. \n\nThe multi-directional traction outsole ensures that you'll get optimum grip and superior stability, even on the most challenging terrains. Its breathable engineered mesh upper keeps your feet cool and dry, impressive even in hot, humid weather conditions.\n\nThe Hoka One One Bondi 7 is a comfortable shoe that's built to last. Its unique design and carefully crafted features make it an excellent choice for anyone looking to make the most out of their daily routine. With sizes ranging from women's 5-12, you can be sure that the perfect fit for you is available.\n\nDon't let uncomfortable shoes hold you back; get the Hoka One One Bondi 7 Black today and experience comfort like never before!",
    "price": "$180",
    "variants": {
      "BLACK": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_1ecbe74f-1557-4b44-98a9-5330ad92f5b3_540x.jpg?v=1661997561"
      }
    },
    "audience": [
      "Women's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "Hoka One One Bondi 7 'Black'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-bondi-7-black-1110518-bblc",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Looking for a reliable and comfortable running shoe that can handle all your training needs? Look no further than the Hoka One One Bondi 7 'Black'! Whether you're hitting the pavement for a quick jog or training for an upcoming race, these shoes will deliver the support and cushioning you need to go the distance.\n\nWith their sleek black design, these shoes are sure to turn heads on the track or the trail. But they're much more than just a pretty face - the Bondi 7 features Hoka's signature cushioning technology, providing a smooth and responsive ride with every step. Their high stack height and wide base also offer excellent stability and support, helping to reduce the risk of injury as you push yourself to new limits.\n\nBut don't just take our word for it - try the Hoka One One Bondi 7 'Black' for yourself and experience the difference for yourself. With their multi-lingual labeling, these shoes are the perfect choice for runners of all backgrounds and nationalities. So why wait? Add them to your cart today and get ready to take your running game to the next level!",
    "price": "$181",
    "variants": {
      "BLACK": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_b37d0367-4fdc-4795-b3ab-02d417f94c51_540x.jpg?v=1661998201"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "HOKA ONE ONE Clifton 8 'White'",
    "url": "https://www.kickscrew.com/products/wmns-hoka-one-one-clifton-8-white-1119394-wwh",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the HOKA ONE ONE Clifton 8 'White' - the ultimate choice for runners who demand both comfort and style in their footwear. With its sleek and modern design, these sneakers are sure to elevate your running game to the next level.\n\nCrafted with the latest technology, the HOKA ONE ONE Clifton 8 'White' offers unparalleled comfort and support. The breathable upper allows for maximum air flow, keeping your feet cool and dry even during the most intense workout sessions. Meanwhile, the plush midsole provides the perfect amount of cushioning, reducing impact and preventing injury.\n\nWhether you're a seasoned marathoner or just starting your fitness journey, these sneakers are the perfect choice. The versatile white colorway ensures that they will complement any workout outfit, while the durable construction guarantees that they will last you for miles and miles.\n\nDon't settle for mediocre running shoes that leave you feeling fatigued and uncomfortable. Choose the HOKA ONE ONE Clifton 8 'White' and experience the ultimate in comfort, support, and style. Order yours today and get ready to take on the world, one stride at a time.",
    "price": "$153",
    "variants": {
      "White": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_409e93c8-d7e1-456b-914c-cfb93e20190c_540x.jpg?v=1681880933"
      }
    },
    "audience": [
      "Women's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "Hoka One One Bondi 7 'Black White'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-wmns-bondi-7-black-1110519-bwht",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the newest addition to our lineup - the (WMNS) Hoka One One Bondi 7 'Black White'! Designed with the latest technology and construction, these sneakers offer the perfect combination of support and style, making them your go-to shoes for both workouts and everyday wear.\n\nConstructed with Hoka One One's signature cushioning technology, these sneakers offer superior comfort and shock-absorption, reducing the impact on your body during high-impact activities. The breathable upper is designed to keep your feet cool and dry, even during the most demanding workouts. \n\nThese sneakers aren't just functional - they're stylish too! The sleek black and white colorway will make heads turn, whether you're running errands or breaking a sweat at the gym. With their versatile design, they're perfect for pairing with your workout gear or dressing up your favorite casual outfits.\n\nDon't settle for ordinary sneakers - upgrade your shoe game with the (WMNS) Hoka One One Bondi 7 'Black White'. Order now and experience the perfect combination of performance and style!",
    "price": "$162",
    "variants": {
      "BLACK/WHITE": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_eb772cee-f27f-4729-8543-267908e33922_540x.jpg?v=1662148466"
      }
    },
    "audience": [
      "Women's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "HOKA ONE ONE Bondi 7 Wide 2E",
    "url": "https://www.kickscrew.com/products/hoka-one-one-bondi-7-wide-2e-black-1110530-bblc",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the HOKA ONE ONE Bondi 7 Wide 2E 1110530-BBLC – the ultimate running shoe that combines style, comfort, and functionality. Designed for runners who demand extra space and support, this shoe is perfect for athletes with wider feet. \n\nThe Bondi 7 features a sleek and stylish design that will elevate your running experience. The shoe's clean lines and bold blue colorway make it a standout choice for runners who want to look as good as they feel. \n\nBut the Bondi 7 is more than just a pretty shoe – it is packed with advanced features to ensure optimal performance. Equipped with a wide forefoot platform, Meta-Rocker technology, and a full-length EVA midsole, this shoe delivers a smooth and effortless ride that will keep you going mile after mile. \n\nThe shoe's breathable mesh upper provides a comfortable and supportive fit, while its padded tongue and collar offer extra cushioning around the ankle. The shoe's durable rubber outsole provides excellent traction and grip on any terrain, so you can take on any challenge with confidence. \n\nWhether you are an experienced runner or just starting out, the HOKA ONE ONE Bondi 7 Wide 2E 1110530-BBLC is the perfect shoe to help you reach your goals. With its exceptional comfort, support, and performance, it is sure to become your go-to running shoe. Don't settle for anything less – invest in the Bondi",
    "price": "$182",
    "variants": {
      "BLACK": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_eb8b4a80-aeb6-4633-95c0-d2be5a2f67f0_540x.jpg?v=1662199602"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "Hoka One One Engineered Garments x Bondi L 'Simply Taupe'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-bondi-l-x-engineered-garments-simply-taupe-cow-hair-1127734-stch",
    "category": "Athletic Shoes",
    "description": "Introducing the stunning Hoka One One Engineered Garments x Bondi L 'Simply Taupe' 1127734-STCH sneakers - the ultimate choice for shoe enthusiasts seeking both style and functionality. \n\nCrafted with precision and expertise, these sneakers are designed to provide maximum comfort and support, without compromising on style. The taupe-colored exterior adds a touch of elegance to your outfit, making it perfect for any occasion.\n\nFeaturing Hoka One One's signature cushioned sole, these sneakers are lightweight and supremely comfortable, allowing you to wear them all day long. Engineered Garments x Bondi L branding completes the sleek appearance, adding a touch of unique style to your footwear collection.\n\nPerfect for workouts, city strolls, and everything in between, these sneakers are a must-have addition to your wardrobe. And with sizes available in English, French, German, Italian, Spanish, and Greek, you can be confident you will find the perfect fit for you.\n\nOrder your Hoka One One Engineered Garments x Bondi L 'Simply Taupe' 1127734-STCH sneakers now and elevate your footwear game to the next level!",
    "price": "$348",
    "variants": {
      "BROWN": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_95e7f651-e848-41b6-a81e-6ecf968e6e54_540x.jpg?v=1662543734"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "Hoka One One Tor Ultra Hi Gore Tex 'Black'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-tor-ultra-hi-black-1129958-bblc",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the Hoka One One Tor Ultra Hi Gore Tex 'Black' 1129958-BBLC - a revolutionary shoe that will transform the way you hike and explore the great outdoors. With its sleek black design, this shoe not only looks great, but performs even better.\n\nThe ultra-high cut and Gore Tex technology make this shoe perfect for any type of terrain, from rocky mountain trails to muddy hiking paths. The durable and waterproof material will keep your feet dry and comfortable, no matter the weather conditions.\n\nBut that's not all - this shoe is also designed for optimal comfort and support. The cushioned sole provides amazing shock absorption, and the ergonomic design reduces strain on your joints and muscles. Plus, the breathable mesh lining ensures your feet stay cool and dry during those long hikes.\n\nWhether you're a seasoned hiker or just starting out, the Hoka One One Tor Ultra Hi Gore Tex 'Black' 1129958-BBLC is the ultimate shoe for your next adventure. So why settle for less? Invest in these shoes today and take your hiking experience to the next level. Order now and experience the ultimate in comfort and performance!",
    "price": "$445",
    "variants": {
      "BLACK": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_4c5203f0-cb18-47c3-8a09-d389f820c1aa_540x.jpg?v=1676559806"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "Hoka One One Speedgoat 4 Wide 'Dark Gull Grey'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-speedgoat-4-dark-gull-grey-1106528-dgga",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Looking for a trail running shoe that can handle any terrain with ease? Look no further than the Hoka One One Speedgoat 4 Wide in 'Dark Gull Grey'. With its superior design and unbeatable features, this shoe is the perfect addition to any runner's arsenal.\n\nCrafted to provide exceptional support and cushioning, the Hoka One One Speedgoat 4 Wide is the ultimate choice for anyone looking to take their trail running to the next level. The durable and breathable construction of the shoe makes it perfect for long hikes and intense workouts, while the wide fit ensures maximum comfort and stability.\n\nWith a sleek and stylish 'Dark Gull Grey' colorway, these shoes are sure to turn heads and make a statement wherever you go. So why wait? Order your pair of Hoka One One Speedgoat 4 Wide today and experience the difference for yourself!",
    "price": "$188",
    "variants": {
      "BLACK/GRAY": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_5241995b-56f4-4f61-8384-08b122308b36_540x.jpg?v=1662187886"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "HOKA ONE ONE Bondi 7",
    "url": "https://www.kickscrew.com/products/hoka-one-one-wmns-bondi-7-black-1110531-bblc",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the (WMNS) HOKA ONE ONE Bondi 7, the ideal pair of shoes for runners looking for ultimate comfort and style! With a sleek design, these shoes are the perfect combination of functionality and fashion. The lightweight construction, paired with the signature HOKA cushioning technology, offers maximum support and shock absorption for a smooth ride.\n\nFeaturing an updated upper with a breathable mesh material, these shoes also allow your feet to remain cool and fresh throughout your workout. The reinforced eyestays provide a secure fit and improve durability, making them the perfect companion for all your runs.\n\nWhether you're an experienced runner or just starting on your fitness journey, these shoes are an excellent choice. Plus, with its versatile colorway of blue and black, the (WMNS) HOKA ONE ONE Bondi 7 can be paired effortlessly with any running outfit.\n\nDon't settle for uncomfortable running shoes. Upgrade your running game with the (WMNS) HOKA ONE ONE Bondi 7 today and experience the ultimate comfort and style!",
    "price": "$171",
    "variants": {
      "BLACK": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_2b52fa93-0714-4010-8213-7604d9726503_540x.jpg?v=1662103104"
      }
    },
    "audience": [
      "Women's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "Hoka One One Elevon 2 'White Nimbus Cloud'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-elevon-2-white-nimbus-cloud-1123110-wncl",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Looking for the perfect blend of style, comfort, and performance? Look no further than the Hoka One One Elevon 2 in 'White Nimbus Cloud' (1123110-WNCL).Designed for the athlete who wants to look good while pushing themselves to the limit, this shoe is the ultimate combination of form and function.\n\nFeaturing a sleek, white upper with subtle grey accents, this shoe is guaranteed to turn heads. But it's not just about looks - the Elevon 2 is packed with features that will keep you comfortable and performing at your best. The PROFLY™ midsole provides a responsive, cushioned ride, while the padded tongue and collar offer extra support and comfort.\n\nWhether you're hitting the pavement or the treadmill, the Elevon 2 has you covered. And with its durable construction and top-of-the-line materials, this shoe is designed to last. So why settle for anything less? Elevate your game with the Hoka One One Elevon 2 in 'White Nimbus Cloud' (1123110-WNCL). Order now and experience the ultimate in style, comfort, and performance.",
    "price": "$175",
    "variants": {
      "white": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_9bd61730-e1fe-474f-b7b8-181b2f060464_540x.jpg?v=1661998331"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "HOKA ONE ONE Clifton 7 'Black Gold'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-wmns-clifton-7-black-bronze-1110509-bbrnz",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Looking for a shoe that offers comfort, style, and performance? Look no further than the (WMNS) HOKA ONE ONE Clifton 7 'Black Gold' 1110509-BBRNZ.\n\nWith its sleek black and gold design, this shoe will not only turn heads but also provide unparalleled support and cushioning. The HOKA ONE ONE Clifton 7 features a lightweight construction paired with a plush midsole, making it the perfect shoe for long-distance runs, intense training sessions, or everyday wear.\n\nMade with highly breathable materials, this shoe will keep your feet dry and comfortable, even during the most intense workouts. The durable outsole will provide excellent traction on any surface, giving you the confidence and support you need to push yourself to the limit.\n\nWhether you're a seasoned athlete or simply looking for a comfortable and stylish shoe for everyday wear, the (WMNS) HOKA ONE ONE Clifton 7 'Black Gold' 1110509-BBRNZ is the perfect choice. Order now and experience the ultimate in performance and comfort!",
    "price": "$140",
    "variants": {
      "BLACK/GOLD": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_d19c28d4-c882-43ed-89ba-764575aae2d8_540x.jpg?v=1662056928"
      }
    },
    "audience": [
      "Women's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "HOKA ONE ONE Clifton Edge",
    "url": "https://www.kickscrew.com/products/hoka-one-one-clifton-edge-almond-milk-1110510-ambg",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Looking for unrivaled comfort and unparalleled style in a running shoe? The HOKA ONE ONE Clifton Edge 1110510-AMBG has got you covered! \n\nBoasting a sleek and modern design, the Clifton Edge 1110510-AMBG is the ultimate shoe for both novice and seasoned runners. This shoe is crafted with precision, ensuring both durability and performance. You'll love the soft yet firm cushioning that provides a comfortable, supportive ride with every stride.\n\nWith its unique heel geometry, the Clifton Edge 1110510-AMBG is designed to enhance your natural gait and promote comfort. The shoe has an extended heel element that adds even more cushioning, while the early stage Meta-Rocker delivers a smooth ride that transitions effortlessly from heel to toe.\n\nBut that's not all – the Clifton Edge 1110510-AMBG is also visually stunning. The color scheme is a beautiful blend of blue and green, ensuring that you'll turn heads every time you hit the track. Plus, the shoe is available in a wide range of sizes, making it the perfect fit for athletes of all shapes and sizes.\n\nOverall, the HOKA ONE ONE Clifton Edge 1110510-AMBG is an exceptional shoe that delivers on both style and performance. Whether you're an experienced runner or just starting out, this shoe is a must-have addition to your collection. Order now and experience the ultimate in comfort, support, and style!",
    "price": "$202",
    "variants": {
      "DEFAULT COLOR": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_fe5416a0-40c5-4883-b487-50e573511a58_540x.jpg?v=1662016285"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "Hoka One One Clifton 8 'Black'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-clifton-8-black-1119393-bblc",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Looking for the perfect pair of sneakers to elevate your running game and bring out your inner athlete? Look no further than the Hoka One One Clifton 8 'Black'!\n\nCrafted with precision and care, these sneakers are designed to enhance your running experience with unparalleled comfort and support. The black colorway is sleek and stylish, blending effortlessly with any athletic outfit, while the popular Clifton style makes this shoe a must-have for serious runners and beginners alike.\n\nThe Hoka One One Clifton 8 'Black' features a cushioned sole that absorbs impact, making for a smooth and comfortable ride. The breathable upper keeps your feet cool and dry, while the sturdy construction ensures these shoes will last for miles to come.\n\nWhether you're training for a marathon or simply looking to take your daily jog to the next level, the Hoka One One Clifton 8 'Black' is the perfect choice. And with six different language options available on our Shopify store, you can browse and purchase with ease, no matter where in the world you may be.\n\nSo why wait? Elevate your athletic performance and style with the Hoka One One Clifton 8 'Black' today!",
    "price": "$158",
    "variants": {
      "BLACK": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_0270e806-f0f7-4d30-baab-f3caf907aca5_540x.jpg?v=1662057396"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "HOKA ONE ONE Mach 2",
    "url": "https://www.kickscrew.com/products/hoka-one-one-mach-2-patriot-blue-nasturtium-1099721-pbns",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the HOKA ONE ONE Mach 2 1099721-PBNS, the ultimate runner's shoe designed to take your performance to the next level! Whether you're a seasoned athlete or a beginner, these shoes promise to improve your stride and keep you comfortable throughout your entire run.\n\nCrafted with the latest technology and cutting-edge materials, the Mach 2 features a lightweight yet durable design that's perfect for long-distance running. The engineered mesh upper enhances breathability, keeping your feet cool and dry even on the hottest days. The seamless construction ensures a snug, sock-like fit that adapts to your foot shape for a comfortable ride.\n\nThe PROFLY™ midsole is engineered to provide a responsive ride while cushioning your every step. The unique geometry of the midsole ensures a smooth transition from heel to toe and reduces the impact on your joints, enabling you to run faster and further with ease.\n\nBut that's not all – the Mach 2 is also packed with other features that guarantee a top-notch performance. The RMAT® outsole provides superior grip and traction on any surface, especially on wet or slippery roads. The early-stage Meta-Rocker ensures a faster takeoff, propelling you forward with every stride.\n\nWith its stylish design and versatile color scheme, the HOKA ONE ONE Mach 2 is also perfect for everyday wear. Whether you're hitting the gym, running errands, or going out with friends, these shoes will keep you looking and feeling",
    "price": "$127",
    "variants": {
      "BLUEORANGEPURPLE": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_725464b2-37ce-4172-b0c5-db9071dbe15d_540x.jpg?v=1662197923"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "Hoka One One Clifton Edge 'Anthracite Evening Primrose'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-clifton-edge-anthracite-1110510-aepr",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the Hoka One One Clifton Edge in 'Anthracite Evening Primrose' - the perfect combination of style, comfort and performance. As a masterful copywriter, I can assure you that this athletic shoe will exceed all your expectations.\n\nLet's start with the design: the 'Anthracite Evening Primrose' colorway is a showstopper. The deep, dark charcoal tone is contrasted by pops of bright pink for a look that is both edgy and feminine. The mesh upper allows for breathability while the lightweight construction ensures that your feet won't feel weighed down.\n\nBut looks aren't everything - this shoe was built with performance in mind. The Clifton Edge features Hoka's signature midsole technology, offering maximum cushioning and support for your joints whether you're hitting the pavement for a run, logging miles on the treadmill, or just running errands.\n\nAnd did I mention how comfortable these shoes are? The memory foam collar cradles your ankle for a custom fit, and the rubber outsole provides excellent traction for even the most challenging terrain. Plus, the shoe's slip-on design makes for easy on/off, perfect for when you're in a hurry.\n\nIn summary, the Hoka One One Clifton Edge in 'Anthracite Evening Primrose' is a must-have for any active woman who values both style and performance. Don't miss out on the opportunity to add these incredible shoes to your collection!",
    "price": "$167",
    "variants": {
      "BLACKYELLOW": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_d5800c48-f10c-4756-a76d-97466f893ca2_540x.jpg?v=1662113430"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "Hoka One One Clifton Edge 'Nimbus Cloud Lunar Rock'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-wmns-clifton-edge-cloudy-grey-1110511-nclr",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the (WMNS) Hoka One One Clifton Edge in the dazzling 'Nimbus Cloud Lunar Rock' colorway! The perfect blend of style and function, these shoes are designed to help you power through your daily workouts with ease.\n\nCrafted with a breathable mesh upper and a plush EVA foam midsole, these shoes offer the ideal balance of comfort and support. The innovative Clifton Edge technology provides a smooth and stable ride, while the Meta-Rocker design encourages a natural and efficient stride.\n\nWith a stunning blend of shades, the 'Nimbus Cloud Lunar Rock' hue is sure to turn heads. Whether you're hitting the pavement or tackling a challenging training session, these shoes are the perfect choice for the modern athlete.\n\nDon't settle for anything less than the best- choose the (WMNS) Hoka One One Clifton Edge in 'Nimbus Cloud Lunar Rock' and elevate your athletic game today! Order now and experience the perfect blend of form and function.",
    "price": "$182",
    "variants": {
      "white": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_a8d487ae-4fbe-4339-9992-20d0d76fb308_540x.jpg?v=1662138464"
      }
    },
    "audience": [
      "Women's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "HOKA ONE ONE Bondi 7",
    "url": "https://www.kickscrew.com/products/hoka-one-one-bondi-7-provincial-blue-citrus-1110518-pbcs",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the ultimate in comfort and style for your feet - the HOKA ONE ONE Bondi 7! Step up your footwear game with these cutting-edge running shoes that offer a perfect balance of performance and fashion. Whether you're an avid runner or looking for a comfortable everyday shoe, the Bondi 7 has you covered.\n\nCrafted from innovative technology, these shoes offer plush cushioning and ultimate support without adding any extra weight. The breathable upper provides maximum ventilation for a comfortable, cool feel all day long. And for those long runs, the Meta-Rocker technology ensures a smooth and effortless stride, allowing you to go faster and longer than ever before.\n\nBut it's not just about functionality - the HOKA ONE ONE Bondi 7 also boasts a sleek and stylish design that will make heads turn. With a range of eye-catching colours to choose from, there's a perfect match for every look.\n\nDon't compromise on comfort or style when it comes to your footwear game. Invest in the HOKA ONE ONE Bondi 7, and experience the perfect combination of performance and style - your feet will thank you!",
    "price": "$242",
    "variants": {
      "DEFAULT COLOR": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_9b79999b-2442-40e8-a42b-5e9997b37896_540x.jpg?v=1662112650"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "Hoka One One Hopara 'Oxford Tan'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-hopara-oxford-tan-1123112-otot",
    "category": "Sandals",
    "description": "Looking for a high-performance shoe that can take on any adventure? Look no further than the Hoka One One Hopara 'Oxford Tan' 1123112-OTOT! \n\nCrafted with premium materials and cutting-edge technology, these shoes are designed to provide all-day comfort and durability. The lightweight construction and breathable upper keep your feet cool and comfortable, while the robust outsole ensures traction and stability on any terrain. \n\nWhether you're hitting the trails, tackling a tough obstacle course, or just going for a run around the block, these shoes are the perfect choice. So why wait? Add the Hoka One One Hopara 'Oxford Tan' 1123112-OTOT to your collection today and experience the ultimate in comfort, performance, and style!",
    "price": "$252",
    "variants": {
      "tan": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_5beba4e8-1e92-4d88-b6f9-f13fb9729426_540x.jpg?v=1661998395"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "HOKA ONE ONE Bondi 7",
    "url": "https://www.kickscrew.com/products/hoka-one-one-bondi-7-white-1110518-wwh",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the pinnacle of cushioned running shoes: the HOKA ONE ONE Bondi 7 1110518-WWH. Designed with unparalleled comfort and support, this shoe is a must-have for runners and athletes alike.\n\nFeaturing HOKA's signature EVA midsole and Meta-Rocker technology, the Bondi 7 offers a plush and responsive ride with each stride. The engineered mesh upper provides a breathable and secure fit, while the reinforced overlays offer extra durability for long-lasting wear.\n\nWhether you're a seasoned runner or just starting out, the HOKA ONE ONE Bondi 7 1110518-WWH is the perfect partner for all your training needs. And with sizes available in English, French, German, Italian, Spanish and Greek, every athlete can experience the superior cushioning and comfort of the Bondi 7.\n\nStep up your running game and elevate your performance with the HOKA ONE ONE Bondi 7 1110518-WWH. Order yours today and feel the difference on your next run.",
    "price": "$266",
    "variants": {
      "WHITE": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_e3609fcf-ee9f-4f9e-bc21-8d5b46a17968_540x.jpg?v=1662064107"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "Hoka One One Tennine Hike GTX 'White'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-tennine-hike-gore-tex-white-nimbus-cloud-1123113-wncl",
    "category": "Athletic Shoes",
    "description": "Looking for a hiking shoe that can perform on any terrain? Look no further than the Hoka One One Tennine Hike GTX in 'White' 1123113-WNCL. This versatile and durable shoe is designed for the ultimate hiking experience.\n\nFeaturing a waterproof Gore-Tex upper, you can hike through rain, mud or even snow without getting your feet damp. The shoe's lightweight design and cushioned midsole make it easy to tackle any trail, while the Vibram Megagrip outsole ensures a strong grip on even the toughest terrain.\n\nLooking for comfort and support on longer hikes? The Hoka One One Tennine Hike GTX has got you covered. With a generous fit and cushioned collar, your feet will enjoy all-day comfort. Plus, the shoe's Hoka One One signature design offers excellent shock absorption for an enjoyable and pain-free hiking experience.\n\nHoka One One is renowned for their innovative and high-quality footwear, and the Tennine Hike GTX demonstrates why. So whether you're planning a challenging hike or a leisurely stroll, the Hoka One One Tennine Hike GTX is the perfect shoe for any adventure. Don't miss out on the opportunity to elevate your hiking experience with this exceptional shoe.",
    "price": "$265",
    "variants": {
      "WHITE": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_f281c5e2-e93f-4fdc-bd04-87ba5f47dbb3_540x.jpg?v=1662656739"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "HOKA ONE ONE Tor Ultra Low",
    "url": "https://www.kickscrew.com/products/hoka-one-one-tor-ultra-low-simply-taupe-1105689-simply-taupe",
    "category": "Hiking Shoes",
    "description": "Looking for a pair of shoes that will help you conquer even the toughest terrains? Look no further than the HOKA ONE ONE Tor Ultra Low 1105689-SIMPLY-TAUPE.\n\nCrafted with the utmost attention to detail, these shoes are designed to provide you with unparalleled comfort and superior durability, no matter where your adventures take you. With their low-cut design, they offer the perfect balance of support and freedom of movement, making them the ideal choice for hikers and outdoor enthusiasts.\n\nBut what really sets the HOKA ONE ONE Tor Ultra Low 1105689-SIMPLY-TAUPE apart from the crowd is their innovative construction. Featuring HOKA ONE ONE's signature Meta-Rocker technology, they provide a smooth, effortless ride that will help you conserve your energy when traversing steep inclines and rough terrain. Meanwhile, their Vibram MegaGrip outsole delivers exceptional traction, ensuring you stay firmly on your feet even in wet and slippery conditions.\n\nBut that's not all – the HOKA ONE ONE Tor Ultra Low 1105689-SIMPLY-TAUPE also features a range of other advanced technologies that are designed to take your performance to the next level. From their light yet durable construction to their advanced midsole cushioning, there's no question that these shoes have what it takes to elevate your outdoor experience to a whole new level.\n\nSo why wait? Snag a pair of HOKA ONE ONE Tor Ultra Low 110568",
    "price": "$901",
    "variants": {
      "SIMPLY TAUPE": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_65e0d910-4ef7-4ed9-b07c-b5be44f890a3_540x.jpg?v=1662114086"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "Hoka One One Clifton 7 'Black'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-clifton-7-black-1110508-bblc",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the Hoka One One Clifton 7 'Black' 1110508-BBLC, the perfect shoes for the dynamic and demanding lifestyle of today's fashion-forward individuals. These shoes feature a sleek and stylish design, making them the perfect choice for anyone looking to add a touch of sophistication to their wardrobe. \n\nCrafted using high-quality materials, these shoes are built to last for years, providing you with unparalleled comfort and support throughout the day. Whether you're running errands, enjoying a day out with friends, or hitting the gym for an intense workout, these shoes have got you covered. \n\nThe Hoka One One Clifton 7 'Black' 1110508-BBLC showcases innovative technology, ensuring that your feet stay comfortable and well-supported, no matter what the day throws at you. With a cushioned sole and breathable upper, these shoes provide a snug and secure fit, without compromising on style. \n\nSo, if you're looking for a versatile and elegant pair of shoes that will take your style game to the next level, look no further than the Hoka One One Clifton 7 'Black' 1110508-BBLC. With their premium quality and undeniable style, these shoes are perfect for anyone looking to make an impression in any situation. Don't wait any longer; get your hands on a pair today!",
    "price": "$323",
    "variants": {
      "BLACK": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_167c6a9a-1901-42aa-9723-f487761652d2_540x.jpg?v=1662075223"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "HOKA ONE ONE Carbon X-SPE",
    "url": "https://www.kickscrew.com/products/hoka-one-one-carbon-x-spe-team-kit-1110512-twh",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the ultimate running shoe – the HOKA ONE ONE Carbon X-SPE 1110512-TWH. Designed for runners who demand the highest performance, this shoe combines cutting-edge technology and unparalleled comfort to deliver the ultimate running experience.\n\nThe Carbon X-SPE utilizes a highly responsive carbon fiber plate that maximizes energy return with every stride, while also delivering a smooth and effortless ride. The shoe also features a PROFLY X foam midsole, which provides an ultra-soft and supportive cushioning that will keep you comfortable from start to finish.\n\nWith its highly breathable and lightweight mesh upper, this shoe ensures that your feet stay cool and dry, no matter how long your run. And thanks to its comfortable and secure fit, you'll be able to focus on your stride and enjoyment of the run, rather than any discomfort or distractions.\n\nAvailable in a timeless white color with blue accents, the HOKA ONE ONE Carbon X-SPE 1110512-TWH is the perfect running shoe for anyone seeking the ultimate in performance, comfort, and style. So why wait? Get yours today and take your running game to the next level!",
    "price": "$202",
    "variants": {
      "WHITEBLUE": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_1c1ef4db-f247-4854-9f2a-4c4006634d33_540x.jpg?v=1662137865"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "HOKA ONE ONE Carbon X 2",
    "url": "https://www.kickscrew.com/products/hoka-one-one-carbon-x-2-fiesta-1113526-fwt",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Looking for a shoe that is built for speed and comfort? Look no further than the HOKA ONE ONE Carbon X 2 running shoe.\n\nCrafted with the latest technology and materials, the Carbon X 2 will help you reach your running goals in no time. With a carbon fiber plate that adds propulsion and durability, these shoes will help you go the extra mile with ease. The lightweight foam midsole is responsive without weighing you down, while the wide base provides increased stability and comfort.\n\nThe sleek design of the Carbon X 2 is just as impressive as its performance features. The mesh upper is breathable and comfortable, while the subtle color accents are sure to turn heads.\n\nWhether you're gearing up for a race or just looking for a shoe that can keep up with your active lifestyle, the HOKA ONE ONE Carbon X 2 is the perfect choice. Get yours today and experience the ultimate combination of speed and comfort!",
    "price": "$323",
    "variants": {
      "Red/White": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_07288b37-ad0c-4b01-a70a-c69baf538443_540x.jpg?v=1662197801"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "Hoka One One Kaha Low GTX 'Black Charcoal Grey'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-kaha-low-gtx-black-1118586-bccg",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the Hoka One One Kaha Low GTX in 'Black Charcoal Grey' -the ultimate shoes that combine style, comfort and durability in one perfect package. \n\nDesigned with the latest technology and crafted with premium quality materials, these shoes are perfect for any adventure. Featuring a sleek black and charcoal grey colorway, these shoes will not only turn heads but also provide you with the ultimate support and traction you need for all your outdoor activities.\n\nFrom the rugged trails to the city streets, these shoes are the perfect fit. The combination of the waterproof Gore-Tex lining and breathable upper make these shoes ideal for any weather condition, keeping your feet dry and comfortable all day long.\n\nThe unmatched cushioning provided by the oversized midsole is the perfect addition for providing you with a plush landing and an energized takeoff for that extra push on your next hike or run. \n\nDon't compromise on style or comfort, get your hands on the Hoka One One Kaha Low GTX 'Black Charcoal Grey' 1118586-BCCG today and elevate your outdoor adventures to the next level!",
    "price": "$217",
    "variants": {
      "black": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_7051ffe8-5940-4931-8a9c-b543effdde96_540x.jpg?v=1661997552"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "HOKA ONE ONE x OC Ultra High 2",
    "url": "https://www.kickscrew.com/products/hoka-one-one-hoka-one-one-x-oc-ultra-high-2-white-beige-1114610-brwh",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the highly anticipated HOKA ONE ONE x OC Ultra High 2 sneakers in white and beige! These shoes are the perfect blend of style and performance, designed to elevate both your look and your athletic performance. \n\nCrafted from high-quality materials, these sneakers feature a breathable upper that promotes airflow to keep your feet cool and comfortable all day long. The innovative design provides incredible support for your feet, reducing the risk of injury and allowing you to tackle any challenge with confidence. \n\nWith their bold, eye-catching design and use of premium materials, the HOKA ONE ONE x OC Ultra High 2 sneakers are the perfect addition to any fashion-forward wardrobe. Whether you're hitting the gym for an intense workout or simply running errands around town, these shoes will keep you comfortable and stylish every step of the way.\n\nDon't settle for ordinary sneakers – upgrade your shoe game with the HOKA ONE ONE x OC Ultra High 2 in white and beige. Order yours today and experience the ultimate combination of form and function!",
    "price": "$535",
    "variants": {
      "White": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_7114ffad-0e26-4df4-8e46-cd9dccf05277_540x.jpg?v=1666833889"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "HOKA ONE ONE x Engineered Garment Bondi B",
    "url": "https://www.kickscrew.com/products/hoka-one-one-hoka-one-one-x-engineered-garment-bondi-b-multi-color-1107849-vpst",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Looking for a stylish and comfortable pair of shoes to elevate your daily routine? Say hello to the Hoka One One x Engineered Garment Bondi B sneakers! \n\nCollaborating with Engineered Garments, Hoka One One has created a unique multi-color design that combines fashion and function. The breathable upper material ensures your feet stay cool and comfortable all day long, while the ultra-cushioned sole provides superior support and shock absorption. \n\nWhether you're out for a morning jog or running errands around town, these sneakers offer a perfect blend of style and practicality. The attention to detail in the design means you'll look good and feel confident no matter where you go. \n\nSo why wait? Order your Hoka One One x Engineered Garment Bondi B sneakers today and step up your footwear game!",
    "price": "$258",
    "variants": {
      "RedYellow": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_719bf59f-10c2-4939-887e-39b57f79dd2c_540x.jpg?v=1656110313"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "Hoka One One Clifton Edge 'Nimbus Cloud Lunar Rock'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-clifton-edge-cloudy-grey-1110510-nclr",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the Hoka One One Clifton Edge in the stylish 'Nimbus Cloud Lunar Rock' colorway - the perfect running shoe for the modern athlete. With advanced cushioning technology and unparalleled style, this shoe is sure to be a game changer.\n\nLike running on a cloud, the Clifton Edge's state-of-the-art foam technology provides exceptional cushioning for your foot, reducing the risk of joint pain and discomfort. The shoe's lightweight construction also allows for easy movement and a smooth stride.\n\nBut it's not just the practical features that make the Clifton Edge special. The 'Nimbus Cloud Lunar Rock' colorway turns heads on the street and sets you apart on the trail. With its modern design and sleek finish, this shoe embodies both form and function.\n\nSo whether you're training for a marathon or just looking for stylish comfortable shoes, the Hoka One One Clifton Edge in 'Nimbus Cloud Lunar Rock' is sure to elevate your performance and style. Try them out today and experience the difference for yourself!",
    "price": "$264",
    "variants": {
      "white": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_ca7647ed-0538-4515-8e85-c5857e4f2b17_540x.jpg?v=1662138461"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "HOKA ONE ONE Ora Recovery Slide 3 'Black'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-ora-recovery-slide-3-black-1135061-bblc",
    "category": "Beach & Pool Slides/Slippers",
    "description": "1135061-BBLC",
    "price": "$66",
    "variants": {
      "black": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_19ac7ea6-5c2e-4e14-aa28-81d4d53f7813_540x.png?v=1682577700"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "HOKA ONE ONE Ora Luxe 'White'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-ora-luxe-white-1134150-wwh",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "1134150-WWH",
    "price": "$100",
    "variants": {
      "white": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/1134150-WWH___8_d88286c9-efba-487c-8f7f-64b529d831c6_540x.png?v=1682577171"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "HOKA ONE ONE Ora Clifton L Suede 'Cappuccino Cork'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-ora-clifton-l-suede-cappuccino-cork-1122571-cccr",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "1122571-CCCR",
    "price": "$180",
    "variants": {
      "BROWN": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/Group_2022_540x.png?v=1682576545"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "HOKA ONE ONE Ora Luxe 'Black'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-ora-luxe-black-1134150-bblc",
    "category": "Beach & Pool Slides/Slippers",
    "description": "1134150-BBLC",
    "price": "$100",
    "variants": {
      "Black": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_b9c0a887-cc0d-4f8e-a71c-b9ef800e035a_540x.jpg?v=1682576668"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "HOKA ONE ONE Ora Recovery Slide 3 'White'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-ora-recovery-slide-3-white-1135061-wwh",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "1135061-WWH",
    "price": "$75",
    "variants": {
      "white": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_6ba71cd9-3a29-4f5f-be53-c2c301e81306_540x.jpg?v=1682577830"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "Bodega x HOKA ONE ONE Tor Ultra Low 'Brown'",
    "url": "https://www.kickscrew.com/products/bodega-x-hoka-one-one-tor-ultra-low-brown-1145771-nbyl",
    "category": "Hiking Shoes",
    "description": "Introducing the Bodega x HOKA ONE ONE Tor Ultra Low 'Brown' sneakers, the perfect addition to your footwear collection. These shoes combine style and comfort, making them a must-have for any fashion-conscious individual.\n\nCrafted with premium quality materials and finished with signature touches from both brands, these sneaker shoes are designed to provide you with all-day comfort and support. The neutral brown color of the shoes makes them a versatile choice that can easily be paired with any outfit in your wardrobe.\n\nWhether you're hitting the town with friends or going for a casual trip, the Bodega x HOKA ONE ONE Tor Ultra Low 'Brown' sneakers are the perfect choice. The unique design of these shoes will make you stand out from the crowd, and turn heads wherever you go. \n\nSo elevate your shoe game and grab a pair of these stylish and functional sneakers today. Shop now and make a statement with your feet.",
    "price": "$341",
    "variants": {
      "None": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_3c69955d-3896-417d-a3e4-5e631657c359_540x.jpg?v=1680251122"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "Hoka One One Rocket X 'Black Evening Primrose'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-rocket-x-1113532-bepr",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Looking for a shoe that will help you take on any challenge? Look no further than the Hoka One One Rocket X 'Black Evening Primrose'!\n\nThis incredible shoe features a sleek and stylish black and primrose design, made with the highest-quality materials to keep you comfortable and supported no matter what you're doing. With a lightweight and responsive midsole, you'll be able to run, jump, and move with ease and speed - perfect for athletes and fitness enthusiasts of all levels.\n\nBut it's not just about performance - the Rocket X also looks great with any outfit, adding a touch of sophistication and style to your wardrobe. Available in a range of sizes and available in six different languages, this shoe is perfect for anyone looking for the ultimate combination of style, speed, and performance.\n\nSo why wait? Order your Hoka One One Rocket X 'Black Evening Primrose' today and start taking on the world!",
    "price": "$196",
    "variants": {
      "None": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_c0882c09-14f0-4767-8ea5-7b134c1a2684_540x.jpg?v=1675747935"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "HOKA ONE ONE Kaha Gore-Tex",
    "url": "https://www.kickscrew.com/products/hoka-one-one-kaha-gore-tex-otter-persimmon-orange-1112030-opor",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the ultimate trail shoe, the HOKA ONE ONE Kaha Gore-Tex 1112030-OPOR. Immerse yourself in comfort with these striking shoes designed for adventure seekers. \n\nThe Kaha Gore-Tex features innovative Gore-Tex technology that provides complete waterproof protection, ensuring your feet remain dry during the wettest of conditions. The shoes also include a Vibram Megagrip outsole for high-performance traction, giving you the confidence to tackle any terrain with ease.\n\nThe shoes' ultra-cushioned midsole delivers unparalleled support and stability throughout your adventures. You'll feel like you're floating on clouds with every stride you take. Plus, the rugged construction of these shoes is built to last, so you can depend on them when you need them the most.\n\nThe Kaha Gore-Tex 1112030-OPOR is available in a range of sizes, so you can find the perfect fit for your feet. Whether you're trekking through the mountains or exploring local trails, these shoes will provide superior support and comfort, allowing you to enjoy your journey to its fullest.\n\nDon't settle for anything less than the best. Get your hands on the HOKA ONE ONE Kaha Gore-Tex 1112030-OPOR today and take your next adventure to the next level.",
    "price": "$357",
    "variants": {
      "DEFAULT COLOR": {
        "image": ""
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "Hoka One One Mafate Origins 'White Lunar Rock'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-mafate-origins-white-1129971-wlrc",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the Hoka One One Mafate Origins 'White Lunar Rock' 1129971-WLRC, the ultimate trail running shoe for adventurers and nature enthusiasts! With its durable design and superior comfort, this shoe is perfect for exploring challenging terrains and conquering steep inclines.\n\nCrafted with precision, the Mafate Origins feature an updated collar pack with breathable mesh to keep your feet cool and comfortable. The thick cushioned sole provides excellent shock absorption and a responsive stride, so you can confidently tackle any path or trail. The outsole is engineered with Vibram® Megagrip technology, ensuring maximum traction on both wet and dry surfaces.\n\nExceptional durability is guaranteed with the Mafate Origins, as they are made with a lightweight yet robust mesh and synthetic upper that can withstand the tough elements of trail running. The Unique RMAT heel and outsole construction add strength and stability while maintaining flexibility for a dynamic ride.\n\nThe White Lunar Rock colourway is stylish and versatile, making it a great accessory to pair with any workout outfit. It boasts a minimalist design with subtle Hoka One One branding, creating a sleek and timeless look.\n\nExperience the ultimate in comfort and performance with the Hoka One One Mafate Origins 'White Lunar Rock' 1129971-WLRC. Order now and feel the difference with every step!",
    "price": "$423",
    "variants": {
      "WHITE/GRAY": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_4760d17e-37c0-4198-8681-b58534a6ae35_540x.jpg?v=1678691130"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "Hoka One One Kaha 2 Low GORE-TEX 'Oxford Tan'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-kaha-2-low-gore-tex-oxford-tan-1130530-otdn",
    "category": "Hiking Shoes",
    "description": "Step out in style and conquer the great outdoors with the Hoka One One Kaha 2 Low GORE-TEX in Oxford Tan! These shoes are the perfect blend of comfort, durability, and style - giving you everything you need for any adventure.\n\nCrafted with GORE-TEX technology, these shoes are waterproof and breathable, making them perfect for any weather conditions. Whether you're trekking through the mountains or splashing through puddles on a rainy day, the Kaha 2 Low will keep your feet dry and comfortable.\n\nFeaturing an Oxford Tan colorway, these shoes are as stylish as they are practical. The combination of suede and mesh materials create a rugged yet refined look, perfect for any outdoor enthusiast. Whether you're hitting the trails or exploring the city, these shoes will keep you looking and feeling your best.\n\nAnd let's talk about the comfort! The Kaha 2 Low comes packed with Hoka's signature cushioning technology, which provides extra support and comfort with every step. And the Vibram® Megagrip outsole ensures excellent traction on any terrain, giving you the confidence to take on any challenge.\n\nInvest in a shoe that will take you anywhere and everywhere. The Hoka One One Kaha 2 Low GORE-TEX in Oxford Tan is the perfect addition to any adventurer's shoe collection. Don't wait - get them today!",
    "price": "$333",
    "variants": {
      "tan": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_dcc5e95c-475f-4102-b46a-9ffd17392cc5_540x.jpg?v=1683090168"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "HOKA ONE ONE Challenger ATR 5 Gore-Tex",
    "url": "https://www.kickscrew.com/products/hoka-one-one-challenger-atr-5-gore-tex-1111990-adgg",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the HOKA ONE ONE Challenger ATR 5 Gore-Tex 1111990-ADGG - the perfect companion for adventurers seeking to conquer any terrain in any weather condition. With its durable and waterproof Gore-Tex technology, this shoe allows you to brave through any challenge without worrying about getting wet feet. \n\nThe Challenger ATR 5 Gore-Tex 1111990-ADGG is designed with comfort and performance in mind. Featuring a lightweight and breathable mesh upper, it provides optimal airflow for a cool and sweat-free experience. Meanwhile, the reinforced toe guard and high-abrasion rubber outsole ensure long-lasting durability even on the toughest trails. \n\nWhether you're running, hiking, or exploring new terrains, the Challenger ATR 5 Gore-Tex 1111990-ADGG delivers unparalleled stability and support. Its oversized EVA midsole and Meta-Rocker technology provide a smooth ride and a natural gait cycle that adapts to any surface. \n\nWith its sleek design and versatile color scheme, the Challenger ATR 5 Gore-Tex 1111990-ADGG is a must-have for any outdoor enthusiast. So why settle for less? Choose the best and push your limits with the HOKA ONE ONE Challenger ATR 5 Gore-Tex 1111990-ADGG - your ultimate partner in adventure.",
    "price": "$235",
    "variants": {
      "DEFAULT COLOR": {
        "image": ""
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "Hoka One One Mafate Origins 'Black'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-mafate-origins-black-1129971-bblc",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Are you looking for the ultimate trail running shoe? Look no further than the Hoka One One Mafate Origins 'Black'! With its state-of-the-art design and expert craftsmanship, this shoe delivers an unbeatable combination of comfort, support, and durability that's perfect for all your outdoor adventures.\n\nThe Hoka One One Mafate Origins 'Black' is crafted from premium materials that are both lightweight and breathable, making it a great choice for runners who demand air flow and extra cushioning. With its innovative design and high-quality construction, this shoe provides outstanding shock absorption and energy return, helping you to push harder and perform at your best no matter the terrain.\n\nBut what makes the Hoka One One Mafate Origins 'Black' truly special? Its sleek design is complemented by a range of features that enhance your running experience including a padded tongue, a secure lace-up closure, and a sticky rubber outsole that offers excellent traction on wet and dry surfaces. Additionally, it is available in eye-catching black finish, which is perfect for those who want to make a statement while staying ahead of the competition.\n\nOverall, the Hoka One One Mafate Origins 'Black' is the ultimate trail running shoe. With its unbeatable combination of comfort, performance, and durability, you can trust that your feet are in good hands when you hit the trails. Order yours today and get ready to dominate your next outdoor adventure!",
    "price": "$490",
    "variants": {
      "black": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_13afc055-4610-42eb-a07f-2b4ee49c7439_540x.jpg?v=1683438880"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "HOKA ONE ONE Anacapa Low Gore-Tex",
    "url": "https://www.kickscrew.com/products/hoka-one-one-anacapa-low-gore-tex-eggnog-1130531-essn",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the HOKA ONE ONE Anacapa Low Gore-Tex 1130531-ESSN - the perfect blend of technological innovation and style. Whether you're an avid hiker or simply an outdoor enthusiast, these shoes are designed to take you further, faster and in style.\n\nBoasting a waterproof Gore-Tex upper, these shoes will keep your feet dry no matter the weather conditions. The Anacapa Low also features a cushioned EVA midsole that helps absorb shock and reduce foot fatigue, allowing you to explore the great outdoors with ease.\n\nBut that's not all! The Anacapa Low also features HOKA ONE ONE's signature Meta-Rocker technology that encourages a more efficient, comfortable stride. And thanks to the multi-directional Vibram® Mega Grip outsole, you can tackle any terrain with confidence.\n\nWhether you're hitting the trails or running errands in style, the HOKA ONE ONE Anacapa Low Gore-Tex 1130531-ESSN is the perfect fit. And with six stylish colors to choose from, you can find the pair that best reflects your unique style. So why wait? Add the Anacapa Low to your collection today and discover the ultimate fusion of style and function!",
    "price": "$241",
    "variants": {
      "CREAM": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_eb40278f-ed50-4801-bc9a-9b493ffeea4f_540x.jpg?v=1683033566"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "Hoka One One Ora Recovery Slide 'Black'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-ora-recovery-slide-black-1134527-blk",
    "category": "Beach & Pool Slides/Slippers",
    "description": "Introducing the Hoka One One Ora Recovery Slide in stunning black - the ultimate footwear to pamper your feet after a long day of activity! Designed with a commitment to providing exceptional comfort and support, this stylish slide is perfect for post-workout relaxation or everyday wear.\n\nCrafted from premium materials, the Hoka One One Ora Recovery Slide boasts an EVA footbed and midsole for unbeatable cushioning and shock absorption. The Meta-Rocker technology enhances the natural rolling motion of the foot, reducing fatigue and improving overall comfort. Plus, the soft, breathable mesh upper allows your feet to breathe and stay cool all day long.\n\nWhether you're lounging around the house or taking a casual stroll, the Hoka One One Ora Recovery Slide is the perfect choice. With its unique blend of style and supreme comfort, you'll never want to take these off! So why wait? Add this incredible product to your cart today and experience the ultimate in foot pampering!",
    "price": "$72",
    "variants": {
      "BLACK": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main1_1eb58cb9-f1b4-4a8b-b1c8-fa7c86c9c475_540x.jpg?v=1667971873"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "Hoka One One Tor Ultra High GORE-TEX 'Eggnog Gum'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-tor-ultra-hi-eggnog-1129958-eggm",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the Hoka One One Tor Ultra High GORE-TEX 'Eggnog Gum' - the perfect hiking shoe for any outdoor adventure. With its sleek design and durable exterior, this shoe is sure to keep you comfortable and supported on even the toughest of terrains.\n\nFeaturing GORE-TEX technology, these shoes are completely waterproof, ensuring your feet stay dry no matter what the weather throws your way. The 'Eggnog Gum' colorway adds a stylish touch to your hiking gear, making it easy to transition from the trail to the city.\n\nBut it's not just about style - the Tor Ultra High GORE-TEX also boasts impressive performance features, including a Vibram Megagrip outsole for superior traction and a molded EVA midsole for ultimate cushioning and support. The high-top design ensures maximum ankle stability, while a reinforced toe cap offers further protection from debris.\n\nAvailable in multiple sizes, from men's 7 to 14, this shoe is perfect for any hiker, no matter their size. So why wait? Grab a pair of Hoka One One Tor Ultra High GORE-TEX 'Eggnog Gum' today and hit the trails with confidence!",
    "price": "$378",
    "variants": {
      "cream": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_dfb2ca2d-8559-4223-b5a2-a7a5b4beb535_540x.png?v=1683141512"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "Hoka One One Bondi 8 'Black'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-bondi-8-black-1123202-bblc",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the Hoka One One Bondi 8 in Black - the ultimate shoe for runners who demand both comfort and style. With its sleek design and cutting-edge features, this shoe is built to take on any terrain with ease.\n\nForget about the limitations of other running shoes - the Bondi 8 is designed to provide maximum cushioning and support with a full-length EVA midsole and early-stage Meta-Rocker technology that encourages a natural running gait. The shoe's breathable mesh upper ensures your feet stay cool and dry even during the most intense workouts.\n\nWhether you're a seasoned marathoner or a beginner runner, the Hoka One One Bondi 8 is the perfect shoe to take your training to the next level. With its six different language options, including English, French, German, Italian, Spanish and Greek, this shoe truly speaks to runners around the world.\n\nDon't compromise on comfort or style - elevate your running game with the Hoka One One Bondi 8 in Black. Order now and experience the ultimate in running shoe performance.",
    "price": "$159",
    "variants": {
      "BLACK": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_9ba1e132-4f40-4390-92ba-99cb6f4f278a_540x.jpg?v=1676610806"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "HOKA ONE ONE Speedgoat 4",
    "url": "https://www.kickscrew.com/products/hoka-one-one-speedgoat-4-black-1122892-bkgd",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the HOKA ONE ONE Speedgoat 4 1122892-BKGD, the ultimate trail shoe that delivers unbeatable performance and style. Built for runners who thrive on challenging terrain, this shoe is designed to help you conquer any trail with ease.\n\nCrafted with the latest technologies and premium materials, the Speedgoat 4 delivers a comfortable fit and superior support for your feet. Its lightweight and breathable construction keeps your feet cool and dry during even the most grueling of runs, while its rugged outsole provides unrivaled grip and traction on rough terrain.\n\nWhether you're an experienced trail runner or a beginner looking for a dependable shoe, the HOKA ONE ONE Speedgoat 4 1122892-BKGD is the perfect choice. With its sleek black and gold design, this shoe is sure to turn heads and make a statement wherever you run.\n\nExperience the ultimate in performance and style with the HOKA ONE ONE Speedgoat 4 1122892-BKGD. Order yours today and start exploring the trails like never before.",
    "price": "$174",
    "variants": {
      "BLACK / GOLD": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_a45b8766-ab0d-4093-b1ce-3fffcac552a9_540x.jpg?v=1662723059"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "HOKA ONE ONE Clifton Edge",
    "url": "https://www.kickscrew.com/products/hoka-one-one-clifton-edge-lunar-rock-1110510-lrwh",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the HOKA ONE ONE Clifton Edge, the perfect combination of style and substance! With its sleek design and advanced technology, this shoe is a must-have for any serious athlete or fitness enthusiast.\n\nCrafted with precision and care, the Clifton Edge boasts a range of features that set it apart from the competition. Whether you're looking to hit the pavement for a morning run or tackle a challenging workout, this shoe has got you covered.\n\nExperience the ultimate in comfort and support thanks to the shoe's EVA foam midsole and extended heel. Designed to absorb shock and reduce impact, you'll be able to take your training to the next level without worrying about discomfort or injury. The Clifton Edge also features a breathable upper, ensuring your feet stay cool and dry no matter how intense your workout gets.\n\nBut this shoe is more than just a technical marvel – it's also a stylish statement piece that's sure to turn heads. With its classic white colorway and bold branding, the Clifton Edge is the perfect choice for those who want to look as good as they feel.\n\nSo why settle for anything less than the best? Invest in the HOKA ONE ONE Clifton Edge today and take your training to the next level!",
    "price": "$227",
    "variants": {
      "GRAY": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_2dd0bff6-2a30-4dbd-bdba-438f1c7dd670_540x.jpg?v=1662649293"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "Hoka One One Kaha 2 Gore Tex 'Oxford Tan Dune'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-kaha-2-gore-tex-oxford-tan-1130529-otdn",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the Hoka One One Kaha 2 Gore Tex shoes in the stunning 'Oxford Tan Dune' colorway. These shoes are perfect for those who want to add a touch of style to their outdoor adventures.\n\nCrafted with Gore Tex technology, they'll keep your feet dry in wet conditions, while providing breathability for all-day comfort. The chunky sole provides superior cushioning and will keep you stable on uneven terrain.\n\nWith a sleek design and stunning color scheme, these shoes will elevate your hiking game. The mesh upper is durable and adds breathability, while the rubber toe cap provides extra protection from bumps and bruises.\n\nDon't compromise between style and functionality. Get the Hoka One One Kaha 2 Gore Tex 'Oxford Tan Dune' shoes now and take on any trail with ease. Order now and get ready to conquer the great outdoors!",
    "price": "$255",
    "variants": {
      "tan": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_af240773-1603-4f9f-b31b-f890bac59748_540x.jpg?v=1683090167"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "Hoka One One Kaha GORE-TEX 'Celadon Tint Basil'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-kaha-gore-tex-celadon-tint-1123370-ctbs",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Looking for premium footwear that offers style, comfort, and protection against harsh weather conditions? Look no further than the Hoka One One Kaha GORE-TEX in 'Celadon Tint Basil'! \n\nCrafted with the finest materials and attention to detail, these shoes feature a GORE-TEX membrane that helps keep your feet dry from rain, puddles, and slush. The durable outsole provides a strong grip on any terrain, so you can tackle the great outdoors with confidence. \n\nBut don't let the practical features fool you - the 'Celadon Tint Basil' colorway is absolutely stunning. Whether you're hitting the trails or exploring the city, these shoes will turn heads and make a statement. \n\nWith their plush cushioning, lightweight construction, and seamless design, the Hoka One One Kaha GORE-TEX shoes offer all-day comfort and support. And with their multi-lingual sizing options, you can ensure a perfect fit for all feet. \n\nInvest in the best footwear for any adventure with the Hoka One One Kaha GORE-TEX in 'Celadon Tint Basil'.",
    "price": "$241",
    "variants": {
      "green": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_c2c32e96-bbbe-4bf9-93f3-fbc337632b20_540x.jpg?v=1683221928"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "Hoka One One Anacapa Mid Gore Tex 'Black'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-anacapa-mid-gore-tex-black-1122018-bblc",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the Hoka One One Anacapa Mid Gore Tex in sleek black - a hiking boot that's as stylish as it is functional! \n\nCrafted from premium-quality materials, this boot is built to last, and features cutting-edge Gore Tex technology for ultimate waterproofing and breathability. You'll stay dry and comfortable on the roughest terrains thanks to the durable rubber outsole and cushioned midsole, which are engineered to provide maximum support and stability. \n\nThe Anacapa Mid Gore Tex is perfect for both seasoned hikers and beginners alike, with a flexible fit that allows for natural movement and a secure lace closure for a snug fit. And with its classic yet modern design, you can wear these hiking boots with practically any outfit. \n\nDon't let anything slow you down on your outdoor adventures, and order the Hoka One One Anacapa Mid Gore Tex now! It's time to step up your hiking game with these premium boots.",
    "price": "$179",
    "variants": {
      "black": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_148e65ee-1d7d-4794-a41e-97a1382c5db4_540x.jpg?v=1683299372"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "HOKA ONE ONE Hupana 2 x Engineered Garments",
    "url": "https://www.kickscrew.com/products/hoka-one-one-hupana-2-x-engineered-garments-polka-dot-black-1097429-bboy",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the HOKA ONE ONE Hupana 2 x Engineered Garments – the perfect blend of style and function. Designed with performance in mind, these shoes are engineered to provide the ultimate running experience. \n\nFeaturing cutting-edge technology, the Hupana 2 x Engineered Garments are designed with premium materials to ensure maximum durability and comfort. The sleek, modern style is enhanced by the bold cobalt blue and orange colorway, making a statement wherever you go.\n\nWhether you're training for a marathon or just enjoying a casual jog around the park, these shoes are the perfect choice. The lightweight design allows for effortless movement, while the cushioned sole provides superior comfort and support with every step.\n\nBut these shoes aren't just about functionality - they're also designed to make a fashion statement. With the collaboration of HOKA ONE ONE and Engineered Garments, these shoes are a fashion-forward addition to any sneaker collection.\n\nDon't settle for anything less than the best. Get your hands on the HOKA ONE ONE Hupana 2 x Engineered Garments today and experience the perfect blend of style and function.",
    "price": "$377",
    "variants": {
      "DEFAULT COLOR": {
        "image": ""
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "HOKA ONE ONE Challenger Low Gore-Tex",
    "url": "https://www.kickscrew.com/products/hoka-one-one-challenger-low-gore-tex-charcoal-grey-1106517-cgfs",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the HOKA ONE ONE Challenger Low Gore-Tex 1106517-CGFS, the ultimate trail-running shoe designed for adventure seekers. With its advanced Gore-Tex technology, this shoe is sure to keep your feet dry even in the wettest conditions. \n\nCrafted with the highest quality materials, the HOKA ONE ONE Challenger Low Gore-Tex 1106517-CGFS features a durable outsole that provides superior traction on any terrain, from rocky trails to muddy puddles. The midsole technology offers incredible cushioning and support, making every step comfortable and effortless. \n\nWhether you're exploring unknown territories or running a marathon, the HOKA ONE ONE Challenger Low Gore-Tex 1106517-CGFS is the perfect shoe for you. It's available in a variety of sizes and colors, allowing you to find the perfect fit that matches your style. \n\nSo, don't let anything stand in your way. Get your hands on the HOKA ONE ONE Challenger Low Gore-Tex 1106517-CGFS today and take your running experience to the next level.",
    "price": "$231",
    "variants": {
      "DEFAULT COLOR": {
        "image": ""
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "Hoka One One Tennine Hike GTX 'Sand'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-tennine-hike-gore-tex-shifting-sand-otter-1123113-ssot",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "The Tennine Hike GTX 'Sand' by Hoka One One is a perfect blend of style and functionality. Whether you're going for a casual stroll or an intense hike, this shoe is designed to keep your feet comfortable and protected. Made from premium materials, it boasts a unique design that's both rugged and stylish.\n\nFeaturing GORE-TEX® technology, these shoes are fully waterproof, making them perfect for wet conditions. The breathable lining ensures your feet stay cool and dry, while the Vibram® Megagrip outsole provides excellent traction on any surface. The midsole is made from EVA foam, providing cushioning and support for all-day comfort.\n\nThe Tennine Hike GTX is not just practical, it is also visually stunning. The 'Sand' colorway is perfect for autumn or any outdoor excursion. The sleek and stylish design will make you stand out, while the durable construction is sure to last for seasons to come. Whether you're a fashionista or a nature lover, this shoe is the perfect choice.\n\nGet your hands on the Hoka One One Tennine Hike GTX 'Sand' 1123113-SSOT today and experience both fashion and function in one amazing shoe!",
    "price": "$208",
    "variants": {
      "CREAM": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_3de2f757-9c13-4069-b3e5-d0a838693366_540x.jpg?v=1683090167"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "HOKA ONE ONE Bondi L",
    "url": "https://www.kickscrew.com/products/hoka-one-one-bondi-l-auburn-chili-1110538-achl",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the HOKA ONE ONE Bondi L, the ultimate running shoe that's designed to help you achieve your personal best in comfort and style. With its sleek and modern design, the Bondi L is sure to elevate your running game to the next level.\n\nCrafted with quality and durability in mind, this shoe features a breathable mesh upper that keeps your feet cool and dry during intense workouts. The padded tongue and collar provide extra support and help prevent uncomfortable blisters from forming. Plus, the roomy toe box ensures plenty of wiggle room for your toes.\n\nBut what really sets the HOKA ONE ONE Bondi L apart from the rest is its innovative cushioning system. The Bondi L features HOKA's signature EVA midsole that's designed to provide maximum cushioning and support for your feet. The Meta-Rocker technology promotes a smooth transition from heel to toe, reducing fatigue and improving overall performance.\n\nAnd with its versatile colorway, the Bondi L is the perfect choice for any runner looking to add some style to their stride. Whether you're hitting the pavement or taking on the trails, the HOKA ONE ONE Bondi L is guaranteed to help you power through your runs with ease and comfort.\n\nSo why wait? Upgrade your running game today with the HOKA ONE ONE Bondi L, the perfect blend of style and performance!",
    "price": "$144",
    "variants": {
      "DEFAULT COLOR": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_3c90ad55-87b9-48b9-9e33-c39eed455d1a_540x.jpg?v=1667972269"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "HOKA ONE ONE Bondi X",
    "url": "https://www.kickscrew.com/products/hoka-one-one-bondi-x-black-white-1113512-bwht",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the HOKA ONE ONE Bondi X 1113512-BWHT – the ultimate running shoe for anyone looking to take their performance to the next level. These shoes feature cutting-edge technology and innovative design to deliver the ultimate running experience.\n\nWith a sleek, low-profile silhouette and a breathable mesh upper, these shoes are designed to keep your feet cool and comfortable no matter how intense your workout is. The midsole features HOKA ONE ONE's signature EVA cushioning, offering unparalleled support and shock absorption for a smooth, comfortable ride.\n\nPerfect for both experienced runners and those just starting out, the HOKA ONE ONE Bondi X 1113512-BWHT is built to last. The durable rubber outsole provides excellent traction on a variety of surfaces, while the reinforced toe cap and heel counter offer added protection and support.\n\nWhether you're training for a marathon or just looking to stay active, the HOKA ONE ONE Bondi X 1113512-BWHT has everything you need to achieve your goals. So why wait? Invest in the best and enjoy the ultimate performance and comfort with every step. Shop now and experience the difference today!",
    "price": "$196",
    "variants": {
      "DEFAULT COLOR": {
        "image": ""
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "Hoka One One Speedgoat 4 GTX 'Anthracite'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-speedgoat-4-gore-tex-anthracite-1106530-adgg",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "\"Unmatched Comfort\", \"Top-Quality Design\", \"Ultimate Performance\", \"Adapt to Any Terrain\", \"Stay Dry in Any Weather\", \"Premium Materials\", and \"Exceptional Durability\".\n\nAre you looking for a pair of trail shoes that offer unmatched comfort, top-quality design and ultimate performance? Look no further than the Hoka One One Speedgoat 4 GTX 'Anthracite' 1106530-ADGG. Engineered with the latest materials and technologies, these shoes are designed to adapt to any terrain and keep your feet dry in any weather.\n\nCrafted with premium materials, the Hoka One One Speedgoat 4 GTX 'Anthracite' 1106530-ADGG is the perfect choice for any trail runner looking for exceptional durability and unparalleled comfort. Whether you are tackling rocky mountains or muddy trails, the Speedgoat 4 GTX is equipped to handle anything you throw at it.\n\nSo why wait? Upgrade your trail running game with the Hoka One One Speedgoat 4 GTX 'Anthracite' 1106530-ADGG and experience the difference. Order your pair today and get ready to conquer any terrain in style!",
    "price": "$183",
    "variants": {
      "black": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_70a629a7-ebda-4f5f-9e23-41310e9c6a2d_540x.jpg?v=1683386908"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "Hoka One One Kaha Low GTX 'Celadon Tint Basil'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-kaha-low-gore-tex-celadon-tint-basil-1123114-ctbs",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the Hoka One One Kaha Low GTX in 'Celadon Tint Basil' colorway - the perfect footwear for your outdoor adventures! Crafted with premium materials, this shoe is designed to withstand any terrain and weather conditions.\n\nThe low-cut design of the Kaha Low GTX ensures maximum mobility without sacrificing support and stability. The GORE-TEX membrane provides waterproof protection, keeping your feet dry and comfortable even in the wettest of conditions. The Vibram Megagrip outsole ensures reliable traction on any surface, making the Kaha Low GTX indispensable for all your hiking and trekking needs.\n\nNot only is the Kaha Low GTX performance-driven, but it also boasts a sleek and stylish design. The 'Celadon Tint Basil' colorway adds an extra touch of flair to your outdoor gear, making it the perfect choice for any fashion-forward adventurer.\n\nIn summary, the Hoka One One Kaha Low GTX in 'Celadon Tint Basil' colorway is the ultimate combination of performance and style. Don't let weather or terrain hold you back from exploring - get yourself a pair and get ready to conquer any adventure that comes your way!",
    "price": "$299",
    "variants": {
      "white": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_de2fe997-9776-4f2e-b717-c1a908cf6f46_540x.jpg?v=1682513009"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "HOKA ONE ONE Challenger Low Gore-Tex",
    "url": "https://www.kickscrew.com/products/hoka-one-one-challenger-low-gore-tex-black-1106517-blk",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Looking for a high-performance shoe that can handle any terrain or weather with ease? Look no further than the HOKA ONE ONE Challenger Low Gore-Tex 1106517-BLK!\n\nCrafted with the latest Gore-Tex technology, this shoe is waterproof and breathable, keeping your feet warm and dry even in the harshest of conditions. With a low-cut design, it provides flexibility and freedom of movement, whether you're hiking through rugged terrain or hitting the pavement on a wet day.\n\nThanks to its sturdy outsole and HOKA's signature cushioning, every step you take will feel light and comfortable, minimizing impact and providing much-needed support for your feet. And with its sleek black design, this shoe is both stylish and versatile, making it the perfect choice for any adventure.\n\nOrder your HOKA ONE ONE Challenger Low Gore-Tex 1106517-BLK today and experience the ultimate in performance footwear. You won't be disappointed!",
    "price": "$251",
    "variants": {
      "DEFAULT COLOR": {
        "image": ""
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "HOKA ONE ONE Kaha Low Gore-Tex",
    "url": "https://www.kickscrew.com/products/hoka-one-one-kaha-low-gore-tex-otter-persimmon-orange-1118586-opor",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the ultimate terrain conquering shoe - the HOKA ONE ONE Kaha Low Gore-Tex 1118586-OPOR. Designed for the adventurous souls, this footwear provides unparalleled comfort and performance in any weather condition, whether you're conquering rocky trails or muddy paths.\n\nCrafted with durable Gore-Tex material, this shoe is guaranteed to keep your feet dry and protected while providing breathability to your every step. The full-length EVA-foam midsole delivers signature HOKA cushioning, ensuring optimal shock absorption on even the toughest terrain. \n\nEquipped with a Vibram Megagrip outsole, you can say \"goodbye\" to slipping, because this shoe effortlessly grips onto any surface, providing superior traction on slippery rocks or wet surfaces, keeping you stable and confident at all times.\n\nWith a low cut, the Kaha Low Gore-Tex molds to your feet, providing maximum support without compromising on flexibility. Perfect for outdoor adventures, this shoe is available in sizes that cater to a wide range of foot sizes, and comes in a vibrant OPOR color that exudes style.\n\nIf you're looking for a shoe that combines function with fashion, look no further than the HOKA ONE ONE Kaha Low Gore-Tex 1118586-OPOR -the perfect footwear for any hiker, runner or adventurer! Shop now and experience the ultimate comfort and durability.",
    "price": "$222",
    "variants": {
      "BROWN": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_333830cc-9531-41bc-afb9-a87fb83c6b76_540x.jpg?v=1683091367"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "Hoka One One Tor Ultra Low GORE-TEX 'Black'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-tor-ultra-low-black-1130310-bblc",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Looking for the perfect pair of shoes to take on any terrain? Look no further than the Hoka One One Tor Ultra Low GORE-TEX 'Black' 1130310-BBLC. \n\nThese shoes are designed with the adventurous outdoor explorer in mind, featuring a GORE-TEX waterproof membrane to keep your feet dry in any weather. The low-cut design provides maximum stability and support, with a Vibram MegaGrip outsole for unbeatable traction on even the toughest terrains. \n\nBut it's not just about function - the sleek black design of these shoes will have you looking stylish on the trail or in the city. And with Hoka One One's signature cushioned midsole and meta-rocker technology, you'll experience a smooth, comfortable ride every step of the way. \n\nDon't settle for less when it comes to your outdoor footwear. Invest in the Hoka One One Tor Ultra Low GORE-TEX 'Black' 1130310-BBLC and take your adventures to the next level.",
    "price": "$469",
    "variants": {
      "BLACK": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_b20298d6-c023-45ab-ab14-e09ed984c4f1_540x.jpg?v=1676559814"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "Hoka One One Tor Ultra Low GORE-TEX 'Simply Taupe'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-tor-ultra-low-simply-taupe-1130310-stpst",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the Hoka One One Tor Ultra Low GORE-TEX in 'Simply Taupe' - the perfect shoe for the serious hiker. With its combination of innovative technology and sleek design, this shoe is the ultimate companion for any outdoor adventure. Whether you're trekking through rugged terrain or cruising through muddy trails, the Hoka One One Tor Ultra Low GORE-TEX has got you covered.\n\nCrafted with the highest quality materials, this shoe features a GORE-TEX waterproof membrane to keep your feet dry and comfortable no matter the weather conditions. The Vibram MegaGrip outsole provides superior traction and durability, while the meta-rocker technology ensures a smooth and stable ride.\n\nThe 'Simply Taupe' colorway adds a touch of style to the overall design, making it easy to pair with your favorite hiking gear. And, with sizes available for both men and women, everyone can enjoy the comfort and performance of the Hoka One One Tor Ultra Low GORE-TEX.\n\nInvesting in a high-quality hiking shoe like this is a no-brainer. Don't let uncomfortable footwear hold you back from experiencing the great outdoors. Upgrade your hiking experience with the Hoka One One Tor Ultra Low GORE-TEX and explore with confidence.",
    "price": "$483",
    "variants": {
      "brown": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_4810fcec-2e67-4f0d-869b-09a84209615f_540x.jpg?v=1683126331"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "Hoka One One Tor Ultra Hi Gore Tex 'Simply Taupe'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-tor-ultra-hi-simply-taupe-1129958-stpst",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the Hoka One One Tor Ultra Hi Gore Tex in 'Simply Taupe' - the ultimate hiking shoe for outdoor enthusiasts! This shoe combines the latest Gore Tex technology with innovative design to create a durable, lightweight, and versatile shoe that can tackle any terrain.\n\nFeaturing a high-top design, the Tor Ultra Hi Gore Tex provides exceptional support and stability for your ankles, while its multi-directional lugs offer superior traction on both wet and dry surfaces. Its plush EVA midsole balances cushioning and responsiveness, giving you a comfortable and effortless ride no matter the distance.\n\nCrafted with a waterproof Gore Tex membrane, this shoe guarantees to keep your feet dry and comfortable even in the most challenging weather conditions. Its reinforced upper with a rubberized toe cap and heel counter provides additional protection against rocks and other debris, making it the perfect companion for any adventure.\n\nAvailable in the stylish 'Simply Taupe' colorway, this shoe is sure to make a statement on the trail while providing the ultimate comfort and protection for your feet. Don't settle for anything less. Choose the Hoka One One Tor Ultra Hi Gore Tex for your next outdoor excursion!",
    "price": "$433",
    "variants": {
      "brown": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_eba1060e-fc39-40db-acb2-80f00c9bf9b1_540x.jpg?v=1683126330"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "Hoka One One Anacapa Low Gore Tex 'Black'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-anacapa-low-gore-tex-black-1122017-bblc",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Get ready to take on the great outdoors in style with the Hoka One One Anacapa Low Gore Tex in 'Black'! Designed with both fashion and function in mind, these shoes are sure to impress.\n\nCrafted with a waterproof Gore Tex upper, these shoes will keep your feet dry even during the wettest of adventures. Plus, the lower cut design provides a more flexible, comfortable fit that allows you to move with ease.\n\nThe black color scheme adds a sleek, versatile touch to any outfit while the Hoka One One brand ensures top-tier performance. With a reputation for producing some of the most comfortable and supportive footwear on the market, these shoes won't disappoint.\n\nDon't let any terrain hold you back - the Anacapa Low is equipped with a durable outsole designed to provide superior traction, making it the perfect choice for hiking, running, or any adventure that comes your way.\n\nSo why wait? Take your outdoor game to the next level with the Hoka One One Anacapa Low Gore Tex in black. Order yours today and experience the perfect blend of fashion and function!",
    "price": "$199",
    "variants": {
      "BLACK": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_36cea5cc-83d1-417a-82d6-8674aebaf6b6_540x.jpg?v=1662656738"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "Hoka One One Bodega x Kaha Low GTX 'Martini Olive Almond'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-kaha-low-gore-tex-x-bodega-martini-olive-1129077-moal",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the Hoka One One Bodega x Kaha Low GTX 'Martini Olive Almond' - a true masterpiece that combines style and performance in one sleek package. Designed in collaboration with Bodega, this stunning shoe boasts premium materials and a design that's unlike anything you've seen before.\n\nCrafted with an incredibly durable Gore-Tex upper, the Hoka One One Bodega x Kaha Low GTX 'Martini Olive Almond' provides ultimate protection from the elements. Whether you're out on a trail run or exploring the urban jungle, your feet will stay warm and dry no matter what. \n\nBut it's not just practicality that makes this shoe stand out - it's also incredibly stylish. With a unique colorway of 'Martini Olive Almond', these shoes are sure to turn heads and make a fashion statement wherever you go. \n\nAnd let's not forget about the performance. The Hoka One One Bodega x Kaha Low GTX 'Martini Olive Almond' features a sturdy Vibram sole that provides excellent grip and traction on even the most challenging surfaces. The shoe also features a heavily cushioned midsole, providing maximum comfort and support for your feet during long runs and other physical activities.\n\nDon't miss out on the opportunity to own a pair of these coveted shoes. Add the Hoka One One Bodega x Kaha Low GTX 'Martini Olive Almond' to your collection today and experience the ultimate combination of style and performance.",
    "price": "$444",
    "variants": {
      "green": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_45b7d9e9-61b3-4a25-a25e-8875a34a3800_540x.jpg?v=1681905450"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "Hoka One One Bodega x Ora Recovery Slide 'Martini Olive'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-ora-recovery-slide-x-bodega-martini-olive-1129090-mojb",
    "category": "Beach & Pool Slides/Slippers",
    "description": "Introducing the Hoka One One Bodega x Ora Recovery Slide 'Martini Olive' - a shoe that's perfect for those who demand both style and functionality. Whether you're rushing out to the gym or simply running errands, these shoes will keep your feet comfortable and fashionable all day long.\n\nCrafted with the highest quality materials, these slides are designed to provide superior support and cushioning, no matter where your day takes you. The 'Martini Olive' colorway is the perfect combination of sleek and stylish, making these shoes suitable for work or play.\n\nDesigned in collaboration with Bodega and Ora Recovery, these slides are a true statement piece, representing the perfect union of both brands' distinctive styles. The slide's innovative one-piece EVA injection-molded construction offers a lightweight and flexible feel, while its early-stage meta-rocker offers a supportive and dynamic ride.\n\nWhether you're looking for a great addition to your shoe collection or need a stylish and functional pair of slides for your next workout, the Hoka One One Bodega x Ora Recovery Slide 'Martini Olive' is the perfect choice. So why wait? Add these slides to your cart now and upgrade your shoe game today!",
    "price": "$201",
    "variants": {
      "green": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_4fc7b36c-18dd-49f6-a126-f0e8ca5dc50a_540x.jpg?v=1667972137"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "HOKA ONE ONE Clifton L",
    "url": "https://www.kickscrew.com/products/hoka-one-one-clifton-l-oxford-tan-1114770-otdn",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the HOKA ONE ONE Clifton L 1114770-OTDN - the perfect combination of style, comfort, and functionality. This shoe is designed to enhance your running experience and take your performance to the next level.\n\nCrafted with the highest quality materials, the Clifton L 1114770-OTDN boasts a durable construction that will withstand even the toughest of terrains. The breathable upper allows for maximum ventilation, keeping your feet dry and comfortable no matter how intense your workout.\n\nFeaturing a lightweight, responsive sole, this shoe is engineered to optimize your running experience, providing unparalleled support and a smooth ride. With its stylish design and superior functionality, the HOKA ONE ONE Clifton L 1114770-OTDN is the perfect choice for runners of all levels.\n\nWhether you're hitting the pavement for a quick jog or training for your next marathon, the HOKA ONE ONE Clifton L 1114770-OTDN will help you achieve your goals. Order yours today and experience the ultimate in performance and comfort!",
    "price": "$241",
    "variants": {
      "BROWN": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_4e11feca-ede1-463b-a0b5-57065e9abcf8_540x.jpg?v=1683144248"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "HOKA ONE ONE Clifton L 'White Graygreen'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-clifton-l-white-green-ash-1114770-wgas",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the HOKA ONE ONE Clifton L 'White Graygreen' 1114770-WGAS, the perfect blend of style and comfort. Whether you're hitting the pavement or the trails, these sneakers have got you covered.\n\nCrafted with precision, the HOKA ONE ONE Clifton L feature an ultra-soft memory foam footbed that conforms to your feet, providing all-day comfort that feels like walking on clouds. The sleek white and gray-green colorway adds a touch of sophistication to your everyday footwear collection, making them the perfect choice for any outfit.\n\nWith a durable and lightweight design, the HOKA ONE ONE Clifton L is perfect for all your outdoor adventures. Whether you're running, hiking, or simply enjoying a casual walk, these sneakers offer superior support and protection for your feet. The sturdy rubber outsole ensures unparalleled grip and traction, even on the most rugged terrain.\n\nSo, don't settle for ordinary sneakers; upgrade your shoe game with the HOKA ONE ONE Clifton L 'White Graygreen' 1114770-WGAS. Order now and experience the ultimate combination of style, comfort, and performance. Your feet will thank you!",
    "price": "$196",
    "variants": {
      "WHITE/GRAYGREEN": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_be96675d-9e1f-4133-8548-4ac5af8d1485_540x.jpg?v=1662112590"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "HOKA ONE ONE Clifton L",
    "url": "https://www.kickscrew.com/products/hoka-one-one-clifton-l-wan-blue-mandarin-red-1114770-wbmr",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Looking for the perfect running shoe? Look no further than the HOKA ONE ONE Clifton L 1114770-WBMR. \n\nCrafted for serious runners, this shoe is designed with comfort and performance in mind. The Clifton L features a lightweight construction, making it easy to move and run with ease. Plus, the unique sole design provides optimal cushioning, so you can run for miles without any discomfort. \n\nIn addition, the HOKA ONE ONE Clifton L is stylish, with a unique design that sets it apart. Whether you're hitting the pavement or the trails, this shoe is sure to turn heads. \n\nFinally, these shoes are available in six different languages: English, French, German, Italian, Spanish, and Greek. So no matter where you are in the world, you can enjoy the comfort and performance of the HOKA ONE ONE Clifton L 1114770-WBMR. \n\nUpgrade your running game and invest in the HOKA ONE ONE Clifton L today. Your feet (and your running time) will thank you!",
    "price": "$188",
    "variants": {
      "DEFAULT COLOR": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_061e659c-c061-4ee1-b131-42a423b037af_540x.jpg?v=1662197804"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "Hoka One One Moncler x Mafate Speed 2 'Nimbus Cloud Harbor Mist'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-speed-2-x-moncler-mafate-white-1129992-nchms",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Step up your running game with the Hoka One One Moncler x Mafate Speed 2 'Nimbus Cloud Harbor Mist' 1129992-NCHMS shoes. These sneakers are the perfect blend of style and performance, designed to take your workout to the next level. \n\nThe unique collaboration between Hoka One One and Moncler brings together cutting-edge technology and high-end fashion to create a shoe that is both functional and fashionable. With a striking Nimbus Cloud Harbor Mist colorway and standout design elements, these shoes are sure to turn heads whether you're running on the trails or hitting the pavement. \n\nOf course, looks aren't everything. These shoes also feature all of the high-tech features that Hoka One One is known for. The Mafate Speed 2 delivers exceptional stability and support, thanks to a lightweight and durable construction that will keep you comfortable even on the longest runs. The Vibram MegaGrip outsole ensures maximum traction on any surface, while the breathable upper and cushioned footbed keep your feet cool and comfortable no matter how hard you push yourself.\n\nWhether you're an experienced runner or just starting out, the Hoka One One Moncler x Mafate Speed 2 'Nimbus Cloud Harbor Mist' 1129992-NCHMS shoes are an investment in your performance and your style. Order yours today and step up your game!",
    "price": "$638",
    "variants": {
      "white": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_215a79be-e1c5-4599-90f0-6e87e0f3b555_540x.jpg?v=1683354990"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "HOKA ONE ONE Speed 2 x Moncler Mafate",
    "url": "https://www.kickscrew.com/products/hoka-one-one-speed-2-x-moncler-mafate-white-g2-096-4m70800-m1688-001",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the ultimate fusion of fashion and functionality: the HOKA ONE ONE Speed 2 x Moncler Mafate G2-096-4M70800-M1688-001. As the name suggests, this shoe is the result of a collaboration between HOKA ONE ONE and luxury fashion brand Moncler, and it certainly delivers on both form and function.\n\nNot only does the Speed 2 x Moncler Mafate look sleek and stylish in the classic Moncler colorway of black and white, but it is packed with high-performance features that will take your running to the next level. The HOKA ONE ONE signature cushioned midsole provides supreme comfort and support, while also helping to reduce the impact on your joints with each stride.\n\nThe Vibram Megagrip outsole is designed for maximum traction, so you can take on any terrain with ease. Whether you're racing through the city streets or hitting the trails, you can be confident that your footing will remain secure.\n\nBut that's not all – the Speed 2 x Moncler Mafate also features a breathable upper material that helps to keep your feet cool and dry, even during intense workouts. And with sizes available for both men and women, everyone can experience the unbeatable combination of style and substance that this shoe has to offer.\n\nSo why settle for ordinary running shoes, when you can have the best of both worlds? Treat yourself to the HOKA ONE ONE Speed",
    "price": "$638",
    "variants": {
      "DEFAULT COLOR": {
        "image": ""
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "Hoka One One Kaha GORE-TEX 'Black Olive Green'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-kaha-gtx-olive-1112030-bogr",
    "category": "Hiking Shoes",
    "description": "Introducing the Hoka One One Kaha GORE-TEX in sleek black olive green- the perfect combination of style and performance for your outdoor adventures. With its waterproof and breathable GORE-TEX membrane, your feet will stay dry and comfortable even in the harshest weather conditions. \n\nBut that's not all - the Kaha features a premium, full-grain leather upper that ensures durability for all of your rugged expeditions. Its ankle-cut design also provides added support and protection to prevent injuries on challenging terrains. \n\nThe patented Hoka One One technology delivers unmatched comfort and cushioning, reducing impact and fatigue during long hours on your feet. The Vibram Megagrip outsole provides superior traction on wet and slippery surfaces, giving you confidence to tackle any trail with ease. \n\nWith sizes available in English, French, German, Italian, Spanish, and Greek, the Kaha GORE-TEX will cater to any adventurer from around the world. Don't settle for ordinary hiking shoes - treat yourself to the ultimate hiking experience and shop the Hoka One One Kaha GORE-TEX today.",
    "price": "$229",
    "variants": {
      "ARMY GREEN": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_53237f6b-85d3-4000-be41-6b22d2623b56_540x.jpg?v=1661997146"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "HOKA ONE ONE Bondi L x Engineered Garments",
    "url": "https://www.kickscrew.com/products/hoka-one-one-bondi-l-x-engineered-garments-brown-croc-1127737-bclt",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the must-have collaboration of the year - the HOKA ONE ONE Bondi L x Engineered Garments 1127737-BCLT sneakers! These kicks are not only stylish but packed with features to enhance your running experience.\n\nThe upper is made of a unique combination of suede and 1000D Cordura nylon for durability, and the iconic oversized EVA midsole guarantees maximum cushioning for those long runs. The rubber outsole provides unmatched traction, delivering a smooth and stable ride with every stride.\n\nBut what sets these sneakers apart is the exceptional style brought by Engineered Garments, featuring monochromatic tones and a retro-inspired design. These sneakers are the perfect fusion of fashion and function, so you can hit the road in style without compromising your performance.\n\nWhether you're running, walking, or simply running errands, the HOKA ONE ONE Bondi L x Engineered Garments 1127737-BCLT sneakers are your perfect companion. Get your pair today and take your daily routine to the next level!",
    "price": "$386",
    "variants": {
      "BROWN": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_880ee7db-436e-4445-8e1f-4ed3ee68dd46_540x.jpg?v=1683641914"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "Hoka One One Engineered Garments x Bondi L 'Leopard'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-bondi-l-x-engineered-garments-sand-leopard-print-1127736-slpt",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Attention all stylish runners and sneaker fans! The Hoka One One Engineered Garments x Bondi L 'Leopard' (style code 1127736-SLPT) is here to elevate your footwear game to new heights. Designed in collaboration with the renowned Japanese brand, Engineered Garments, this limited edition sneaker is a true masterpiece.\n\nCrafted with the perfect blend of style and performance, this statement shoe features a bold leopard print upper that is sure to turn heads. The Hoka One One cushioned sole provides unparalleled comfort and support, allowing you to take on any terrain with ease. Whether you're sprinting through the city or powering through your training routine, these sneakers will help you achieve your goals.\n\nAnd that's not all! This exclusive collaboration also includes a unique design with both brand logos on the tongue, adding an extra touch of sophistication to this already stylish sneaker. No matter your taste or style, the Hoka One One Engineered Garments x Bondi L 'Leopard' 1127736-SLPT is the perfect shoe for any fashion-forward athlete. Don't miss out on this limited edition release and order yours now!",
    "price": "$285",
    "variants": {
      "brown": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_e29b9bd6-5ae7-4a25-8c62-ddb758162863_540x.jpg?v=1683641914"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "HOKA ONE ONE Ora Recovery",
    "url": "https://www.kickscrew.com/products/hoka-one-one-ora-recovery-slide-black-1099673-bblc",
    "category": "Beach & Pool Slides/Slippers",
    "description": "Looking for a comfortable and stylish way to recover after your workouts? Look no further than the HOKA ONE ONE Ora Recovery 1099673-BBLC!\n\nCrafted with our signature cushioned design, these sandals provide superior support and comfort for tired feet. The synthetic upper material is easy to clean and dries quickly, perfect for post-workout wear.\n\nWith a sleek and modern design, these sandals are perfect for on-the-go style. The navy blue and black colorway is sure to complement any outfit, while the adjustable strap allows for a customizable and secure fit.\n\nWhether you're hitting the gym or simply running errands, the HOKA ONE ONE Ora Recovery 1099673-BBLC is the ultimate way to relax and recharge after a long day. Don't miss out on this must-have addition to your footwear collection!",
    "price": "$72",
    "variants": {
      "BLACK": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_fafc4259-bd0b-4a63-91db-e9fded666b58_540x.jpg?v=1661997441"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "HOKA ONE ONE Clifton Edge 'Black Blue'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-clifton-edge-black-aquarelle-1110510-baqr",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the HOKA ONE ONE Clifton Edge in 'Black Blue' - the ultimate running shoe for serious athletes and casual runners alike. With its innovative design and advanced technology, this shoe is the perfect choice for anyone looking to take their performance to the next level.\n\nFeaturing a bold and stylish black and blue colorway, the HOKA ONE ONE Clifton Edge 1110510-BAQR is not only functional, but it also looks fantastic. The shoe is packed with state-of-the-art technology, including an extended heel design that provides a smooth heel-to-toe transition, making every stride feel effortless.\n\nThe shoe's upper is constructed from a breathable and lightweight material, offering maximum comfort and support for hours on end. The EVA foam midsole provides superior cushioning and shock absorption, allowing you to keep going even on the toughest of terrain.\n\nIn addition, the HOKA ONE ONE Clifton Edge 1110510-BAQR is available in six languages, including English, French, German, Italian, Spanish, and Greek. This means that no matter where you are in the world, you can get your hands on these incredible shoes and experience the ultimate in running performance.\n\nIf you're looking for a high-quality running shoe that will help you go the extra mile, look no further than the HOKA ONE ONE Clifton Edge 'Black Blue' 1110510-BAQR. Your feet will thank you for it!",
    "price": "$173",
    "variants": {
      "BLACK/BLUE": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_d5d52985-fa5d-425e-ac76-c31f889d8c20_540x.jpg?v=1662112463"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "HOKA ONE ONE Hopara",
    "url": "https://www.kickscrew.com/products/hoka-one-one-hopara-white-nimbus-cloud-1123112-ncwt",
    "category": "Sandals",
    "description": "Introducing the HOKA ONE ONE Hopara 1123112-NCWT, the ultimate outdoor shoe for athletes who tackle any terrain with confidence and style. With its lightweight construction and rugged durability, these shoes are a perfect combination of comfort and performance for adventurous runners.\n\nThe Hopara 1123112-NCWT features an innovative Vibram Megagrip outsole that provides exceptional traction and stability on even the toughest surfaces. Whether it's rocky, muddy or uneven terrain, these shoes will keep you firmly grounded and in control. The midsole is crafted from HOKA's signature EVA foam, designed to cushion your feet and minimize impact while you run. \n\nThe upper of the Hopara 1123112-NCWT is made of breathable mesh, supported by a durable TPU overlay that protects your feet from debris on the trail. The shoe's gusseted tongue keeps dirt and rocks out while the padded collar adds an extra layer of comfort around your ankle.\n\nDesigned for versatility, the Hopara 1123112-NCWT is perfect for trail running, hiking, or simply exploring the great outdoors. With its easy-to-use lace closure system, you can quickly adjust the fit to your liking, while the reinforced toe cap adds an extra layer of protection for your toes.\n\nExperience the ultimate in performance and style with the HOKA ONE ONE Hopara 1123112-NCWT. Ideal for active individuals who demand the best from their gear, these shoes",
    "price": "$304",
    "variants": {
      "CREAMGRAY": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_5e855e97-71ab-499b-9d44-bfedc2735989_540x.jpg?v=1661997603"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "HOKA ONE ONE Carbon X 2 'White Blue'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-carbon-x-2-white-blazing-orange-1113526-wbor",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the HOKA ONE ONE Carbon X 2 in a sleek and stylish 'White Blue' colorway! Engineered by experts in performance footwear, this running shoe is the perfect combination of comfort, support and speed.\n\nWith cutting-edge technology and premium materials, the Carbon X 2 is designed to help you go further, faster. The shoe features a carbon fiber plate within its midsole, which provides a propulsive sensation with every stride. This innovative design helps to enhance your natural running gait and reduce fatigue, so you can run longer and stronger. \n\nThe shoe also features HOKA ONE ONE's signature plush and resilient cushioning system, making it ideal for long-distance runners who want to minimize the impact on their joints during training. The upper is crafted from a lightweight mesh material, which allows for breathability and flexibility, allowing you to move with ease.\n\nWhether you're a seasoned runner or a beginner looking to take your training to the next level, the HOKA ONE ONE Carbon X 2 is the perfect choice. So why wait? Lace up and experience the ultimate in performance footwear today!",
    "price": "$202",
    "variants": {
      "WHITE/BLUE": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_d6b48b73-ff45-4bcd-acd8-a368245ac42a_540x.jpg?v=1662016282"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "Hoka One One Clifton 8 'Real Teal'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-clifton-8-real-teal-1119393-rtar",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the ultimate running companion - the Hoka One One Clifton 8 in Real Teal! With its sleek design and advanced technology, this shoe will take your training to the next level. \n\nExperience unparalleled comfort and durability with Hoka One One's signature Meta-Rocker technology, designed to guide your foot forward with each stride. The Clifton 8's engineered mesh upper provides breathability and support, while a plush collar ensures a snug fit without sacrificing comfort. \n\nThanks to its full-length EVA foam midsole, this shoe offers superior cushioning and shock absorption, so you can run harder and longer without feeling fatigued. The Clifton 8's outsole is made from strategically placed rubber to provide excellent traction and durability. \n\nNot only does the Hoka One One Clifton 8 perform like a dream, it looks like one too. The Real Teal colorway adds a pop of color to any running ensemble, making it the perfect shoe to stand out on the track or trail. \n\nDon't wait any longer to elevate your running game. Order your Hoka One One Clifton 8 in Real Teal today and experience the difference for yourself!",
    "price": "$169",
    "variants": {
      "teal": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_7dc44b08-2dd3-4397-9148-be6bd675d9f0_540x.png?v=1661997145"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "Hoka One One Anacapa Low Gore Tex 'Tiger's Eye Tan'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-anacapa-low-tan-1122017-tebc",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the Hoka One One Anacapa Low Gore Tex in 'Tiger's Eye Tan' - a shoe that perfectly combines style and functionality. Whether you're hitting the trails, running errands or just going for a casual stroll, these shoes are sure to impress.\n\nCrafted with a durable Gore Tex upper, these shoes can withstand any weather conditions, so you can feel confident wearing them rain or shine. The unique 'Tiger's Eye Tan' colorway adds a touch of sophistication to your outfit, making these shoes perfect for any occasion.\n\nBut what really sets the Hoka One One Anacapa Low Gore Tex apart from the rest is the comfort and support it provides. With a cushioned midsole that absorbs impact and a sturdy outsole that provides excellent traction, you won't want to take these shoes off. \n\nSo why settle for anything less than the best? Take a step in the right direction with the Hoka One One Anacapa Low Gore Tex in 'Tiger's Eye Tan' - the perfect combination of style and functionality. Shop now and experience the ultimate in comfort and style.",
    "price": "$202",
    "variants": {
      "BROWN": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_6849494b-c180-45fc-a6c4-3cda05ca1bc2_540x.jpg?v=1661997615"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "Hoka One One Bondi 7 'Persimmon Orange'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-bondi-7-persimmon-orange-1110518-pofs",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the Hoka One One Bondi 7 in Persimmon Orange! \n\nThis shoe is the perfect combination of style and comfort, with its vibrant orange color and innovative design. Featuring Hoka's signature cushioned sole, you'll feel like you're walking on a cloud with every step. The Bondi 7's updated mesh upper is not only breathable, but also provides a secure and comfortable fit. \n\nWhether you're running errands or going for a long hike, the Bondi 7 has got you covered. And with its durable construction, this shoe is built to last. Plus, its bold persimmon orange color is sure to turn heads and make a statement. \n\nDon't wait any longer, add the Hoka One One Bondi 7 to your shoe collection today and experience the ultimate comfort and style.",
    "price": "$134",
    "variants": {
      "ORANGE": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_e26552a7-9a6a-4ca1-964c-50efb3e1cf71_540x.jpg?v=1662063921"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "HOKA ONE ONE Bondi 7",
    "url": "https://www.kickscrew.com/products/hoka-one-one-bondi-7-black-1110518-batl",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "HOKA ONE ONE Bondi 7 1110518-BATL\n\nLooking for a shoe that will provide support, cushioning and comfort? Look no further than the HOKA ONE ONE Bondi 7 1110518-BATL!\n\nThis shoe is the perfect combination of style and function, allowing you to feel confident and comfortable no matter where you go. With its innovative design, the Bondi 7 delivers supreme cushioning that will keep you feeling light on your feet, even during prolonged wear. \n\nThe 1110518-BATL features a beautiful dark blue shade that will make you stand out from the crowd. Its synthetic and mesh upper construction delivers ultimate breathability for your feet, while the EVA midsole ensures maximum shock absorption, helping to reduce the impact on your joints.\n\nThis shoe is perfect for running, walking, or even casual wear, with its exceptional combination of style and functionality. Whether you're hitting the pavement for a marathon or just running errands around town, the HOKA ONE ONE Bondi 7 1110518-BATL is the perfect shoe for you. \n\nOrder one today and experience the unparalleled comfort, support and style that only HOKA ONE ONE can deliver.",
    "price": "$242",
    "variants": {
      "BLACK": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_98f0775f-852b-46ce-9748-aa8158f638b7_540x.jpg?v=1662197332"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "HOKA ONE ONE Bondi L",
    "url": "https://www.kickscrew.com/products/hoka-one-one-bondi-l-celery-lima-bean-1122572-clmb",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the HOKA ONE ONE Bondi L 1122572-CLMB, the perfect shoe for runners who prioritize comfort and performance. With its sleek and modern design, this shoe is sure to turn heads on your next run.\n\nFeaturing HOKA ONE ONE's signature cushioned sole, every step you take will feel like you're walking on clouds. Whether you're tackling a long-distance run or a quick jog around the block, the Bondi L's superior shock absorption will keep your feet feeling fresh and energized.\n\nBut what really sets the HOKA ONE ONE Bondi L 1122572-CLMB apart from the competition is its versatility. With a durable rubber outsole that provides exceptional grip and traction, this shoe is perfect for a variety of terrain, from concrete streets to dirt trails.\n\nAnd with its breathable mesh upper, your feet will stay cool and dry even during intense workouts. Available in a range of sizes and six different languages, including English, French, German, Italian, Spanish and Greek, there's a Bondi L for every runner out there.\n\nDon't sacrifice comfort for performance – get the best of both worlds with the HOKA ONE ONE Bondi L 1122572-CLMB. Order now and experience the ultimate in running shoes.",
    "price": "$233",
    "variants": {
      "YELLOW": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_6f80550e-1ef3-4e2e-9c9a-11b9b69a5357_540x.jpg?v=1662114155"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "Hoka One One Kaha Low GTX 'Lunar Rock'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-kaha-low-gtx-lunar-rock-1123114-lrwh",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the Hoka One One Kaha Low GTX in 'Lunar Rock', the ultimate footwear for your outdoor adventures! Designed to provide all the support, durability, and comfort that you need, these shoes are perfect for hikers, runners, and explorers of all skill levels.\n\nCrafted with premium materials, these shoes feature a waterproof Gore-Tex membrane that ensures your feet stay dry and comfortable in any weather. The Vibram Megagrip outsole offers unbeatable traction and grip on tricky terrain, while the EVA midsole provides cushioning and support for all-day comfort.\n\nWith an updated, low-cut design, the Kaha Low GTX delivers a sleek and modern look that is perfect for city walks and wilderness treks alike. The Lunar Rock color scheme perfectly complements any outfit, making this shoe a versatile addition to your wardrobe.\n\nSo whether you're scaling mountains or strolling through the park, the Hoka One One Kaha Low GTX in 'Lunar Rock' is the perfect companion for all your outdoor adventures. Get ready to take on the world in style and comfort!",
    "price": "$458",
    "variants": {
      "grey": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_78bf4ca6-a43a-4c18-b91e-0ceb8c4a0121_540x.jpg?v=1661997445"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "Hoka One One Bondi L 'Simply Taupe'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-bondi-l-wild-dove-dark-shadow-1122572-stpst",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "The Hoka One One Bondi L in 'Simply Taupe' (1122572-STPST) is the perfect blend of unparalleled comfort and stylish design. As one of the most sought-after sneakers in the market today, this shoe delivers the ultimate combination of cushioning, stability, and durability, all while keeping your feet looking ravishing even in the most rigorous exercises.\n\nCrafted with a unique mix of synthetic leather and mesh upper, this runner is both breathable and lightweight, keeping your feet cool and comfortable even on the hottest days. The full-length EVA midsole and Meta-Rocker technology work together to deliver a smooth ride that's unbeatable in the industry.\n\nBut what truly sets the Hoka One One Bondi L apart from its competitors is its impressive traction and grip. The rubber outsole is engineered to provide excellent traction on both wet and dry surfaces, ensuring that you're always in control of your movements.\n\nWhether you're a professional athlete or a casual runner, the Hoka One One Bondi L in 'Simply Taupe' (1122572-STPST) is a must-have addition to your shoe collection. With its exceptional features, stunning design, and multi-language label, this shoe is perfect for runners of all skill levels and language backgrounds. Order yours today and experience the ultimate comfort and support that only Hoka One One can deliver!",
    "price": "$227",
    "variants": {
      "brown": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_e9e3254c-a7a0-4434-bb5d-654f0db39c1e_540x.jpg?v=1662132877"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "Hoka One One Tennine Hike GTX 'Black'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-tennine-hike-gtx-black-1113510-bdggr",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Looking for a shoe that can keep up with your adventurous spirit? Look no further than the Hoka One One Tennine Hike GTX in classic black!\n\nDesigned for the serious hiker and outdoor enthusiast, these rugged shoes feature advanced materials and technologies to keep you comfortable and protected on even the toughest trails. The Gore-Tex membrane provides unbeatable waterproofing, keeping your feet dry and comfortable in any weather, while the Vibram Megagrip outsole delivers superior traction and stability on even the most challenging terrain.\n\nBut that's not all - these shoes also feature Hoka One One's signature cushioning technology, which cradles your feet in cloud-like comfort and absorbs shock with every step. And with a sleek design that's both stylish and functional, these shoes are the perfect choice for your next hiking adventure.\n\nSo don't wait - order your Hoka One One Tennine Hike GTX shoes today and take on the great outdoors in style and comfort!",
    "price": "$260",
    "variants": {
      "BLACK": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_49465fd2-bac7-4b6d-9388-aeef3e9bfaf8_540x.jpg?v=1662112540"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "Hoka One One thisisneverthat x Speedgoat 4 'Marshmallow Cyan'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-speedgoat-4-x-thisisneverthat-marshmallow-cyan-1123010-mcyb",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the Hoka One One thisisneverthat x Speedgoat 4 'Marshmallow Cyan' - the perfect blend of style and function for the ultimate running experience. This collaborative shoe boasts a stunning marshmallow and cyan colorway that's guaranteed to turn heads.\n\nCrafted with the latest technology, the Speedgoat 4 is designed for serious runners who demand the best. Featuring a breathable upper mesh, a wider forefoot for improved stability and a Vibram® Megagrip outsole for unparalleled traction on any terrain, this shoe is durable and reliable.\n\nWhether you're hitting the trails or grinding out miles on the pavement, the Hoka One One thisisneverthat x Speedgoat 4 'Marshmallow Cyan' is the perfect choice for a comfortable and stylish run. So why wait? Upgrade your running game today with this must-have shoe!",
    "price": "$173",
    "variants": {
      "cream": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_f087531f-4c6f-47f5-b297-0de185277628_540x.jpg?v=1662197621"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "Hoka One One Clifton L 'Grey Mist'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-clifton-l-grey-mist-1122571-gmmb",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the Hoka One One Clifton L 'Grey Mist' 1122571-GMMB – the perfect shoe for taking your runs to the next level. With its sleek and stylish design, this shoe is as comfortable as it is eye-catching.\n\nFeaturing a cushioned midsole, this shoe is made for long-distance running, providing unparalleled support and comfort that will keep you going mile after mile. The Clifton L also features a breathable upper that keeps your feet cool and dry during even the most intense workouts.\n\nBut that's not all – the Hoka One One Clifton L also features durable construction and excellent traction, allowing you to tackle even the toughest terrain with ease. Whether you're hitting the pavement or heading out on a trail run, this shoe is up for any challenge.\n\nSo why wait? Order your Hoka One One Clifton L 'Grey Mist' 1122571-GMMB today and experience the ultimate in comfort, style, and performance.",
    "price": "$252",
    "variants": {
      "green": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_cee385ac-8be6-447b-8ebc-dbb44d595d56_540x.jpg?v=1661998754"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "HOKA ONE ONE Carbon X 2 'Blue Yellow'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-carbon-x-2-diva-blue-citrus-1113526-dbctr",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Looking for the ultimate running experience? Look no further than the HOKA ONE ONE Carbon X 2 in Blue Yellow. This expertly crafted shoe is designed to help runners reach their fullest potential with every stride they take. \n\nEquipped with advanced features like a carbon fiber plate in the midsole, the HOKA ONE ONE Carbon X 2 delivers maximum energy return, helping you effortlessly glide through even the toughest terrain. A breathable mesh upper ensures your feet stay cool and comfortable, while the bold blue and yellow design guarantees you'll look stylish while hitting your goals.\n\nBut the HOKA ONE ONE Carbon X 2 isn't just about performance - it's also about comfort. With its plush cushioning and supportive fit, this shoe feels like a dream on your feet, even after miles of running. \n\nWhether you're a seasoned pro or just getting started, the HOKA ONE ONE Carbon X 2 is the perfect shoe for taking your running to the next level. So why wait? Step up your game with the HOKA ONE ONE Carbon X 2 in Blue Yellow today!",
    "price": "$321",
    "variants": {
      "BLUE/YELLOW": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_bf0d51ab-5560-4f4a-82c8-5515f02a70be_540x.jpg?v=1662113312"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "HOKA ONE ONE Rocket X",
    "url": "https://www.kickscrew.com/products/hoka-one-one-rocket-x-eggshell-blue-1113532-ebbc",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Looking for a shoe that will take your running experience to the next level? Look no further than the HOKA ONE ONE Rocket X! This revolutionary shoe is designed with the latest technology to help you reach your full potential.\n\nThe Rocket X is incredibly lightweight, yet still provides superior support and stability for your feet. Its innovative design features a carbon fiber plate that helps maximize energy return, making every stride more efficient and powerful. And with its responsive foam midsole, you'll feel like you're gliding over the pavement with ease.\n\nWhether you're training for a marathon, or just looking for a shoe to take on your daily run, the Rocket X is the perfect choice. With its sleek and stylish design, it's a shoe that you can wear with confidence both on and off the track.\n\nChoose the HOKA ONE ONE Rocket X and experience the best running of your life. Available in six languages and colors. Don't miss out on this top-rated shoe – order yours today!",
    "price": "$169",
    "variants": {
      "BLUE": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_ea66be5c-0d77-48de-a9e5-98014a253ec8_540x.jpg?v=1662103104"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "HOKA ONE ONE Clifton L",
    "url": "https://www.kickscrew.com/products/hoka-one-one-clifton-l-chalk-violet-lilac-ash-1122571-cvla",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the ultimate running shoe - HOKA ONE ONE Clifton L 1122571-CVLA! Whether you're a seasoned runner or just starting out on your fitness journey, these shoes offer unparalleled comfort, support and style.\n\nCrafted with precision, the HOKA ONE ONE Clifton L 1122571-CVLA boasts a sleek and modern design that will turn heads everywhere you go. The high-quality material used in this shoe makes it lightweight and breathable, ensuring that your feet stay comfortable even during the longest and most challenging runs.\n\nThe HOKA ONE ONE Clifton L 1122571-CVLA is specifically designed to cushion and support your feet with every stride. The plush foam insole and midsole serve as shock absorbers, making it easier for you to power through even the toughest terrain. The shoe also features reinforced stability, helping to prevent injuries and maintain your stride.\n\nApart from its amazing features, the HOKA ONE ONE Clifton L 1122571-CVLA comes in a variety of colors, so you can choose the one that best reflects your personal style. Whether you're hitting the track or taking on new trails, these shoes will keep you comfortable and stylish every step of the way.\n\nDon't settle for anything less than the best. Elevate your running game with the HOKA ONE ONE Clifton L 1122571-CVLA. Order now and experience a running shoe like never before!",
    "price": "$208",
    "variants": {
      "DEFAULT COLOR": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_06adf6c3-c7b3-4a81-a5cf-a1d6d117ec43_540x.jpg?v=1662197382"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "Hoka One One Kaha Low GTX 'Simply Taupe Bungee Cord'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-kaha-low-gtx-taupe-bungee-cord-1123114-stbcr",
    "category": "Hiking Shoes",
    "description": "Introducing the Hoka One One Kaha Low GTX in the stylish 'Simply Taupe Bungee Cord' colorway, the perfect blend of fashion and function. Designed with outdoor enthusiasts in mind, these shoes are perfect for exploring the trails, navigating rocky terrain, or simply pounding the pavement. \n\nFeaturing a waterproof Gore-Tex membrane, your feet will stay dry and comfortable no matter what the weather throws at you. The plush EVA midsole and Meta-Rocker technology provide a smooth ride, reducing impact and improving stability. \n\nBut it's not just about comfort and function with the Kaha Low GTX - the unique 'Simply Taupe Bungee Cord' colorway is sure to turn heads on your next adventure. This versatile color pairs perfectly with everything from earthy tones to bold colors, making them a must-have in any fashion-forward wardrobe. \n\nAvailable in sizes suitable for men and women, and crafted with the utmost care, the Hoka One One Kaha Low GTX 'Simply Taupe Bungee Cord' 1123114-STBCR is the perfect addition to your footwear collection. Order today and experience the perfect blend of style and substance.",
    "price": "$285",
    "variants": {
      "brown": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_48510bda-ec2d-4702-8523-dcf7a9de4cbd_540x.jpg?v=1662199661"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "HOKA ONE ONE Challenger ATR 6 'Black Gray Yellow'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-challenger-atr-6-ombre-blue-1106510-obgs",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the HOKA ONE ONE Challenger ATR 6 'Black Gray Yellow' 1106510-OBGS - the ultimate trail running shoe for the adventurous and daring! Elevate your running experience with this top-of-the-line shoe designed with HOKA's renowned style and performance.\n\nCrafted with the highest quality materials, the Challenger ATR 6 boasts a perfect blend of durability, comfort, and style. The shoe's black and gray upper features striking yellow highlights that catch the eye and give it a unique, modern look. Built with a dual-layer mesh that lets your feet breathe and a wider toe-box for added comfort, it’s perfect for those long runs or strenuous hikes.\n\nWith a well-cushioned midsole and a strategic tread design, the Challenger ATR 6 provides exceptional support and stability on any terrain - whether it's a rocky mountain trail or a wet forest floor. Its balanced design ensures a smooth ride with responsive toe-off, allowing you to tackle any obstacle with ease.\n\nAnd that's not all! The HOKA ONE ONE Challenger ATR 6 'Black Gray Yellow' 1106510-OBGS is perfect for long-lasting durability thanks to its ripstop fabric, designed to resist wear and tear. With a shoe like this, you'll be able to run to your heart's content without worrying about the wear and tear of your footwear.\n\nDon't wait any longer to bring your running game to the next level. Add the H",
    "price": "$400",
    "variants": {
      "BLACK/GRAY/YELLOW": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_eea75b8f-56b5-4d0e-8dbc-eb17f7cdbbca_540x.jpg?v=1662137253"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "Hoka One One Clifton 7 'Almond Milk Bronze'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-clifton-7-almond-milk-1110508-ambn",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Looking for a game-changer in your running shoe game? Look no further than the Hoka One One Clifton 7 in Almond Milk Bronze. The 1110508-AMBN model is the perfect combination of style and function, designed to deliver a smooth, comfortable ride mile after mile.\n\nCrafted with precision and expertise, the Clifton 7 is a must-have for runners of all levels. The lightweight and breathable upper provides a snug fit and maximum airflow to keep your feet cool and dry during the toughest workouts. The midsole features Hoka's signature foam technology, providing exceptional cushioning and support to protect your joints and reduce fatigue.\n\nBut don't just take our word for it - try them out for yourself and experience the difference. With six versatile languages to choose from on the product label, including English, French, German, Italian, Spanish, and Greek, the Clifton 7 is the ultimate running shoe for global athletes everywhere.\n\nSo why wait? Treat yourself to the best running shoe on the market with the Hoka One One Clifton 7. Whether you're hitting the pavement or grinding out miles on the treadmill, you'll be ready to tackle any challenge with confidence and style. Get yours today and elevate your running game to new heights!",
    "price": "$362",
    "variants": {
      "cream": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_a5749a0d-c8c7-49b5-9417-84210d9b23d4_540x.jpg?v=1662149429"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "HOKA ONE ONE Clifton Edge",
    "url": "https://www.kickscrew.com/products/hoka-one-one-clifton-edge-triple-black-1126570-bblc",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the HOKA ONE ONE Clifton Edge 1126570-BBLC – the perfect union of form and function. Experience the pinnacle of comfort, style, and performance with HOKA's revolutionary design.\n\nCrafted with unparalleled expertise, the Clifton Edge features a unique, eye-catching design that is sure to make you stand out from the rest. The unique upper construction provides superior breathability and a sock-like fit, guaranteeing maximum comfort for your feet. The shoes' lightweight construction also ensures that you can run for hours without any discomfort.\n\nThe HOKA ONE ONE Clifton Edge 1126570-BBLC has been designed to provide exceptional cushioning, responsiveness and durability. The expertly designed midsole ensures that you can take on any terrain with ease – whether it's a long stretch of road or a rocky trail. The outsole is built to last, providing consistent grip and stability, even on wet or slippery surfaces.\n\nWhether you're an athlete looking for high-performance footwear or an avid runner seeking comfort and style, the HOKA ONE ONE Clifton Edge 1126570-BBLC is the perfect choice. With sleek lines, expert construction, and superior design, these shoes are sure to set you apart from the crowd. Order now and experience the ultimate in comfort and style!",
    "price": "$327",
    "variants": {
      "BLACK": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_a7b5778d-a629-4abf-a087-407a1f569385_540x.jpg?v=1683178231"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "Hoka One One Bondi 7 'High Risk Red'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-bondi-7-hoka-one-one-bondi-7-1110518-hrrb",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Looking for the perfect running shoe to take your workouts to the next level? Look no further than the Hoka One One Bondi 7 in 'High Risk Red'!\n\nWith its striking and bold design, the Bondi 7 in 'High Risk Red' is sure to turn heads and inspire confidence on the track or the trail. But this shoe isn't just about looks - it's also packed with features that make it an essential part of any fitness routine.\n\nOne of the key features of the Bondi 7 is its thick, plush midsole that's designed to provide unrivaled cushioning and support. Whether you're logging mile after mile or tackling high-intensity intervals, this shoe will keep your feet feeling good and your stride strong.\n\nBut don't just take our word for it - try the Bondi 7 for yourself and experience the difference that Hoka One One's innovative design can make. With six languages to choose from, including English, French, German, Italian, Spanish, and Greek, there's no excuse not to add a pair of these must-have shoes to your collection today. So why wait? Order your Hoka One One Bondi 7 in 'High Risk Red' now and take your workouts to the next level!",
    "price": "$400",
    "variants": {
      "red": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_d7ee5f45-e023-469c-8e34-35de50af003f_540x.jpg?v=1662050730"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "Hoka One One Engineered Garments x Bondi L 'Black'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-bondi-l-x-engineered-garments-black-cow-hair-1127734-bcwh",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Experience the ultimate blend of comfort and style with the Hoka One One Engineered Garments x Bondi L 'Black'. This stunning shoe boasts a sleek black design, accented with a pop of white that creates a bold and eye-catching look. \n\nCrafted with the signature Hoka One One cushioning technology, the Bondi L provides exceptional support and comfort for your feet. This feature is matched with its lightweight and breathable materials, making it ideal for both casual wear and athletic activities.\n\nWhat sets the Hoka One One Engineered Garments x Bondi L 'Black' apart from other shoes is its collaboration with Engineered Garments, a brand known for its avant-garde designs. The Bondi L 'Black' is the perfect fusion of Hoka One One's sporty aesthetic and Engineered Garment's unique touch, making it a must-have for trendsetters and sneaker enthusiasts alike.\n\nThrough its seamless combination of style and function, the Hoka One One Engineered Garments x Bondi L 'Black' is a statement piece that will elevate any wardrobe. Don't settle for ordinary sneakers, choose the extraordinary with Hoka One One Engineered Garments x Bondi L 'Black'.",
    "price": "$338",
    "variants": {
      "black": {
        "image": ""
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "Hoka One One Kaha Low GTX 'Charcoal Grey Green Sheen'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-kaha-low-gtx-charcoal-grey-1118586-cggs",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the Hoka One One Kaha Low GTX, the ultimate trail running shoe for outdoor enthusiasts! Designed to provide maximum comfort and stability on even the toughest terrain, these shoes are perfect for conquering any trail in style. With their sleek charcoal grey and green sheen colorway, you'll make a statement with every stride you take.\n\nEquipped with GORE-TEX technology, you'll be able to power through any environmental challenge without sacrificing breathability or comfort. The durable rubber outsoles provide superior grip and traction, ensuring that your feet remain firmly planted on the ground no matter how steep the incline.\n\nThe Kaha Low GTX features a lightweight construction that won't weigh you down on long hikes, allowing you to go further and faster than ever before. And with their unrivaled cushioning and support, you'll feel like your feet are floating on clouds even during the most grueling runs.\n\nWhether you're an experienced trail runner or just looking for a reliable shoe for your next hike, the Hoka One One Kaha Low GTX is the perfect shoe for you. So what are you waiting for? Make the most of every adventure with the Hoka One One Kaha Low GTX!",
    "price": "$285",
    "variants": {
      "grey": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_4d15f45e-570b-49bc-a226-b9a9b996061f_540x.jpg?v=1662016981"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "Hoka One One Rocket X 'White Diva Blue'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-rocket-x-white-diva-blue-1113532-wdvb",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the Hoka One One Rocket X in the stunning 'White Diva Blue' colorway! Made with quality craftsmanship and premium materials, these shoes are the perfect addition to any runner's arsenal.\n\nThe Rocket X is built for speed, featuring a lightweight design that's ideal for racing and training. Its advanced foam technology provides ample cushioning, while its responsive design ensures a smooth and comfortable ride with every stride. Not only do these shoes perform exceptionally, but they also look great thanks to their sleek, modern design and unique colorway.\n\nWhether you're an experienced runner or just starting out, the Hoka One One Rocket X is a must-have for anyone seeking a fast, comfortable, and stylish shoe that can keep up with even the most demanding workouts. So go ahead and elevate your running game with the Rocket X!",
    "price": "$169",
    "variants": {
      "BLUE/WHITE": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_3d2b7898-3f76-4008-88ad-1cb4c7614444_540x.jpg?v=1662197386"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "HOKA ONE ONE Clifton Edge 'Black White'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-clifton-edge-black-white-1110510-bwht",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the HOKA ONE ONE Clifton Edge sneakers in the classic 'Black White' style! Perfect for runners and fitness enthusiasts alike, these shoes are designed to provide ultimate comfort, support and style.\n\nCrafted with the brand's signature HOKA ONE ONE cushioning, you'll feel like you're walking on clouds with every step. The unique, elongated heel adds an extra level of stability and support, making these sneakers a must-have for anyone who wants to go the extra mile.\n\nThe sleek black and white colorway will effortlessly elevate any workout outfit or street style look, while the durable materials ensure longevity and performance for all kinds of activities.\n\nDon't settle for just any pair of sneakers - upgrade to the HOKA ONE ONE Clifton Edge 'Black White' style and experience the ultimate in comfort, support and style. Shop now and step up your shoe game!",
    "price": "$227",
    "variants": {
      "BLACK/WHITE": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_6aaab8f1-b759-4361-bf36-00a631a31787_540x.jpg?v=1662197622"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "HOKA ONE ONE Speedgoat 4 'Blue Yellow'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-speedgoat-4-biep-1106525-biep",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Looking for speed, agility, and superior traction as you take on the toughest terrain? Look no further than the HOKA ONE ONE Speedgoat 4 in stunning blue and yellow.\n\nCrafted with the latest in running technology, the Speedgoat 4 features a dynamic midsole that offers unbeatable responsiveness and swift takeoffs. Its Vibram Megagrip outsole provides exceptional grip on even the most slippery surfaces, while the lightweight and breathable mesh upper keeps your feet cool and comfortable, even during long-distance runs.\n\nPerfectly engineered to take on rugged mountain trails, the Speedgoat 4 features a roomy toe box that lets your feet splay naturally, reducing the risk of blisters and pressure points. Whether you're a seasoned trail runner or just starting out, these shoes are a must-have for anyone looking to take their running to the next level.\n\nSo why wait? Order your HOKA ONE ONE Speedgoat 4 today and experience the ultimate in trail running performance!",
    "price": "$167",
    "variants": {
      "BLUE/YELLOW": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_20d1d0e4-2d39-4d83-973b-a54ee0239d24_540x.jpg?v=1662197803"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "HOKA ONE ONE Tennine Hike GTX",
    "url": "https://www.kickscrew.com/products/hoka-one-one-tennine-hike-gtx-moroccan-blue-saffron-1113510-mbsf",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the HOKA ONE ONE Tennine Hike GTX 1113510-MBSF, the ultimate hiking shoe for adventurous souls. \n\nCrafted with the highest quality materials and engineering, this shoe boasts a GORE-TEX® waterproof membrane to keep your feet dry during wet weather hikes. The Tennine Hike GTX 1113510-MBSF features an innovative rocker sole that promotes a natural stride and reduces joint impact, resulting in a comfortable hiking experience that lasts all day long. \n\nTake on any terrain with the Vibram® Megagrip outsole that provides exceptional traction and durability on both wet and dry surfaces. The protective midsole also shields your feet from unforeseen obstacles along the trail. \n\nDesigned with an anatomical fit, this shoe supports your natural foot shape and provides ample cushioning to reduce pressure points. The breathable and quick-drying mesh upper ensures your feet stay cool and dry in any weather condition.\n\nThe HOKA ONE ONE Tennine Hike GTX 1113510-MBSF is available in sizes that cater to men and women, making it a versatile shoe for all outdoor enthusiasts. Whether you're hiking through rugged terrain or strolling through city streets, this shoe is a must-have for anyone who values both comfort and style. Order yours today and take on your next adventure with confidence.",
    "price": "$298",
    "variants": {
      "DEFAULT COLOR": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_7e3773f1-feba-459e-8413-93fc037bb19c_540x.jpg?v=1662135328"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "Hoka One One Clifton 7 'White'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-clifton-7-white-1110508-wwh",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the Hoka One One Clifton 7 in elegant white! This shoe is the perfect combination of style and performance, making it the ultimate choice for anyone looking for a shoe that can keep up with their active lifestyle.\n\nFeaturing Hoka's signature cushioning technology, the Clifton 7 delivers superior comfort and responsiveness, allowing you to push yourself even further. Its breathable mesh upper keeps your feet cool and dry, while the reinforced heel provides added support and stability.\n\nThanks to its lightweight design, the Clifton 7 won't weigh you down and allows for effortless movement. It's the perfect shoe for everything from daily walks to intense training sessions.\n\nWhether you're a seasoned runner or just starting out, the Hoka One One Clifton 7 'White' 1110508-WWH is the ultimate shoe for you. So why wait? Add it to your cart today and take your performance to the next level!",
    "price": "$188",
    "variants": {
      "WHITE": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_f60b13fc-0028-49c1-9430-19bf324c0ee8_540x.jpg?v=1662016276"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "HOKA ONE ONE Kaha GTX",
    "url": "https://www.kickscrew.com/products/hoka-one-one-kaha-gtx-charcoal-grey-1112030-cggs",
    "category": "Hiking Shoes",
    "description": "Introducing the HOKA ONE ONE Kaha GTX, the ultimate trail shoe designed to take on all challenges with ease. Made with the most advanced technology, the Kaha GTX combines innovation, comfort, and durability to create a shoe that can withstand any terrain. \n\nCrafted with a waterproof GORE-TEX membrane, the Kaha GTX is the perfect choice for wet or muddy conditions. With its impressive cushioning, you can go the extra mile without worrying about your feet getting tired. The outsole made of Vibram® Megagrip rubber provides exceptional traction while the multi-directional lugs help grip rocky and uneven surfaces.\n\nEmbrace adventure with the Kaha GTX, which features a padded ankle collar, preventing any blisters and slips while providing a comfortable fit. The Meta-Rocker technology creates a smooth ride, transition, and forward momentum with each stride. \n\nSo why wait? The HOKA ONE ONE Kaha GTX is the perfect choice for those who want to take on tough trails with confidence. Get more out of your hiking experience with the Kaha GTX and take your adventure beyond your wildest dreams!",
    "price": "$232",
    "variants": {
      "DEFAULT COLOR": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_b465d81c-7ab0-4a70-9351-89169d2efaa0_540x.jpg?v=1662103104"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "HOKA ONE ONE Tor Ultra Low x Engineered Garments 'Black Red'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-tor-ultra-low-x-engineered-garments-engineered-garments-black-red-1102502-brnr",
    "category": "Hiking Shoes",
    "description": "Introducing the HOKA ONE ONE Tor Ultra Low x Engineered Garments 'Black Red' 1102502-BRNR, the ultimate in comfort and style. Designed for the modern adventurer who wants to look good while conquering new heights, these sneakers are the perfect addition to your wardrobe. \n\nCrafted with a blend of leather and textile materials, these shoes provide durability and ultimate breathability, keeping your feet comfortable and fresh all day long. The sleek black and red colorway adds a touch of style, making them a versatile option for any outfit. \n\nThe Tor Ultra Low x Engineered Garments feature HOKA's signature EVA midsole, which provides cushioned support and shock absorption for a smooth ride, while the Meta-Rocker geometry promotes a natural gait for improved stability. The Vibram Megagrip outsole offers superior traction, allowing you to tackle any terrain with ease.\n\nWhether you're hitting the trails or exploring the city, these shoes are designed to keep up with all your adventures. So why settle for ordinary sneakers when you can elevate your style and performance with the HOKA ONE ONE Tor Ultra Low x Engineered Garments 'Black Red' 1102502-BRNR? Shop now and experience the ultimate in comfort, support, and style!",
    "price": "$493",
    "variants": {
      "BLACK/RED": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_cabee983-2e83-4f0d-8356-3652d4e59faa_540x.jpg?v=1661998202"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "HOKA ONE ONE Rocket X 'Blue Yellow Orange'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-rocket-x-scuba-blue-1113532-sblgr",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the HOKA ONE ONE Rocket X 'Blue Yellow Orange' 1113532-SBLGR - the ultimate performance shoes for serious runners. Designed with cutting-edge technology and top-of-the-line features, these shoes will take your running experience to the next level.\n\nConstructed with HOKA ONE ONE's signature lightweight cushioning, you'll feel like you're running on clouds even on the toughest terrains. The Rocket X also features a breathable mesh upper that ensures your feet stay cool and comfortable, allowing you to push your limits without any distractions.\n\nBut that's not all - the 'Blue Yellow Orange' colorway is sure to make a statement no matter where you go. Whether hitting the trails or pounding the pavement, these shoes are the perfect combination of style and substance.\n\nDon't settle for average running shoes, upgrade to the HOKA ONE ONE Rocket X 'Blue Yellow Orange' 1113532-SBLGR and experience the ultimate in performance and style. Order now and take your training to new heights!",
    "price": "$208",
    "variants": {
      "BLUE/YELLOW/ORANGE": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_9ada8426-ac0b-4b10-9d09-591d33370b95_540x.jpg?v=1662056440"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "Hoka One One Rocket X 'Fiesta'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-rocket-x-fiesta-1113532-ftbc",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Looking for a shoe that can keep up with your active lifestyle? Look no further than the Hoka One One Rocket X 'Fiesta'! Crafted with expert attention to detail and top-of-the-line materials, this shoe is designed to take your workouts to the next level.\n\nThe Rocket X 'Fiesta' model features a sleek and stylish design, with vibrant color accents that are sure to turn heads. But it's not just about looks! The Rocket X is built for speed, with a lightweight feel and responsive cushioning that will give you the edge you need to take on any challenge.\n\nThanks to the shoe's advanced construction, you'll experience an unparalleled level of support and stability while you run, jump, and play. And with sizes available for both men and women, everyone can take advantage of the Hoka One One Rocket X 'Fiesta'!\n\nSo why wait? Order your pair today and start taking your active lifestyle to the next level!",
    "price": "$188",
    "variants": {
      "RED/WHITE": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_4e17263c-8c44-4f34-99c2-a02e08736c20_540x.jpg?v=1662197622"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "Hoka One One Bondi SR 'Triple Black'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-bondi-sr-black-1110520-bblc",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Looking for a shoe that merges style and functionality? Look no further than the Hoka One One Bondi SR 'Triple Black' 1110520-BBLC! With its sleek black design, these shoes are sure to compliment any outfit, while their advanced features are designed with comfort and performance in mind.\n\nMade from high-quality materials, these shoes boast a revolutionary Hoka One One technology that provides ultimate cushioning and support, making them perfect for long distance runners and athletes alike. The Bondi SR 'Triple Black' also features a slip-resistant outsole, providing maximum grip on any surface, while the durable construction of the upper ensures longevity and comfort.\n\nThese shoes come in a range of men's and women's sizes and feature a lace-up design for a secure and custom fit. So whether you're hitting the track, walking the dog or just want to enjoy a comfortable day on your feet, the Hoka One One Bondi SR 'Triple Black' 1110520-BBLC is the perfect choice for you. Invest in your comfort and performance today and take your game to the next level!",
    "price": "$285",
    "variants": {
      "BLACK": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_fbf666c3-0493-4821-8bf6-6746970ea42d_540x.png?v=1662119846"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "Hoka One One Clifton Edge 'Team Kit - Vintage Indigo'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-clifton-edge-vintage-indigo-1110510-vitf",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the ultimate combination of style and performance - the Hoka One One Clifton Edge 'Team Kit - Vintage Indigo'!\n\nOur top-of-the-line running shoes feature a sleek design with vintage indigo accents, making them the perfect choice for athletes who want to look their best while pushing their limits.\n\nCrafted with cutting-edge technology, these shoes provide unparalleled support and cushioning for a comfortable running experience. The unique foam construction and rocker sole ensure smooth transitions and maximum energy return, so you can stay focused on your goals and achieve new personal bests.\n\nWith its breathable mesh upper and padded tongue and collar, the Hoka One One Clifton Edge 'Team Kit - Vintage Indigo' is engineered to keep your feet cool and comfortable, no matter how hard you train.\n\nDesigned for athletes of all levels, these shoes are available in a range of sizes and come in several languages, including English, French, German, Italian, Spanish, and Greek.\n\nSo if you're looking for a stylish and high-performing pair of running shoes, the Hoka One One Clifton Edge 'Team Kit - Vintage Indigo' is the answer you've been searching for! Don't wait any longer and order your pair today!",
    "price": "$240",
    "variants": {
      "blue": {
        "image": ""
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "Hoka One One Clifton L 'Tofu'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-clifton-l-white-1117050-ttf",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Are you looking for the ultimate running shoe that combines style, comfort and performance? Look no further than the Hoka One One Clifton L 'Tofu' 1117050-TTF. \n\nThis shoe is designed to provide a smooth, comfortable ride with its EVA midsole and Meta-Rocker technology that promotes a natural gait. The lightweight design also ensures that you can run for miles without feeling weighed down. \n\nBut this shoe isn't just about function - the 'Tofu' colorway will have heads turning as you zoom past. The neutral tones of the upper blend perfectly with the pops of teal and orange on the sole and laces, making this shoe a stylish addition to any running outfit. \n\nAnd with the ability to shop in six different languages, including English, French, German, Italian, Spanish and Greek, it's easier than ever to get your hands on this amazing shoe no matter where in the world you are. Don't settle for less - elevate your running game with the Hoka One One Clifton L 'Tofu' 1117050-TTF.",
    "price": "$279",
    "variants": {
      "WHITE": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_dd989850-fd96-4baf-8eb0-7b592e97105f_540x.jpg?v=1662113317"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "Hoka One One Bondi L 'Oxford Tan'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-bondi-l-tan-1110538-dotn",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the game-changing Hoka One One Bondi L 'Oxford Tan' 1110538-DOTN! This shoe is the epitome of style, comfort, and durability. With its sleek colorway of oxford tan, this shoe is sure to turn heads and make a statement wherever you go.\n\nBut this shoe isn't just all about looks. The Hoka One One Bondi L is loaded with features designed to keep you comfortable throughout the day. The shoe features a full EVA midsole and meta-rocker technology, providing you with a smooth and comfortable ride. Plus, the shoe is made with a breathable mesh upper, ensuring your feet stay cool and dry even during the hottest days.\n\nThe Hoka One One Bondi L 'Oxford Tan' 1110538-DOTN is perfect for anyone seeking a blend of style and comfort. Whether you're tackling your daily commute, going for a run, or just running errands around town, this shoe is guaranteed to deliver the performance and style you deserve.\n\nSo why wait? Add the Hoka One One Bondi L 'Oxford Tan' 1110538-DOTN to your shoe collection today and discover a whole new level of comfort and style!",
    "price": "$208",
    "variants": {
      "tan": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_8f3fcc15-d424-492b-a20a-5bf5f0cea838_540x.jpg?v=1662052352"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "HOKA ONE ONE x OC Bondi",
    "url": "https://www.kickscrew.com/products/hoka-one-one-hoka-one-one-x-oc-bondi-opening-ceremony-white-1111597-ncwt",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Looking for the perfect balance between style and comfort? Look no further than the HOKA ONE ONE x OC Bondi!\n\nCreated in collaboration with Opening Ceremony, the HOKA ONE ONE x OC Bondi combines the best of both worlds - the iconic style of Opening Ceremony and the legendary comfort of HOKA ONE ONE.\n\nCrafted with cutting-edge technology, these shoes are designed to deliver maximum comfort with every step. The trademark HOKA ONE ONE sole provides superior cushioning and shock absorption, while the sleek white design is finished with bold Opening Ceremony branding.\n\nWhether you're hitting the gym or pounding the pavement, the HOKA ONE ONE x OC Bondi is the perfect shoe for those who demand both style and substance in their footwear. Don't settle for just one - experience the best of both worlds with the HOKA ONE ONE x OC Bondi!",
    "price": "$1,653",
    "variants": {
      "White": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_22320c48-75e1-4ba7-9c5e-c48db75929c9_540x.jpg?v=1666217562"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "HOKA ONE ONE Challenger Low GTX",
    "url": "https://www.kickscrew.com/products/hoka-one-one-challenger-low-gtx-beige-1106519-otdn",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the HOKA ONE ONE Challenger Low GTX 1106519-OTDN - a revolutionary shoe that combines unparalleled technology with sleek design for the ultimate performance experience. This shoe is perfect for those who demand the best out of their footwear and is guaranteed to elevate your workout to the next level.\n\nCrafted from top-quality materials, the Challenger Low GTX boasts advanced technology such as Gore-Tex waterproofing, ensuring your feet stay dry and comfortable, no matter the weather. The shoe's lightweight construction allows for maximum agility and responsiveness whilst the premium cushioning system offers unparalleled shock absorption, keeping your feet protected and comfortable during high-impact exercise.\n\nWhether you're a seasoned athlete or just starting to get into fitness, the HOKA ONE ONE Challenger Low GTX 1106519-OTDN guarantees outstanding performance and exceptional style. The shoe's intricate design features a sleek color scheme and streamlined silhouette, making it the perfect addition to any workout outfit.\n\nSo why wait? Elevate your training routine with the HOKA ONE ONE Challenger Low GTX 1106519-OTDN - the ultimate combination of style and performance. Order now and experience unparalleled comfort and support like never before.",
    "price": "$211",
    "variants": {
      "CREAMWHITE": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_cf2a7115-11ab-42f1-a35b-f4eb1844bf95_540x.jpg?v=1662051872"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "Hoka One One Bondi 7 'Wild Dove'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-bondi-7-wild-dove-dark-shadow-1110518-wdds",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Looking for the perfect combination of comfort and style in your next running shoe? Look no further than the Hoka One One Bondi 7 'Wild Dove'! This highly anticipated release is the latest addition to Hoka's popular Bondi line, and it's easy to see why.\n\nFeaturing a sleek and stylish Wild Dove color scheme, the Bondi 7 is the perfect shoe to take your running game to the next level. But don't be fooled by its elegant appearance; this shoe is packed with innovative features designed to keep you comfortable and supported, no matter how long or challenging your run might be.\n\nWith a full EVA midsole and Meta-Rocker technology, the Bondi 7 provides exceptional cushioning and shock absorption, minimizing the impact on your joints and allowing you to maximize your performance. And with a redesigned mesh upper that promotes breathability and maximizes airflow, your feet will stay cool and dry even on the hottest days.\n\nBut the Bondi 7 isn't just about performance; it's also a stylish and versatile shoe that can be worn in any situation. Whether you're hitting the trails, pounding the pavements, or simply running errands around town, the Wild Dove color scheme is sure to turn heads and make a statement.\n\nSo if you're looking for a shoe that combines style, comfort, and performance, look no further than the Hoka One One Bondi 7 'Wild Dove'. Order yours today and experience the difference for yourself!",
    "price": "$165",
    "variants": {
      "GRAY": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_6b072d43-82e1-43ce-8c18-e208043f5031_540x.jpg?v=1662016281"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "HOKA ONE ONE Speedgoat Mid GTX 2",
    "url": "https://www.kickscrew.com/products/hoka-one-one-speedgoat-mid-gtx-2-anthracite-1106532-adgg",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Behold the HOKA ONE ONE Speedgoat Mid GTX 2 – the ultimate trail runner’s dream come true! Expertly crafted for those with a love of adventure and the great outdoors, this shoe delivers unbeatable performance and protection in every step.\n\nThe Speedgoat Mid GTX 2 is designed to be your go-to trail running shoe, offering maximum cushioning and stability for even the most challenging terrain. Featuring a waterproof and breathable Gore-Tex® membrane, this shoe is ready to take on even the wettest of trails, while the EVA midsole provides plenty of support underfoot.\n\nWith a durable Vibram® MegaGrip outsole, the Speedgoat Mid GTX 2 delivers unbeatable traction on any surface, guaranteeing you a secure footing on every twist and turn. And with an innovative midfoot cage construction, your feet will stay securely in place, no matter how rough the terrain gets.\n\nSo, whether you’re hitting the trails for a weekend adventure or just exploring your local park, the HOKA ONE ONE Speedgoat Mid GTX 2 is the perfect shoe to take you there. Don't miss out on the opportunity to experience the ultimate in trail running comfort and performance. Order now and experience the difference for yourself!",
    "price": "$208",
    "variants": {
      "BLACK": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_6eebaaae-5eec-42b0-a342-9553f0d37bce_540x.jpg?v=1661997441"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "Hoka One One Bondi 7 'Odyssey Grey Deep Well'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-bondi-7-odyssey-grey-1110518-ogdw",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the Hoka One One Bondi 7 in 'Odyssey Grey Deep Well' - the ultimate combination of style and comfort. Whether you're looking for a shoe to take you on long runs or to support you throughout your day, these shoes have got you covered.\n\nFeaturing Hoka's signature oversized midsole and Meta-Rocker technology, the Bondi 7 provides a smooth and effortless ride. The plush memory foam collar cradles your ankle in comfort, while the engineered mesh upper provides breathability and a snug fit. \n\nWith a stylish 'Odyssey Grey Deep Well' colorway, these shoes are sure to turn heads on your next run or errand. Plus, with sizes ranging from Men's US 7 to 15, there's a perfect fit for every foot.\n\nUpgrade your running and everyday wardrobe with the Hoka One One Bondi 7 in 'Odyssey Grey Deep Well'. Don't settle for anything less than the best - order your pair today and experience the ultimate combination of style and comfort.",
    "price": "$215",
    "variants": {
      "BLACK/YELLOW": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_165805b1-2038-49ef-b8c6-1aba745b6658_540x.jpg?v=1662103103"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "HOKA ONE ONE Bondi 7 'Blue Green'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-bondi-7-moonlit-ocean-1110518-bmmo",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the HOKA ONE ONE Bondi 7 in the striking 'Blue Green' colorway - available now for all avid runners and casual joggers alike!\n\nCrafted with the latest technology, the Bondi 7 promises a smooth and comfortable ride every time you hit the pavement. Its signature plush cushioning ensures maximum shock absorption, reducing the strain on your feet, ankles and knees.\n\nDesigned for both durability and style, the Blue Green shade is perfect for those who want to stand out from the crowd. Pair with leggings or shorts for a sharp and sleek look that's perfect for the gym, the streets, and everywhere else in between.\n\nBut don't just take our word for it. The HOKA ONE ONE Bondi 7 'Blue Green' has already been receiving high praise from runners all over the world. With its superior blend of form and function, it's no surprise that the Bondi 7 is quickly becoming one of the most sought-after running shoes on the market.\n\nSo why wait? Grab your own pair of HOKA ONE ONE Bondi 7 'Blue Green' 1110518-BMMO today and experience the ultimate in comfort and style!",
    "price": "$208",
    "variants": {
      "BLUE/GREEN": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_3777bba5-9357-4e48-bd1a-25919a397f2b_540x.jpg?v=1662113448"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "Hoka One One Kaha GTX 'Black Phantom'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-kaha-gtx-black-1112030-bphn",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the Hoka One One Kaha GTX 'Black Phantom' - a shoe that's sure to take your outdoor adventures to the next level! These shoes are perfect for those who want style, comfort, and durability all in one. \n\nCrafted with a Gore-Tex membrane, these shoes provide exceptional waterproofing and a high level of breathability, keeping your feet dry and comfortable, no matter the weather conditions. The Kaha GTX also features a Vibram Megagrip outsole that provides unparalleled traction on any terrain and ensures your feet stay firmly planted on the ground, preventing any slips or falls.\n\nThese shoes also feature Hoka One One's signature cushioned midsole, which provides maximum comfort, support, and shock absorption, reducing the impact on your joints during long hikes or runs. Moreover, the shoe's lightweight design ensures quick and agile performance that promises to keep you going all day.\n\nWith its sleek black phantom design, the Kaha GTX is sure to catch the eye of anyone around. Available in a range of sizes, these shoes are perfect for men and women who seek to explore the great outdoors in style, without compromising on performance or comfort.\n\nOverall, the Hoka One One Kaha GTX 'Black Phantom' is a must-have for anyone who wants a reliable, high-performance shoe for all types of outdoor activities, from trailing and hiking to running and camping. Get yours today and embark on your next adventure in style!",
    "price": "$233",
    "variants": {
      "BLACK": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_6871870e-8e4a-4c44-8c54-4b9a1824fdd7_540x.jpg?v=1662197391"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "Hoka One One Kaha GTX 'Dune Oxford Tan'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-kaha-gtx-simply-taupe-1112030-dotn",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the Hoka One One Kaha GTX 'Dune Oxford Tan' 1112030-DOTN - a stunning combination of style and functionality!\n\nCrafted with the finest materials and state-of-the-art technology, these shoes are perfect for anyone who loves the great outdoors. Whether you're hitting the trails or taking a walk in the park, the Kaha GTX 'Dune Oxford Tan' has got you covered.\n\nFeaturing an impressive GORE-TEX membrane, these shoes are waterproof, windproof and breathable - ensuring your feet stay dry and comfortable no matter what the weather throws your way. The ultra-comfortable EVA midsole provides a responsive and cushioned ride that reduces impact and elevates your stride.\n\nThe eye-catching 'Dune Oxford Tan' colorway and sleek design make these shoes a must-have for any fashion-forward adventurer. And with six languages - including English, French, German, Italian, Spanish, and Greek - available in the shoe's label, the Kaha GTX 'Dune Oxford Tan' can take you anywhere around the globe in style and comfort.\n\nInvest in the best and choose the Hoka One One Kaha GTX 'Dune Oxford Tan' 1112030-DOTN - the perfect blend of form and function for your next outdoor adventure!",
    "price": "$252",
    "variants": {
      "tan": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_ec76957c-77ff-4322-968d-ccc6ff01b991_540x.jpg?v=1661997223"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "HOKA ONE ONE Clifton M x OC",
    "url": "https://www.kickscrew.com/products/hoka-one-one-clifton-m-x-oc-almond-milk-1111595-amdn",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the HOKA ONE ONE Clifton M x OC, a shoe that is designed to offer you comfort and performance like never before. This shoe is the perfect blend of fashion and function, making it an ideal choice for athletes, runners, and anyone who wants to look and feel their best.\n\nWith its sleek design and a range of bold and vibrant colors, this shoe is sure to turn heads. The HOKA ONE ONE Clifton M x OC features a breathable upper made of engineered mesh that delivers optimum breathability and support. The shoe also boasts a full-length EVA midsole that offers superior cushioning, support, and shock absorption.\n\nThe HOKA ONE ONE Clifton M x OC is designed to keep you moving. It features a Meta-Rocker that offers a smooth transition from heel to toe, enabling you to move effortlessly and comfortably. Whether you're going for a morning run or hitting the gym, you can rely on this shoe to provide you with the stability and support you need.\n\nSo, why wait? Invest in the HOKA ONE ONE Clifton M x OC today and experience the ultimate combination of style, comfort, and performance. Order yours now and step up your game in style.",
    "price": "$248",
    "variants": {
      "DEFAULT COLOR": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_cd4af162-5a71-498e-b69b-16910c493299_540x.jpg?v=1662148466"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "HOKA ONE ONE Hopara",
    "url": "https://www.kickscrew.com/products/hoka-one-one-hopara-blue-1106534-obpb",
    "category": "Sandals",
    "description": "Are you ready to take your running game to the next level? Look no further than the HOKA ONE ONE Hopara 1106534-OBPB. These shoes are the perfect combination of comfort, style, and performance, designed with the avid trail runner in mind.\n\nCrafted with the latest technology in mind, these Hopara shoes feature engineered mesh for breathability, and a rubberized foam sole to provide both traction and durability. The Meta-Rocker technology is designed to promote natural running form, while the PROFLY midsole ensures maximum cushioning for every step, no matter the terrain.\n\nThe bold and sleek design of these shoes make them perfect for both seasoned and new trail runners alike. Plus, with sizes available in English, French, German, Italian, Spanish, and Greek, you're guaranteed the perfect fit, every time.\n\nWhat are you waiting for? Invest in the HOKA ONE ONE Hopara 1106534-OBPB today, and experience a new level of running excellence.",
    "price": "$223",
    "variants": {
      "BLUE": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_0c294f8f-73cb-4d79-bd39-76a23116496b_540x.jpg?v=1662197686"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "HOKA ONE ONE Bondi 6",
    "url": "https://www.kickscrew.com/products/hoka-one-one-bondi-6-black-1019271-bblc",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the HOKA ONE ONE Bondi 6 - the shoe that will take your running game to the next level! Designed with the ultimate cushioning technology, this shoe will give you a smooth, comfortable ride, making it the perfect choice for both casual and competitive runners.\n\nThe Bondi 6 features a breathable mesh upper and a plush, full-length EVA midsole that provides exceptional cushioning and support. The Meta-Rocker technology helps to guide your foot through each stride, giving you a more natural gait and reducing the risk of injury.\n\nWhether you're running on pavement or hitting the trails, the Bondi 6 has got you covered. The durable rubber outsole offers excellent traction on any surface, so you can feel confident in your footing no matter where you go. Plus, with its stylish design and variety of color options, this shoe looks just as good as it feels.\n\nDon't wait any longer to upgrade your running shoes - try the HOKA ONE ONE Bondi 6 today and experience the ultimate in comfort and performance!",
    "price": "$328",
    "variants": {
      "BLACK": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_6689ac2a-b9d3-45d2-aa11-f907c86452f7_540x.jpg?v=1662112648"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "Hoka One One Opening Ceremony x BM Clifton 'Black'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-clifton-bm-x-oc-black-1111594-bblc",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Looking for the ultimate blend of style and performance? Look no further than the Hoka One One Opening Ceremony x BM Clifton 'Black' 1111594-BBLC.\n\nDesigned in collaboration with fashion powerhouse Opening Ceremony and legendary running brand Hoka One One, this shoe is the perfect combination of cutting-edge design and top-of-the-line technology.\n\nFeaturing a sleek black colorway, breathable mesh upper, and signature Hoka One One cushioning, this shoe is sure to turn heads whether you're hitting the pavement or just out for a casual stroll.\n\nAnd with six different language options available, you can be sure that no matter where in the world you are, you'll be able to enjoy all the style and performance that this shoe has to offer.\n\nSo why wait? Order your Hoka One One Opening Ceremony x BM Clifton 'Black' 1111594-BBLC today and step up your style game like never before.",
    "price": "$160",
    "variants": {
      "BLACK": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_5c4d25c5-1120-4f91-abfe-2630052b7439_540x.jpg?v=1662197629"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "HOKA ONE ONE Tor Ultra Hi x Opening Ceremony",
    "url": "https://www.kickscrew.com/products/hoka-one-one-tor-ultra-hi-x-opening-ceremony-beige-1114610",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Looking for a high-performance trail shoe that merges style and functionality? Look no further than the HOKA ONE ONE Tor Ultra Hi x Opening Ceremony 1114610!\n\nCrafted with precision and care, this exceptional shoe is made for runners and hikers who demand the best in support, comfort, and style. With a sleek and bold design that's sure to turn heads, the Tor Ultra Hi x Opening Ceremony 1114610 boasts a high-top silhouette and vibrant colors that evoke a sense of adventure and excitement.\n\nBut this shoe isn't just a pretty face - it's  also built to handle even the toughest terrain. The Tor Ultra Hi x Opening Ceremony 1114610 features HOKA ONE ONE's renowned cushioning technology, which offers unparalleled stability and support on rough terrain. It also has a sturdy Vibram outsole that provides optimal traction and durability, even on challenging trails.\n\nWhether you're running, hiking, or simply walking around town, the Tor Ultra Hi x Opening Ceremony 1114610 is a shoe that won't let you down. So why settle for anything less? Invest in the best today, and experience the ultimate in style and performance!",
    "price": "$589",
    "variants": {
      "DEFAULT COLOR": {
        "image": ""
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "Hoka One One Tor Ultra Low WP JP 'Beige'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-tor-ultra-low-wp-jp-simply-taupe-1105689-sita",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Looking for a hiking shoe that can keep up with your adventurous spirit? Look no further than the HOKA ONE ONE Tor Ultra Low WP JP 'Beige'! This shoe is designed to provide maximum comfort and support in all kinds of terrain, no matter where your feet take you. \n\nCrafted with HOKA ONE ONE's innovative technology, this premium hiking shoe boasts exceptional stability and traction that will keep you steady and secure with every step you take. The SITA colorway adds a touch of style to your outdoor wardrobe, making it perfect for both functional and fashion-forward hikers. \n\nWhether you're trekking through wet or dry conditions, the waterproof upper of the Tor Ultra Low WP JP 'Beige' will keep your feet dry and comfortable. And with an EVA midsole that provides superior cushioning, you can tackle even the most challenging of hikes with ease. \n\nSo if you're looking for a hiking shoe that combines style, comfort, and functionality perfectly, the HOKA ONE ONE Tor Ultra Low WP JP 'Beige' is the shoe for you. Grab a pair today, and get ready to embark on your next adventure in style!",
    "price": "$541",
    "variants": {
      "Beige": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_564dd514-d349-4599-bd0c-51721a6cace4_540x.jpg?v=1678675726"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "Hoka One One Engineered Garments x Tor Ultra Low 'Simply Taupe'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-tor-ultra-low-x-engineered-garments-simply-taupe-1102502-sita-1",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Looking for the ultimate blend of style and performance in your next hiking shoe? Look no further than the Hoka One One Engineered Garments x Tor Ultra Low 'Simply Taupe' 1102502-SITA.\n\nThis stunning shoe features the perfect combination of sleek, minimalist design and rugged durability, making it the ideal choice for any adventure. The unique collaboration between Hoka One One and Engineered Garments has resulted in a shoe that blends fashion-forward style with cutting-edge technology and functionality.\n\nCrafted from top-quality materials, this shoe is built to last through even the toughest terrain. The high-traction outsole provides superior grip and stability, while the innovative cushioned midsole ensures maximum comfort and support for long days on the trail.\n\nThe 'Simply Taupe' colorway is a gorgeous neutral tone that pairs easily with any outfit, from casual outdoors wear to more dressed-up ensembles. With its versatile design and unbeatable performance, the Hoka One One Engineered Garments x Tor Ultra Low is the perfect choice for anyone who demands the best from their footwear. Order now and experience the ultimate combination of style and functionality!",
    "price": "$975",
    "variants": {
      "brown": {
        "image": ""
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "Hoka One One Tor Ultra High 2 Waterproof 'Simply Taupe'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-ultra-hi-2-khaki-1107293-sita",
    "category": "Hiking Shoes",
    "description": "Step up your outdoor game with the Hoka One One Tor Ultra High 2 Waterproof 'Simply Taupe' 1107293-SITA. This hiking boot is designed for the most rugged terrain and unforgiving weather conditions. \n\nCrafted with a waterproof eVent membrane, these boots will keep your feet dry and comfortable no matter how wet the trails get. The Vibram MegaGrip outsole provides unparalleled traction on any surface, from loose rocks to slick mud.\n\nThe Tor Ultra High 2's midsole is crafted with Hoka's signature cushioning technology, delivering a smooth and comfortable ride that will keep you going for miles. The high-cut ankle design adds extra stability and support, making these boots perfect for steep ascents and descents.\n\nWith its sleek 'Simply Taupe' colorway, these boots will not only perform, but also look great while doing it. Don't let rough terrain and harsh weather stop you from exploring the great outdoors. Upgrade your footwear game with the Hoka One One Tor Ultra High 2 Waterproof 'Simply Taupe' 1107293-SITA.",
    "price": "$439",
    "variants": {
      "KHAKI": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_c2e64966-2920-4de3-a41a-2dc32ed970bb_540x.jpg?v=1662199597"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "Hoka One One Tor Ultra High 2 Waterproof 'Black'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-ultra-hi-2-black-1107293-blk",
    "category": "Hiking Shoes",
    "description": "Introducing the Hoka One One Tor Ultra High 2 Waterproof in 'Black' - an all-terrain shoe that combines comfort, durability, and style like never before. Designed to take on the toughest trails, the Tor Ultra High 2 features a waterproof membrane that will keep your feet dry in any weather condition. \n\nNot only is this shoe perfect for trekking through muddy paths and rocky terrains, but it also offers superior support and stability, thanks to the high-cut collar and cushioned midsole. The Vibram MegaGrip outsole provides unparalleled traction, enhancing your grip on any surface. \n\nCrafted with the highest-quality materials, this shoe boasts a sleek black design with subtle Hoka One One branding, making it suitable for any occasion. Plus, with sizes ranging from 6 to 15, you are sure to find the perfect fit. \n\nWhether you're adventuring in the great outdoors or simply looking for a comfortable, all-day shoe, the Hoka One One Tor Ultra High 2 Waterproof in 'Black' is the perfect choice. Don't settle for anything less than the best – elevate your footwear game with the Tor Ultra High 2.",
    "price": "$598",
    "variants": {
      "BLACK": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_d0f41054-7f63-4daf-818b-896ad3935036_540x.jpg?v=1662199600"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "Hoka One One Speedgoat 4 'Gold Fusion Black Iris'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-speedgoat-4-gold-fusion-1106525-gfbi",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Looking for a trail running shoe that offers the perfect combination of comfort, traction, and style? Look no further than the Hoka One One Speedgoat 4 'Gold Fusion Black Iris’ (1106525-GFBI). \n\nCrafted with the highest quality materials, the Speedgoat 4 is the perfect shoe for trail runners who demand the best in performance and aesthetics. The shoe’s Gold Fusion Black and Iris colorway is sure to turn heads on the trail, making you stand out from the pack.\n\nBut the Speedgoat 4 is much more than just a pretty face. It is built to handle even the toughest terrain with ease, thanks to its Vibram® Megagrip outsole that provides exceptional grip on dry and wet surfaces alike. The shoe’s lightweight construction and ample cushioning ensure that you’ll enjoy maximum comfort no matter how long you’re out on the trail.\n\nWith its combination of unparalleled performance and striking design, the Hoka One One Speedgoat 4 'Gold Fusion Black Iris’ (1106525-GFBI) is the ultimate shoe for trail runners who demand the best of both worlds. So why wait? Get yours today and experience the magic for yourself!",
    "price": "$208",
    "variants": {
      "ORANGE": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_54a375c4-9b5c-46a9-8e22-2052dfc64000_540x.jpg?v=1662148471"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "Hoka One One Speedgoat 4 'Dark Gull Grey Anthracite'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-speedgoat-4-dark-gull-grey-1106525-dgga",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Looking for a shoe that will take you to the peak of your performance? Look no further than the Hoka One One Speedgoat 4 in Dark Gull Grey Anthracite.\n\nWith its sleek design and state-of-the-art features, the Speedgoat 4 is sure to be your go-to choice for your next trail run. Its durable, lightweight construction make it the perfect shoe for traversing even the most rugged terrain. The trademark Hoka One One cushioning provides unparalleled support and comfort, while the breathable mesh upper ensures maximum breathability.\n\nWhether you're a seasoned trail runner or just starting out, the Speedgoat 4 is the shoe for you. So why wait? Order your pair today and start conquering the trails like a pro!",
    "price": "$231",
    "variants": {
      "BLACK": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_c372ed44-1f0e-4ee4-892b-30029809e1c6_540x.jpg?v=1661997123"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "Hoka One One Speedgoat 4 'Fiesta Provincial Blue'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-speedgoat-4-fiesta-provincal-blue-1106525-fpbl",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the Hoka One One Speedgoat 4 'Fiesta Provincial Blue' - the ultimate trail running shoe for athletes who demand nothing but premium quality and top-notch performance! Designed to offer unparalleled protection and support, this shoe is a must-have for runners who want to conquer even the toughest terrains with ease.\n\nFeaturing a vibrant and eye-catching Fiesta Provincial Blue hue, this shoe is sure to turn heads on the trails. But this shoe is more than just a pretty face - it boasts an impressive array of features that make it stand out from the competition. From the durable and breathable mesh upper to the Vibram Megagrip sole that offers superior traction and grip, the Hoka One One Speedgoat 4 is designed to keep you comfortable and confident every step of the way.\n\nAnd that's not all - the shoe also features an EVA midsole that offers unmatched cushioning and support, along with a wider toe box that allows your toes to spread naturally for a more comfortable and stable ride. With a weight of just 10.7 ounces, this shoe is lightweight enough to help you fly up hills and navigate tricky terrain without weighing you down.\n\nSo whether you're a serious trail runner or just looking for a stylish and versatile shoe for everyday wear, the Hoka One One Speedgoat 4 'Fiesta Provincial Blue' is the perfect choice. Shop now and experience the ultimate in comfort, performance, and style!",
    "price": "$254",
    "variants": {
      "blue": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_8ae1707b-652a-435b-9f63-98f8b0ab755a_540x.jpg?v=1662187885"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "Hoka One One Tor Ultra High 2 Waterproof 'Burnt Olive'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-ultra-hi-2-waterproof-burnt-olive-1107293-btol",
    "category": "Hiking Shoes",
    "description": "Introducing the Hoka One One Tor Ultra High 2 Waterproof in the striking and stylish 'Burnt Olive' colorway. These shoes are a must-have for any hiker or outdoor enthusiast looking for comfort, performance and style.\n\nMade with premium waterproof leather and a reinforced upper, the Tor Ultra High 2 can take on any terrain, keeping your feet protected and dry. The EVA midsole and Meta-Rocker technology provide a smooth and stable ride, ensuring a comfortable and secure fit on any adventure. \n\nWhether you're hiking in the mountains, trekking through the forest or just running errands in the city, these shoes are designed to meet your needs. So why settle for ordinary footwear when you can have the best? Get your hands on the Hoka One One Tor Ultra High 2 Waterproof in 'Burnt Olive' today and experience the ultimate in comfort and style.",
    "price": "$389",
    "variants": {
      "ARMY GREEN": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_a0d9ae3e-d032-4526-958c-8d36cf8d6d7a_540x.jpg?v=1662199603"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "Hoka One One Bondi 6 'Black'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-bondi6-black-1019269-bblc",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Looking for a shoe to take your running game to the next level? Look no further than the Hoka One One Bondi 6 in sleek black.\n\nWith innovative features like a full EVA midsole, early stage Meta-Rocker for a smooth ride, and a breathable mesh upper, these shoes are designed with the serious runner in mind. The Bondi 6's cushioned sole and lightweight construction make it the perfect choice for both high-mileage training and race day.\n\nWhether you're racing to beat your personal best or simply looking for a comfortable and supportive shoe for your daily runs, the Hoka One One Bondi 6 in black is the perfect combination of performance and style. And with its durable construction and expert craftsmanship, this shoe is sure to become a staple of your running wardrobe.\n\nSo why wait? Add the Hoka One One Bondi 6 to your cart today and experience the difference that a truly superior running shoe can make.",
    "price": "$323",
    "variants": {
      "BLACK": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_905fbb2b-baec-46ee-b233-2201e65cd23e_540x.jpg?v=1662055953"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "HOKA ONE ONE Evo Mafate 2",
    "url": "https://www.kickscrew.com/products/hoka-one-one-evo-mafate-2-blue-yellow-1105591-cctrs",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the HOKA ONE ONE Evo Mafate 2 1105591-CCTRS, the perfect shoe for trail runners and adventurers alike. With its advanced features and top-of-the-line design, this shoe is the ultimate combination of comfort and durability.\n\nThe HOKA ONE ONE Evo Mafate 2 1105591-CCTRS boasts a lightweight yet sturdy construction, making it the perfect shoe for those who want to take on the toughest terrains. Its breathable mesh upper and responsive cushioning provide a comfortable fit that will keep you going mile after mile.\n\nThis shoe is engineered with a Vibram Megagrip outsole for maximum traction, making it perfect for steep inclines and slippery or rocky terrain. The Active Foot Frame design offers unbeatable support and stability, while the reinforced TPU yarns provide added durability and protection.\n\nThe HOKA ONE ONE Evo Mafate 2 1105591-CCTRS is available in a sleek and stylish colourway that will make you stand out on the trails. Whether you're going for a leisurely hike or hitting the trails hard, this shoe will help you reach your goals and conquer any challenge that comes your way.\n\nShop now and experience the performance and comfort of the HOKA ONE ONE Evo Mafate 2 1105591-CCTRS for yourself. Hurry, because these shoes won't last!",
    "price": "$208",
    "variants": {
      "YELLOWBLUE": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_446ba766-9fe1-4620-ade6-ab7b897e1b75_540x.jpg?v=1662197809"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "Hoka One One Engieered Garments x Bondi B 'White'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-hoka-one-one-x-engineered-garment-bondi-b-white-1107849-wht",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the Hoka One One x Engineered Garments Bondi B 'White' - a shoe that's sure to turn heads! Perfectly engineered for both function and fashion, this collaboration is the perfect combination of style and performance. \n\nBoasting a fresh and timeless white colorway, these sneakers are made with precision and quality, ensuring maximum comfort and durability. With its signature oversized platform design, these shoes deliver unrivaled cushioning and protection during every stride. \n\nCrafted with the utmost care and attention to detail, the Hoka One One x Engineered Garments Bondi B 'White' seamlessly blends the world of sports and fashion. This shoe is the perfect choice for anyone looking for a stylish and functional way to take on their next adventure - whether that's tackling a tough workout, or hitting the streets in style. \n\nDon't miss out on this must-have collaboration - add the Hoka One One x Engineered Garments Bondi B 'White' to your collection today and elevate your footwear game to the next level!",
    "price": "$354",
    "variants": {
      "White": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_c408dce8-b5af-42d1-9643-68f2e21fbe7d_540x.jpg?v=1667728488"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "Hoka One One Engineered Garments x Bondi B 'Black'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-hoka-one-one-x-engineered-garment-bondi-b-black-1107849-blk",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the ultimate combination of style, comfort and performance – the Hoka One One x Engineered Garments Bondi B Black 1107849-BLK! \n\nCrafted in collaboration with Engineered Garments, renowned for their impeccable design aesthetics, this iconic Bondi B silhouette is a true masterpiece. Featuring a sleek black colorway that exudes elegance and sophistication, these shoes are a must-have for any fashion-forward individual.\n\nBut it's not just about the looks – the Hoka One One x Engineered Garments Bondi B Black 1107849-BLK is packed with cutting-edge technology to ensure optimal comfort and performance. The spacious toe box provides ample room for your toes to splay, while the early stage Meta-Rocker design ensures a smooth and effortless ride. The breathable mesh upper keeps your feet fresh and dry, even during intense workouts or long walks.\n\nWhether you're hitting the gym, running errands or simply hanging out with friends, the Hoka One One x Engineered Garments Bondi B Black 1107849-BLK is the perfect companion to elevate your style and take your performance to the next level. Don't settle for ordinary sneakers – make a statement with these exclusive kicks today!",
    "price": "$323",
    "variants": {
      "Black": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_6f53d0b0-8e76-46c4-9bd2-2369bc9fa247_540x.jpg?v=1667728510"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "HOKA ONE ONE Evo Carbon Rocket 'Green Blue'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-evo-carbon-rocket-yellow-1100049-ccyn",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Looking for a shoe that will give you unmatched speed and efficiency during your runs? Look no further than the HOKA ONE ONE Evo Carbon Rocket 'Green Blue' 1100049-CCYN. \n\nCrafted with precision and featuring the latest technology, these shoes offer a lightweight, carbon fiber plate that will help you achieve an exceptional running experience. Engineered specifically for racing and speed, the HOKA ONE ONE Evo Carbon Rocket is built with a responsive PROFLY X foam that delivers both a comfortable and supportive underfoot feel.\n\nThe sleek green and blue colourway is sure to turn heads, while the breathable mesh upper will keep your feet feeling fresh and dry, from your first mile to your last. Its streamlined design and innovative sole provide optimal energy return and supreme comfort for those long training days or race day. Not to mention, the high-quality construction ensures that these shoes will last, making them a great investment for any serious runner.\n\nIf you're looking to up your performance on the track or trail, you won't regret making the HOKA ONE ONE Evo Carbon Rocket 'Green Blue' 1100049-CCYN your go-to running shoe. Don't wait any longer, and take your running game to the next level with these revolutionary shoes!",
    "price": "$162",
    "variants": {
      "GREEN/BLUE": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_da491cb9-0b4c-4ff1-b84c-fa020e9dfe37_540x.jpg?v=1662112469"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "Hoka One One Tor Ultra Low WP JP 'Black'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-tor-ultra-low-black-1105689-blk",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the Hoka One One Tor Ultra Low WP JP in classic black! This shoe is perfect for the adventurer in you who craves comfort and style. With its low-cut design, the Tor Ultra provides maximum flexibility and ease of movement.\n\nFeaturing waterproof technology, this shoe is the ideal option for any outdoor activity, even in wet conditions. You can explore your surroundings with ease, protected from the elements, without compromising on style.\n\nThe Hoka One One Tor Ultra also offers unrivaled comfort, thanks to its premium cushioning that ensures a soft and supportive feel with every step. The shoe’s rugged outsole is designed to provide excellent traction, making it easy to conquer any terrain.\n\nPlus, its sleek design makes the Hoka One One Tor Ultra a versatile companion that will work brilliantly with any outfit, whether you’re exploring the great outdoors or simply enjoying a casual day out.\n\nMade to last, this shoe is an investment in both style and practicality. Get yours today and discover why Hoka One One is renowned for its quality, comfort, and style.",
    "price": "$628",
    "variants": {
      "BLACK": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_31e70c23-04f5-4253-ad30-6a105cea0723_540x.jpg?v=1662114091"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "HOKA ONE ONE Tor Ultra Low x Engineered Garments",
    "url": "https://www.kickscrew.com/products/hoka-one-one-tor-ultra-low-x-engineered-garments-black-1102502-blk",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the HOKA ONE ONE Tor Ultra Low x Engineered Garments 1102502-BLK, the ultimate combination of comfort, style and performance. Crafted with the finest materials and cutting-edge technology, this shoe is sure to take your outdoor adventures to the next level. \n\nThe sleek black design is a timeless classic, making it the perfect addition to any outdoor outfit. But don't let its stylish exterior fool you – this shoe is built to withstand any terrain you may encounter. Whether you're hiking through rocky terrain or taking a leisurely walk through the park, the Tor Ultra Low x Engineered Garments has got you covered. \n\nFeaturing HOKA ONE ONE's signature Meta-Rocker technology, this shoe provides a smooth ride, allowing you to glide through whatever obstacles may come your way. The ultra-cushioned sole provides superior comfort and support, keeping your feet happy and pain-free even after hours of wear. \n\nBut the Tor Ultra Low x Engineered Garments is not just a shoe – it's a statement. Show off your love for style and adventure with this carefully engineered masterpiece. With sizes available in English, French, German, Italian, Spanish and Greek, everyone can experience the comfort and luxury of the Tor Ultra Low x Engineered Garments 1102502-BLK. Don't settle for anything less than perfection – choose HOKA ONE ONE.",
    "price": "$957",
    "variants": {
      "DEFAULT COLOR": {
        "image": ""
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "Hoka One One Bondi 6 'Black White'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-bondi-6-black-1019269-blk",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the Hoka One One Bondi 6 in the sleek and stylish 'Black White' colorway! \nExperience the ultimate in comfort and performance with this top-of-the-line running shoe. \n\nWith its signature thick cushioning, the Bondi 6 provides unparalleled shock absorption, cushioning your every step and minimizing impact on your joints. The breathable upper keeps your feet cool and dry during intense workouts, and the durable outsole offers reliable grip on a variety of surfaces.\n\nWhether you're a seasoned runner or just starting out, the Hoka One One Bondi 6 is the perfect choice for anyone who values both fashion and function. So why wait? Step up your game and gear up with the Bondi 6 today! \n\nOrder now and enjoy the benefits of free shipping and easy returns. Upgrade your footwear game with Hoka One One and get ready to conquer any challenge that comes your way!",
    "price": "$169",
    "variants": {
      "BLACK": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_0fe17ec2-a903-4774-81b8-b323dac5a3cd_540x.jpg?v=1682053124"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "Hoka One One Opening Ceremony x Bondi 6 'White Reflective'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-bondi6-white-1019269-wwrf",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the highly-anticipated Hoka One One Opening Ceremony x Bondi 6 'White Reflective'! This collaboration brings together the exceptional comfort and performance of Hoka One One's iconic Bondi 6 with the cool edge of Opening Ceremony's signature aesthetic. Perfect for runners and sneaker enthusiasts alike, these kicks are the ultimate blend of style and function.\n\nCrafted with a sleek and reflective design, these shoes are sure to turn heads wherever you go. The futuristic vibe of the reflective detailing adds a unique touch to your look while also increasing visibility on early morning or late evening runs. The white colorway exudes a clean and classic look that will never go out of style.\n\nBut it's not just about the style – the Hoka One One Bondi 6 'White Reflective' is also designed for optimal performance. The premium cushioning provides unrivaled comfort and support, making them ideal for long runs, gym workouts, or even everyday wear. The breathable mesh upper keeps your feet cool and comfortable, even during intense workouts.\n\nWhether you're a runner, athlete, or simply looking for a stylish pair of sneakers to complete your streetwear look, the Hoka One One Opening Ceremony x Bondi 6 'White Reflective' is the perfect choice. Don't miss out on the chance to get your hands on these limited edition kicks – add them to your collection today!",
    "price": "$343",
    "variants": {
      "white": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_c5a8ec10-b2ca-468b-9781-cdacf85ad6eb_540x.jpg?v=1662138821"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "Hoka One One Sky Kaha 'Dune Oxford Tan'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-sky-kaha-khaki-1099637-dotn",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the Hoka One One Sky Kaha 'Dune Oxford Tan' - the ultimate adventure shoes for the modern, wanderlust-filled soul. Crafted with the finest materials, these shoes showcase a sleek and minimalist design that is perfect for any outdoor exploration. \n\nDesigned to provide maximum comfort and support, the Sky Kaha features a lightweight yet durable construction that makes it ideal for all-day wear. The padded collar and tongue offer added cushioning, while the extended heel and rockered sole ensure a smooth ride no matter the terrain. Plus, the sturdy laces are engineered for a secure fit, so you can confidently tackle any trail.\n\nBut what really sets the Sky Kaha apart is its unique style. The 'Dune Oxford Tan' colorway is a standout feature, offering a subtle yet stunning contrast of earthy tones that are sure to turn heads. Whether you're trekking through rocky mountains or wandering through sandy deserts, these shoes will elevate your style game while keeping your feet happy.\n\nSo what are you waiting for? Gear up for your next adventure with the Hoka One One Sky Kaha 'Dune Oxford Tan' - the ultimate fusion of style and performance.",
    "price": "$323",
    "variants": {
      "KHAKI": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_169568e9-d503-40ce-95e6-de6261e5ac85_540x.jpg?v=1662114088"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "Hoka One One Sky Kaha High 'Black'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-sky-kaha-black-1099637-bphn",
    "category": "Hiking Shoes",
    "description": "Looking for a hiking boot that combines durability, performance and style? Look no further! The Hoka One One Sky Kaha High 'Black' 1099637-BPHN is the perfect choice for avid hikers and adventurers.\n\nCrafted from premium materials, this hiking boot boasts a sleek black design that exudes confidence and sophistication. But don't be fooled by its stylish exterior - the Sky Kaha High is a serious hiking boot that's built to handle rugged terrain and unpredictable weather.\n\nEquipped with Hoka One One's signature innovative technology, the Sky Kaha High offers unparalleled comfort and support on even the toughest trails. The boot's padded collar and tongue provide a snug fit, while the extra-wide platform helps to stabilize your footing.\n\nWith its waterproof construction and Vibram Megagrip outsole, the Sky Kaha High is ready to take on any challenge - whether you're trekking through a muddy forest or climbing steep mountain trails.\n\nIn short, the Hoka One One Sky Kaha High 'Black' 1099637-BPHN is the perfect blend of style, performance and durability. So why wait? Add it to your cart today and enjoy your next adventure in style!",
    "price": "$348",
    "variants": {
      "BLACK": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_526e89bf-fc3d-432f-af82-e3e02134732b_540x.jpg?v=1662199605"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "Hoka One One Tor Ultra Low WP JP 'Burnt Olive'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-tor-ultra-low-burnt-olive-1105689-btol",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the Hoka One One Tor Ultra Low WP JP in the stunning 'Burnt Olive' colorway! If you're looking for a performance-driven hiking shoe that doesn't skimp on style, this shoe is the perfect match for you. \n\nCrafted with expert precision and attention to detail, the Tor Ultra Low WP JP is a must-have for outdoor enthusiasts. The shoe boasts a low-cut silhouette and features durable leather and synthetic materials for ultimate protection against rugged terrain. \n\nWith its waterproof yet breathable eVent® membrane, this shoe will keep you comfortable and dry no matter what the weather throws your way. The Tor Ultra Low WP JP is also equipped with an oversized EVA midsole and a Vibram® MegaGrip outsole, ensuring unparalleled stability, traction, and support on any terrain. \n\nBut don't think that function comes at the cost of style! The 'Burnt Olive' colorway is perfect for those who want to add a pop of color to their hiking wardrobe. The shoe features a sleek and modern design that seamlessly blends form and function. \n\nWhether you're an experienced hiker or just starting out, the Hoka One One Tor Ultra Low WP JP in 'Burnt Olive' is the perfect shoe to elevate your outdoor experience. So why wait? Grab your pair today and get ready to conquer the trails in style.",
    "price": "$709",
    "variants": {
      "OLIVE GREEN": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_16f74abc-d76f-437a-8caf-0dca1d28cabd_540x.jpg?v=1662199600"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "Hoka One One Mafate Speed 2 'Bright Gold Evening Primrose'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-mafate-speed-2-bright-gold-evening-primrose-1012343-bgep",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Are you ready to take your trail running experience to the next level? Look no further than the Hoka One One Mafate Speed 2 in 'Bright Gold Evening Primrose' (1012343-BGEP)!\n\nWith its striking colorway, this shoe will not only make a statement on the trails but also provide you with the ultimate comfort and support. The Mafate Speed 2 boasts a lightweight yet durable construction, featuring a breathable mesh upper that allows for maximum ventilation.\n\nEquipped with a thick midsole and Vibram MegaGrip outsole, you can confidently navigate any terrain with ease. The Mafate Speed 2 also includes a rubberized toe cap for added protection and a lace garage to keep your shoelaces secure.\n\nThis shoe truly has it all - style, comfort, and performance. Order your pair of Hoka One One Mafate Speed 2 'Bright Gold Evening Primrose' (1012343-BGEP) today and experience the ultimate trail running upgrade!",
    "price": "$237",
    "variants": {
      "BLACK/YELLOW/ORANGE": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_47693ae5-a0e6-4c78-b6e5-0344ceecb0fa_540x.jpg?v=1662144506"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "HOKA ONE ONE Anacapa Low Gore Tex 'Castlerock'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-anacapa-low-gore-tex-castlerock-1122017-cshr",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the ultimate outdoor companion - the HOKA ONE ONE Anacapa Low Gore Tex sneakers in striking 'Castlerock' color! Engineered to take on any terrain, these sneakers boast a lightweight and breathable design that ensures uncompromised comfort even during challenging hikes.\n\nIncorporating tech-forward features, these sneakers come with a GORE-TEX® upper that repels water and lets air flow through, keeping your feet dry and fresh, no matter the weather. The RMAT® midsole offers firm and responsive cushioning, reducing fatigue levels and keeping your feet energized throughout the day.\n\nThese sneakers are not just functional but also fashion-forward. The rugged Castlerock colorway adds a touch of boldness, making a statement wherever your journey takes you. \n\nWhether you need to conquer rocky paths, muddy trails or even city sidewalks, the HOKA ONE ONE Anacapa Low Gore Tex sneakers have got you covered. Order now and take the first step towards outshining your limits!",
    "price": "$200",
    "variants": {
      "": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_e87ee755-e93c-4f28-8d61-d5f91708f05e_540x.jpg?v=1683179136"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "HOKA ONE ONE Mafate Speed 4 'Puffin's Bill Orange'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-mafate-speed-4-puffins-bill-orange-1129930-pbssn",
    "category": "Trail Running Shoes",
    "description": "Introducing the HOKA ONE ONE Mafate Speed 4 'Puffin's Bill Orange' 1129930-PBSSN, a high-performance trail running shoe that will take your running experience to the next level. With its unique and eye-catching design, this shoe is a must-have for both seasoned runners and trail enthusiasts alike.\n\nCrafted with the latest technology, the Mafate Speed 4 provides exceptional support and comfort, ensuring that you can take on any terrain with ease. The shoe features a lightweight construction with a breathable upper that allows for ample airflow during long runs.\n\nThe 'Puffin's Bill Orange' colorway adds a pop of color to your running ensemble and is sure to turn heads on the trail. Whether you're running through rocky terrain or muddy puddles, the Mafate Speed 4 offers superior traction and durability, thanks to its Vibram Megagrip outsole.\n\nSo, if you want to take your off-road running experience to the next level, the HOKA ONE ONE Mafate Speed 4 'Puffin's Bill Orange' should be at the top of your shopping list. Get yours today and experience the ultimate blend of style, comfort, and performance.",
    "price": "$230",
    "variants": {
      "": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_96821c7b-cbba-4296-96e6-64f78c14ac7d_540x.jpg?v=1678956711"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "HOKA ONE ONE Kaha 2 High Gore Tex 'Shifting Sand Eggnog'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-kaha-2-high-gore-tex-shifting-sand-eggnog-1130529-sseg",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Looking for a shoe that can handle any terrain, weather or challenge? Look no further than the HOKA ONE ONE Kaha 2 High Gore Tex in 'Shifting Sand Eggnog'. This versatile shoe is the ultimate combination of durability, comfort and style.\n\nCrafted with Gore Tex technology, the Kaha 2 High is fully waterproof, keeping your feet dry and protected in even the wettest conditions. The high-top design also provides added ankle support, perfect for hiking or trail running.\n\nBut don't let the rugged exterior fool you - the Kaha 2 High is also incredibly comfortable, thanks to HOKA ONE ONE's signature cushioned midsole that reduces impact and provides support with each step. The 'Shifting Sand Eggnog' colorway adds a touch of style, making this shoe just as suitable for city sidewalks as it is for mountain trails.\n\nWhether you're scaling rocky peaks or taking a walk in the park, the HOKA ONE ONE Kaha 2 High Gore Tex is the ultimate shoe for active, adventure-seeking individuals. So why settle for anything less? Order your pair today!",
    "price": "$265",
    "variants": {
      "": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_8c3e55c6-cbb6-4250-a8b9-c1718d4ca0cf_540x.jpg?v=1683096347"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "HOKA ONE ONE Clifton L Gore Tex 'Black'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-clifton-l-gore-tex-black-1129972-bblc",
    "category": "Hiking Shoes",
    "description": "Introducing the HOKA ONE ONE Clifton L Gore Tex 'Black' – the ultimate shoe for conquering any terrain. Whether you're hitting the trails or pounding the pavement, these shoes are designed to keep you comfortable and protected.\n\nCrafted with Gore Tex technology, these shoes are both waterproof and breathable, ensuring your feet stay dry and comfortable no matter the weather. The black colorway exudes a sleek and bold look, making them a must-have addition to any athletic wardrobe.\n\nThese shoes were crafted to prioritize both style and functionality. With a signature HOKA ONE ONE design, these shoes offer unparalleled cushioning for maximum comfort on even the toughest of surfaces. The lightweight construction allows for effortless movement, providing a smooth ride with each step.\n\nWith sizes available for men and women, the HOKA ONE ONE Clifton L Gore Tex 'Black' is the perfect footwear for athletes of all levels. Don't let anything hold you back from achieving your goals – invest in a pair of these remarkable shoes today!",
    "price": "$206",
    "variants": {
      "": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_a30ab934-248d-4450-99c9-894586ec1baf_540x.jpg?v=1678956920"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "HOKA ONE ONE Kaha 2 High Gore Tex 'Duffel Bag Green Radiant Yellow'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-kaha-2-high-gore-tex-duffel-bag-green-radiant-yellow-1123155-dbryl",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the HOKA ONE ONE Kaha 2 High Gore Tex in 'Duffel Bag Green Radiant Yellow' - the ultimate hiking companion for all your outdoor adventures.\n\nCrafted with high-quality materials, this hiking boot is designed to provide maximum comfort during long treks. With Gore Tex technology, your feet stay dry in all weather conditions. The sturdy construction features a rubberized toe cap for extra durability while the cushioned midsole and Vibram Megagrip outsole provide optimal stability on any terrain.\n\nBut that's not all, the 'Duffel Bag Green Radiant Yellow' colorway is an epic statement piece guaranteed to turn heads. With a striking combination of bold yellow and earthy green, this shoe is perfect for the adventurous soul seeking to break away from the monotony of conventional hiking footwear.\n\nThis boot is available in sizes suitable for men and women and is the ideal choice for those who demand performance and style from their hiking gear. Grab a pair of the HOKA ONE ONE Kaha 2 High Gore Tex 'Duffel Bag Green Radiant Yellow' today, and take on new trails with confidence!",
    "price": "$255",
    "variants": {
      "": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_e9a8a9b9-eab7-43f5-bc9e-5c3532fb0720_540x.jpg?v=1683176738"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "HOKA ONE ONE Mafate Speed 4 'Thyme Green Fiesta'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-mafate-speed-4-thyme-green-fiesta-1129930-tfst",
    "category": "Trail Running Shoes",
    "description": "Looking for a shoe that can keep up with your adventurous spirit? Look no further than the HOKA One One Mafate Speed 4 in 'Thyme Green Fiesta'. Whether you're traversing rocky trails, tackling steep inclines, or just pounding the pavement, these shoes are the perfect companion for all your outdoor adventures.\n\nCrafted with the latest in shoe technology, the Mafate Speed 4 boasts a durable, breathable upper that keeps your feet cool and dry no matter the conditions. Meanwhile, the oversized EVA midsole and Vibram MegaGrip outsole offer unbeatable cushioning and support, ensuring a comfortable, stable ride.\n\nBut what really sets the Mafate Speed 4 apart is its eye-catching design. The 'Thyme Green Fiesta' colorway is the perfect mix of vibrant and earthy tones, making it a versatile choice for any outdoor look. And with sizes available from men's 7 to 15, finding your perfect fit has never been easier.\n\nSo if you're ready to take on the great outdoors in style, don't let the HOKA One One Mafate Speed 4 in 'Thyme Green Fiesta' slip away. Add them to your cart today and get ready to hit the trails with confidence!",
    "price": "$246",
    "variants": {
      "": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_16a9cfaa-5545-44ac-b35a-641e19043800_540x.jpg?v=1678956731"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "HOKA ONE ONE Kaha 2 Low Gore Tex 'Shifting Sand'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-kaha-2-low-gore-tex-shifting-sand-1130530-sseg",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Looking for a reliable and high-performance shoe that can keep up with your outdoor adventures? Look no further than the HOKA ONE ONE Kaha 2 Low Gore Tex in the stunning 'Shifting Sand' colorway, a shoe that is sure to impress.\n\nCrafted with the utmost attention to detail and engineered to meet the needs of even the most demanding outdoor enthusiasts, this shoe is the perfect combination of style and substance.\n\nWith its GORE-TEX waterproof membrane, this shoe ensures that your feet stay dry even in the wettest of conditions, making it the ideal choice for hiking, camping, or any other outdoor activity.\n\nThe HOKA ONE ONE Kaha 2 Low Gore Tex is also designed with maximum comfort in mind. Its cushioned midsole and premium materials provide a soft and supportive footbed, making it the perfect choice for those long days on the trail.\n\nIn addition, the shoe's rugged outsole provides excellent traction on a variety of surfaces, giving you the confidence you need to take on any terrain.\n\nSo why wait? Choose the HOKA ONE ONE Kaha 2 Low Gore Tex in 'Shifting Sand' today and experience the perfect blend of style, comfort, and performance that is sure to take your outdoor adventures to the next level.",
    "price": "$195",
    "variants": {
      "": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_698bf468-8001-4b3f-a43f-cac297f8a866_540x.jpg?v=1683096346"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "HOKA ONE ONE Ora Clifton L Suede 'Eggnog'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-ora-clifton-l-suede-eggnog-1122571-eegg",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the stylish and comfortable HOKA ONE ONE Ora Clifton L Suede in the trendy 'Eggnog' colorway! Whether you're running errands or running a marathon, these sneakers will take you there in style and comfort. \n\nCrafted with high-quality materials, including a soft suede upper and a cushioned sole, these sneakers are designed to help you go the distance. The specially designed sole provides excellent traction, giving you confidence and stability with each step you take.\n\nNot only are these sneakers built to perform, but they also look great. The 'Eggnog' colorway is a popular choice this season, and it's easy to see why. The neutral tones make it easy to pair with any outfit, while the unique suede texture adds a touch of sophistication.\n\nWhether you're hitting the gym or running around town, these sneakers are perfect for any activity. So why wait? Add the HOKA ONE ONE Ora Clifton L Suede to your shoe collection today and experience the ultimate in both style and comfort!",
    "price": "$191",
    "variants": {
      "": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_6481344b-7ddd-4239-be20-b5b0e02af8d1_540x.jpg?v=1678956477"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "HOKA ONE ONE Stinson ATR 6 'Nimbus Cloud'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-stinson-atr-6-nimbus-cloud-1122630-dotn",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the HOKA ONE ONE Stinson ATR 6 'Nimbus Cloud' - the ultimate trail running shoe for those who want to feel like they're running on clouds. With its stunning color combination and exceptional features, this shoe is the perfect choice for both experienced and aspiring trail runners.\n\nThe Stinson ATR 6 has been designed with your comfort and performance in mind. Thanks to its EVA midsole, it provides unparalleled cushioning that will absorb all impact on the trails, reducing fatigue and allowing you to push harder and further. The Meta-Rocker technology is also a game changer, giving you a smooth, fluid stride on any terrain. And let's not forget about the durable outsole with 4mm lugs, providing you with excellent traction and grip on both wet and dry surfaces.\n\nBut the Stinson ATR 6 'Nimbus Cloud' is more than just a functional shoe - it's also a stylish one. The beautiful color scheme of white, blue and pink is eye-catching and will make you stand out on the trails. Moreover, the upper is made of breathable mesh, ensuring that your feet stay cool, dry and comfortable even during intense runs.\n\nWhether you're a seasoned trail runner or just getting started, the HOKA ONE ONE Stinson ATR 6 'Nimbus Cloud' is a must-have shoe for your collection. Don't wait any longer, and experience the ultimate combination of style and performance on your next trail adventure.",
    "price": "$313",
    "variants": {
      "": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_bac61aa2-be23-44f2-ae07-36d4cc503547_540x.jpg?v=1683278739"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "HOKA ONE ONE Speedgoat 5 'Fiesta Red Radiant Yellow'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-speedgoat-5-fiesta-red-radiant-yellow-1123157-fryl",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the HOKA ONE ONE Speedgoat 5 in the vibrant 'Fiesta Red Radiant Yellow' colorway, the perfect combination of style and performance. \n\nStep up your running game with these top-of-the-line trail running shoes that have been designed to tackle any terrain with ease. The breathable mesh upper and durable overlays provide maximum support and protection while still allowing for a comfortable and flexible fit. \n\nWith HOKA's signature oversized midsole and Vibram® Megagrip outsole, you'll experience unparalleled cushioning and traction on even the toughest trails. The reinforced toe cap and heel counter add extra durability, making these shoes ideal for even the most rugged terrain. \n\nAnd let's not forget about the eye-catching colorway - the 'Fiesta Red Radiant Yellow' is sure to turn heads and make a statement on the trails. \n\nInvest in your running with the HOKA ONE ONE Speedgoat 5 and experience the ultimate combination of style and performance. Order yours today and take the first step towards dominating the trails.",
    "price": "$170",
    "variants": {
      "": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_d6b43271-e095-46c0-8e67-e8cb1c205920_540x.jpg?v=1683306032"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "HOKA ONE ONE Bondi L 'Moonlit Ocean Blue'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-bondi-l-moonlit-ocean-blue-1110538-monc",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Are you ready to elevate your running game to the next level? Look no further than the HOKA ONE ONE Bondi L 'Moonlit Ocean Blue'. This sleek and stylish shoe is not only a fashion statement but also a performance powerhouse, designed to take your training to new heights.\n\nCrafted with the latest technology and materials, this shoe boasts a breathable upper and a secure fit to keep you comfortable and supported mile after mile. The iconic HOKA ONE ONE cushioning system provides maximum shock absorption, ensuring a smooth and comfortable ride even on the toughest terrains.\n\nNot only is this shoe designed for optimal performance, it also looks great on and off the track. The 'Moonlit Ocean Blue' colorway is bold and eye-catching, making sure you stand out from the crowd.\n\nWhether you are a professional athlete or a weekend runner, the HOKA ONE ONE Bondi L 'Moonlit Ocean Blue' is the perfect shoe to help you achieve your goals. Order now and experience the best in style and performance.",
    "price": "$228",
    "variants": {
      "": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_d05c313d-7454-4a16-bb4f-6b515a2abcc0_540x.jpg?v=1683265473"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "HOKA ONE ONE Ora Cliftton L Suede 'Simply Taupe Pumice Stone'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-ora-cliftton-l-suede-simply-taupe-pumice-stone-1122571-stpst",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the HOKA ONE ONE Ora Clifton L Suede in 'Simply Taupe Pumice Stone' (1122571-STPST), the perfect addition to your shoe collection! \n\nCrafted with the finest suede material, these shoes are not only comfortable but stylish as well. The 'Simply Taupe Pumice Stone' color combination adds a touch of elegance, making them suitable for any occasion. These shoes are perfect for both men and women - the unisex design makes it an ideal choice for anyone who wants comfort and style without compromising on quality.\n\nThanks to the HOKA ONE ONE technology, these shoes are built to handle any terrain while providing an optimum level of cushioning. The Meta-Rocker technology promotes a smooth and natural gait, reducing the chances of any discomfort or injuries during your activities.\n\nWhether you're an athlete, a fitness enthusiast or just looking for the perfect pair of shoes for everyday wear, the HOKA ONE ONE Ora Clifton L Suede in 'Simply Taupe Pumice Stone' (1122571-STPST) is the ultimate choice. Your shoe collection deserves the best, and these shoes are guaranteed to take it to the next level! \n\nSo why wait? Add the HOKA ONE ONE Ora Clifton L Suede in 'Simply Taupe Pumice Stone' (1122571-STPST) to your cart now and experience the ultimate combination of comfort, style and durability!",
    "price": "$180",
    "variants": {
      "": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_e1b0ee37-eaaf-4d57-aa74-e0aafadcbc04_540x.jpg?v=1682052637"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "HOKA ONE ONE Clifton L Gore Tex 'Avocado Green Moss'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-clifton-l-gore-tex-avocado-green-moss-1129972-agms",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the HOKA ONE ONE Clifton L Gore Tex in 'Avocado Green Moss' (1129972-AGMS), the perfect blend of style and performance for any adventure. Whether you're hitting the trails or pounding the pavement, these shoes are designed to keep your feet comfortable and supported.\n\nThis innovative shoe features a Gore Tex membrane that provides waterproof and breathable protection against the elements, so you stay dry and comfortable no matter what the weather throws at you. The outsole is made with a durable rubber that provides excellent grip and traction on any surface, helping you to stay stable and in control with every step you take.\n\nThe Clifton L Gore Tex is not just functional, but also stylish. The 'Avocado Green Moss' color scheme is an eye-catching combination that is sure to turn heads. The shoe is crafted with a sleek and modern design that will make you stand out in a crowd.\n\nInside, the shoe delivers unrivaled comfort with its plush EVA midsole that provides superior cushioning and support. The shoe also features a molded Ortholite insole that provides additional cushioning and support, making these shoes the perfect choice for those who want comfort and performance in one package.\n\nSo why settle for anything less than the best? Choose the HOKA ONE ONE Clifton L Gore Tex in 'Avocado Green Moss' (1129972-AGMS) and take on any adventure with confidence and style.",
    "price": "$180",
    "variants": {
      "": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_5a9c05cd-6451-44cb-8667-7e3ddaa04640_540x.jpg?v=1683190409"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "HOKA ONE ONE Anacapa Mid GTX 'Thyme Radiant Yellow'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-anacapa-mid-gtx-thyme-radiant-yellow-1122018-tryl",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the HOKA ONE ONE Anacapa Mid GTX 'Thyme Radiant Yellow' 1122018-TRYL, the perfect footwear for hikers and adventure-seekers alike. With its mid-cut design, this shoe provides excellent ankle support and protection against rugged terrains.\n\nCrafted with premium quality materials, this shoe boasts a waterproof Gore-Tex membrane, keeping your feet dry even in wet and damp conditions. The Thyme Radiant Yellow colorway adds a touch of style to your outdoor attire, making sure you look good even in the midst of your adventures.\n\nEquipped with a Vibram Megagrip outsole, this shoe provides unparalleled traction and stability on slippery and uneven surfaces. The lightweight EVA midsole ensures maximum comfort and cushioning, reducing fatigue on long hikes and treks.\n\nWhether you're embarking on a challenging hike or exploring new trails, the HOKA ONE ONE Anacapa Mid GTX 'Thyme Radiant Yellow' 1122018-TRYL is the perfect companion for your journey. So step up your game and add this pair to your collection today!",
    "price": "$199",
    "variants": {
      "": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_47579b90-f397-4f7c-9adb-a1da4383173a_540x.jpg?v=1683380430"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "HOKA ONE ONE Bondi 8 'Sharkskin Harbor Mist'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-bondi-8-sharkskin-harbor-mist-1123202-shms",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the HOKA ONE ONE Bondi 8 in the stunning 'Sharkskin Harbor Mist' colorway - a shoe that is sure to elevate your running experience. \n\nCrafted with the brand's signature marshmallow-soft cushioning, this shoe is designed to provide you with a comfortable and effortless ride, mile after mile. The full EVA midsole and Meta-Rocker technology work together to give you a smooth roll and a supportive stance, while also reducing impact and enhancing your running gait.\n\nThe shoe's upper is made with a breathable mesh material that ensures your feet stay cool and dry even on the hottest of days. The engineered mesh construction provides a secure and comfortable fit, while the TPU overlays give you added support and durability where you need it most.\n\nWith its sleek and modern look, the HOKA ONE ONE Bondi 8 in 'Sharkskin Harbor Mist' is the perfect combination of style and performance. Ideal for long-distance runners who demand nothing but the best, these shoes are available in a range of sizes to cater to all foot types. Order now and experience the ultimate in comfort, style and performance.",
    "price": "$165",
    "variants": {
      "": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_6adb29bf-ac58-403c-ba43-0fb75d56da6a_540x.jpg?v=1683108564"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "HOKA ONE ONE Anacapa Low Gore Tex 'Outer Space Mountain Spring'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-anacapa-low-gore-tex-outer-space-mountain-spring-1122017-osms",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the ultimate hiking shoe - the HOKA ONE ONE Anacapa Low Gore Tex in 'Outer Space Mountain Spring'! This shoe is designed to keep your feet cool, dry, and protected while you explore the great outdoors.\n\nCrafted with a Gore Tex membrane, these shoes are fully waterproof and breathable - ensuring your feet stay comfortable no matter what the weather conditions. The Anacapa Low also features a durable rubber sole with mega grip tread, providing excellent traction on wet and rocky terrain.\n\nNot only do these shoes have excellent performance features, but they also look great too! The 'Outer Space Mountain Spring' colorway is a unique blend of blue and green that will make you stand out on the trail.\n\nSo why settle for an average hiking shoe when you can have the best? Choose HOKA ONE ONE Anacapa Low Gore Tex for your next outdoor adventure and experience the ultimate in comfort, protection, and style!",
    "price": "$200",
    "variants": {
      "": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_ae6b7921-d76f-481a-bab0-dacdd9f21f96_540x.jpg?v=1683352371"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "HOKA ONE ONE Anacapa Mid GTX 'Thyme Radiant Yellow'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-anacapa-mid-gtx-thyme-radiant-yellow-1122018-tryl",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the HOKA ONE ONE Anacapa Mid GTX 'Thyme Radiant Yellow' 1122018-TRYL, the perfect footwear for hikers and adventure-seekers alike. With its mid-cut design, this shoe provides excellent ankle support and protection against rugged terrains.\n\nCrafted with premium quality materials, this shoe boasts a waterproof Gore-Tex membrane, keeping your feet dry even in wet and damp conditions. The Thyme Radiant Yellow colorway adds a touch of style to your outdoor attire, making sure you look good even in the midst of your adventures.\n\nEquipped with a Vibram Megagrip outsole, this shoe provides unparalleled traction and stability on slippery and uneven surfaces. The lightweight EVA midsole ensures maximum comfort and cushioning, reducing fatigue on long hikes and treks.\n\nWhether you're embarking on a challenging hike or exploring new trails, the HOKA ONE ONE Anacapa Mid GTX 'Thyme Radiant Yellow' 1122018-TRYL is the perfect companion for your journey. So step up your game and add this pair to your collection today!",
    "price": "$199",
    "variants": {
      "": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_47579b90-f397-4f7c-9adb-a1da4383173a_540x.jpg?v=1683380430"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "HOKA ONE ONE Bondi 8 'Sharkskin Harbor Mist'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-bondi-8-sharkskin-harbor-mist-1123202-shms",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the HOKA ONE ONE Bondi 8 in the stunning 'Sharkskin Harbor Mist' colorway - a shoe that is sure to elevate your running experience. \n\nCrafted with the brand's signature marshmallow-soft cushioning, this shoe is designed to provide you with a comfortable and effortless ride, mile after mile. The full EVA midsole and Meta-Rocker technology work together to give you a smooth roll and a supportive stance, while also reducing impact and enhancing your running gait.\n\nThe shoe's upper is made with a breathable mesh material that ensures your feet stay cool and dry even on the hottest of days. The engineered mesh construction provides a secure and comfortable fit, while the TPU overlays give you added support and durability where you need it most.\n\nWith its sleek and modern look, the HOKA ONE ONE Bondi 8 in 'Sharkskin Harbor Mist' is the perfect combination of style and performance. Ideal for long-distance runners who demand nothing but the best, these shoes are available in a range of sizes to cater to all foot types. Order now and experience the ultimate in comfort, style and performance.",
    "price": "$165",
    "variants": {
      "": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_6adb29bf-ac58-403c-ba43-0fb75d56da6a_540x.jpg?v=1683108564"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "HOKA ONE ONE Anacapa Low Gore Tex 'Outer Space Mountain Spring'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-anacapa-low-gore-tex-outer-space-mountain-spring-1122017-osms",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the ultimate hiking shoe - the HOKA ONE ONE Anacapa Low Gore Tex in 'Outer Space Mountain Spring'! This shoe is designed to keep your feet cool, dry, and protected while you explore the great outdoors.\n\nCrafted with a Gore Tex membrane, these shoes are fully waterproof and breathable - ensuring your feet stay comfortable no matter what the weather conditions. The Anacapa Low also features a durable rubber sole with mega grip tread, providing excellent traction on wet and rocky terrain.\n\nNot only do these shoes have excellent performance features, but they also look great too! The 'Outer Space Mountain Spring' colorway is a unique blend of blue and green that will make you stand out on the trail.\n\nSo why settle for an average hiking shoe when you can have the best? Choose HOKA ONE ONE Anacapa Low Gore Tex for your next outdoor adventure and experience the ultimate in comfort, protection, and style!",
    "price": "$200",
    "variants": {
      "": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_ae6b7921-d76f-481a-bab0-dacdd9f21f96_540x.jpg?v=1683352371"
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "HOKA ONE ONE Challenger ATR 7 'Black'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-challenger-atr-7-black-1134497-bblc",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the HOKA ONE ONE Challenger ATR 7 in sleek black - the ultimate running shoe that pushes boundaries and takes your performance to the next level! Whether you're a seasoned pro or just starting out, these shoes are designed to help you achieve your personal bests and reach new heights of athleticism.\n\nCrafted from the finest materials, these shoes offer a perfect blend of durability, comfort, and style. The spacious toe box ensures a comfortable fit for all foot types, while the dual-layer mesh upper keeps your feet cool and dry throughout your workout. The midsole features HOKA's signature PROFLY technology, offering a blend of responsiveness and stability to keep you going mile after mile.\n\nWith a 4mm heel-to-toe drop, the HOKA ONE ONE Challenger ATR 7 encourages a natural stride and provides a smooth, cushioned ride. The sturdy outsole is designed for maximum traction on all terrains, so you can tackle any trail with confidence. Plus, the shoe's unique design ensures that you'll look as good as you feel while you're out there crushing it.\n\nWhether you're a trail runner or a road runner, the HOKA ONE ONE Challenger ATR 7 is the perfect shoe to take your fitness to the next level. Don't settle for anything less than the best - add these versatile and reliable shoes to your workout arsenal today!",
    "price": "$155",
    "variants": {
      "": {
        "image": ""
      }
    },
    "audience": [
      "Men's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "HOKA ONE ONE Bondi 6",
    "url": "https://www.kickscrew.com/products/hoka-one-one-wmns-bondi-6-black-1019272-bblc",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Looking for the perfect running shoe to conquer any terrain? Look no further than the (WMNS) HOKA ONE ONE Bondi 6 1019272-BBLC! This shoe is designed to take your running experience to the next level, whether you're hitting the pavement or blazing a trail through the woods.\n\nCrafted with a breathable mesh upper and sleek design, the Bondi 6 offers both style and functionality. The shoe utilizes HOKA ONE ONE's signature cushioning technology, giving you unparalleled comfort and support as you strive for your next personal record. Plus, the shoe's extended heel ensures a smooth stride from start to finish.\n\nBut the Bondi 6 isn't just about the technology - it's also about the attention to detail. The shoe's bold blue and black color combination is guaranteed to turn heads and make a statement whenever you lace up. And with sizes available for women of all foot types, you can be sure that this shoe will fit like a glove.\n\nDon't settle for a mediocre running experience. Elevate your game with the (WMNS) HOKA ONE ONE Bondi 6 1019272-BBLC, the perfect combination of style, comfort, and performance. Order yours today and start tackling those trails with confidence!",
    "price": "$493",
    "variants": {
      "BLACK": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_4f286934-e66b-412c-8c74-ee73360ad58b_540x.jpg?v=1682022226"
      }
    },
    "audience": [
      "Women's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "Hoka One One Bondi 8 'Black'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-wmns-bondi-8-black-1127952-bblc",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the (WMNS)Hoka One One Bondi 8 'Black' 1127952-BBLC - the ultimate comfort sneakers for your everyday needs! \n\nCrafted with precision and expertise, these sneakers assure superior comfort, thanks to their ultra-soft cushioning and breathable mesh upper that offer unmatched stability for your feet. The Bondi 8 is the perfect choice for runners, hikers or anyone who's always on the go!\n\nThese sneakers come in classic black, making them a versatile addition to your wardrobe. Whether you're running errands, hitting the gym or simply going for a walk, be prepared to turn heads with its sleek design and superior performance.\n\nSo why wait? Get your hands on the (WMNS)Hoka One One Bondi 8 'Black' 1127952-BBLC today and experience unparalleled comfort with every stride!",
    "price": "$163",
    "variants": {
      "Black": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_f7894df5-a439-46f3-b9f4-f72413ce1066_540x.jpg?v=1682509352"
      }
    },
    "audience": [
      "Women's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "HOKA ONE ONE Kaha Gore-Tex",
    "url": "https://www.kickscrew.com/products/hoka-one-one-wmns-kaha-gore-tex-black-phantom-1112031-bphn",
    "category": "Hiking Shoes",
    "description": "Introducing the (WMNS) HOKA ONE ONE Kaha Gore-Tex 1112031-BPHN - the ultimate hiking shoe for women!\n\nCrafted to withstand the toughest terrain, these shoes are designed with a Gore-Tex waterproof membrane to keep your feet dry and comfortable on any adventure. The premium full-grain leather and textile upper provide a durable yet lightweight feel, while the ankle-high design offers unrivaled ankle support and protection.\n\nWith a rugged Vibram Megagrip outsole, the (WMNS) HOKA ONE ONE Kaha Gore-Tex 1112031-BPHN ensures maximum traction and stability on both wet and dry surfaces, so you can confidently tackle any trail. Plus, the patented HOKA ONE ONE cushioned midsole offers superior shock absorption, ensuring a comfortable stride even on the most challenging terrain.\n\nWhether you're a serious hiker, trail runner or just a lover of the great outdoors, these shoes are the perfect addition to your kit. Order now and experience the ultimate in comfort, durability and performance, from the experts at HOKA ONE ONE.\n\nDon't let rough terrain hold you back, step up your game with the (WMNS) HOKA ONE ONE Kaha Gore-Tex 1112031-BPHN.",
    "price": "$488",
    "variants": {
      "DEFAULT COLOR": {
        "image": ""
      }
    },
    "audience": [
      "Women's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "HOKA ONE ONE Anacapa Mid Gore-Tex",
    "url": "https://www.kickscrew.com/products/hoka-one-one-wmns-anacapa-mid-gore-tex-black-1119372-bblc",
    "category": "Hiking Shoes",
    "description": "Introducing the (WMNS) HOKA ONE ONE Anacapa Mid Gore-Tex 1119372-BBLC - the ultimate hiking shoe that will take your outdoor adventures to the next level!\n\nCrafted with premium quality materials, this shoe is designed to provide maximum comfort and support even on the toughest terrains. The Gore-Tex technology ensures that your feet stay dry and comfortable no matter the weather conditions, with the added benefit of breathability to avoid that uncomfortable sweaty feeling.\n\nThe mid-cut design provides extra ankle support, ensuring a secure fit and protection from any obstacles you may encounter along your path. With a rugged outsole that provides superior traction and grip, you can confidently take on any trail and conquer it with ease.\n\nNot only is this shoe highly functional but it also boasts a sleek and stylish design, making it the perfect footwear option for both the avid hiker and the fashion-conscious individual. Available in a trendy blue-black colorway, this shoe is sure to be an instant hit.\n\nInvest in the best with the HOKA ONE ONE Anacapa Mid Gore-Tex 1119372-BBLC - your ultimate companion for all your outdoor escapades. Order yours today and experience the perfect combination of comfort, durability, and style!",
    "price": "$192",
    "variants": {
      "BLACK": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_db6b4106-f6c5-4855-ac0f-20cfc9bf04b8_540x.jpg?v=1683270759"
      }
    },
    "audience": [
      "Women's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "HOKA ONE ONE Bondi 6",
    "url": "https://www.kickscrew.com/products/hoka-one-one-wmns-bondi-6-black-1019270-bblc",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the (WMNS) HOKA ONE ONE Bondi 6 1019270-BBLC - the perfect fusion of style and performance. Designed to meet the demands of runners and fitness enthusiasts, this shoe is sure to provide optimal comfort and support with every stride.\n\nCrafted from high-quality materials, the Bondi 6 boasts a sleek and stylish blue-black colorway and a soft, breathable upper that ensures your feet stay cool and dry during your most intense workout sessions. The shoe's wide base and signature HOKA ONE ONE cushioning system also provide maximum shock absorption, helping to reduce the impact on your joints and enhance your overall running experience.\n\nThis shoe is perfect for individuals of all skill levels, from beginner runners to seasoned athletes. It's also available in a range of sizes and fits, ensuring a perfect fit for any foot type. Whether you're training for a marathon or just looking for a comfortable, reliable shoe for everyday wear, the (WMNS) HOKA ONE ONE Bondi 6 1019270-BBLC is the perfect choice for you. So don't wait any longer - step up your game and grab a pair today!",
    "price": "$395",
    "variants": {
      "DEFAULT COLOR": {
        "image": ""
      }
    },
    "audience": [
      "Women's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "Hoka One One Anacapa Low GTX 'Black'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-wmns-anacapa-low-gore-tex-black-1119373-bblc",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the (WMNS)Hoka One One Anacapa Low GTX 'Black' 1119373-BBLC - the ultimate shoe for every adventure! This shoe is perfect for the adventurous spirit who wants to explore the great outdoors without sacrificing comfort or style.\n\nCrafted with the finest materials and advanced technology, this shoe features a durable and waterproof Gore-Tex membrane that keeps your feet dry in wet conditions. The lightweight and breathable design ensures a comfortable fit, while the cushioned midsole provides exceptional support and protection against impact for your every step.\n\n(Elevate your hiking and trekking experience with the (WMNS)Hoka One One Anacapa Low GTX 'Black' 1119373-BBLC. Whether you're scaling rocky terrains or trekking through muddy trails, this shoe provides superior grip and traction to keep you stable and secure on any surface. The sleek and stylish black color adds a touch of sophistication to any outdoor outfit.\n\nWith its versatile design and superior quality, the (WMNS)Hoka One One Anacapa Low GTX 'Black' 1119373-BBLC is perfect for any adventure, from hiking and camping to backpacking and traveling. Experience the ultimate in comfort, durability and style with Hoka One One footwear. Order your pair today and take your outdoor adventures to the next level!",
    "price": "$217",
    "variants": {
      "BLACK": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_c156af66-ade0-4cd7-a5b5-e8f0cb2d21bf_540x.jpg?v=1662649366"
      }
    },
    "audience": [
      "Women's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "HOKA ONE ONE Kaha Gore-Tex",
    "url": "https://www.kickscrew.com/products/hoka-one-one-wmns-kaha-gore-tex-provincial-blue-1112031-pbbf",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the highly innovative and trail-ready HOKA ONE ONE Kaha Gore-Tex 1112031-PBBF! Crafted with the utmost precision and care, this trail shoe is designed to help you conquer the toughest terrains with ease. \n\nFeaturing premium quality Gore-Tex material, this shoe is completely waterproof and breathable, keeping your feet dry and comfortable during even the most challenging hikes. The unique Meta-Rocker technology ensures a smooth, stable ride, while the Vibram Megagrip outsole provides excellent traction on both wet and dry ground. \n\nMade for women on the go, the HOKA ONE ONE Kaha Gore-Tex 1112031-PBBF is designed to deliver maximum support, thanks to its highly cushioned midsole that reduces impact on joints and muscles. Whether you're climbing steep hills or navigating rocky terrain, this shoe ensures a secure fit and comfortable strides every step of the way. \n\nDon't settle for anything less than the best when it comes to your trail shoes - choose the HOKA ONE ONE Kaha Gore-Tex 1112031-PBBF, the ultimate trail shoe for the ultimate adventurer. Order yours today and experience the difference!",
    "price": "$279",
    "variants": {
      "DEFAULT COLOR": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_560eb8bf-f17a-4acb-a08c-cfd85582910b_540x.jpg?v=1683091368"
      }
    },
    "audience": [
      "Women's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "HOKA ONE ONE Speedgoat 4 Low-Top Blue",
    "url": "https://www.kickscrew.com/products/hoka-one-one-hoka-one-one-speedgoat-4-1106527-tgt",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the HOKA ONE ONE Speedgoat 4 Low-Top Running Shoes, the ultimate running companion for athletes who demand both comfort and durability. Crafted with utmost precision and an eye for detail, these shoes are designed to take your running experience to the next level.\n\nBuilt using the latest technology, these shoes provide a perfect blend of support and stability, giving you the confidence to tackle any terrain. The low-top design ensures enhanced mobility, while the blue color adds a touch of style to your running outfit.\n\nThe Speedgoat 4 comes equipped with a cushioned midsole that offers superior impact absorption, protecting your feet from fatigue and joint pain. The breathable upper keeps your feet cool and dry even during the most intense workouts, making them perfect for summer runs.\n\nWhether you are an experienced runner or just starting, these shoes will help you achieve your goals, making your running experience comfortable and efficient. The HOKA ONE ONE Speedgoat 4 Low-Top Running Shoes are a must-have for anyone looking to enhance their running game.\n\nGet your hands on these incredible shoes today and experience the difference for yourself! Don't wait any longer, shop now and take your workouts to the next level.",
    "price": "$188",
    "variants": {
      "Blue": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_e6fc80bc-9bb8-4870-937a-3bd8e90a3468_540x.jpg?v=1656132334"
      }
    },
    "audience": [
      "Women's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "HOKA ONE ONE Speedgoat 4 Low GS Blue/Apricot",
    "url": "https://www.kickscrew.com/products/hoka-one-one-hoka-one-one-speedgoat-4-1106527-ibba",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Looking for a pair of dependable, high-performance running shoes? Look no further than the (WMNS) HOKA ONE ONE Speedgoat 4 Low GS Blue/Apricot 1106527-IBBA.\n\nCrafted with the finest materials and featuring top-of-the-line technology, these running shoes are perfect for both serious athletes and casual runners alike. Whether you're pounding the pavement on a long-distance training run or sprinting through a quick 5K, the HOKA ONE ONE Speedgoat 4 Low will keep your feet comfortable, supported, and performing at their best.\n\nFeaturing a sleek blue and apricot colorway, these shoes are stylish as well as functional. Plus, they're designed to fit like a glove, with a low profile that hugs your foot for a snug, customized fit. With supportive cushioning and a durable outsole, the Speedgoat 4 Low is the perfect choice for runners of all levels.\n\nSo why wait? Invest in the (WMNS) HOKA ONE ONE Speedgoat 4 Low GS Blue/Apricot 1106527-IBBA today and experience the ultimate in comfort, performance, and style.",
    "price": "$162",
    "variants": {
      "Blue/": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_3ca4c7cb-d2ab-4048-a6a8-f243867f60b2_540x.jpg?v=1657118065"
      }
    },
    "audience": [
      "Women's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "Hoka One One Clifton 8 'Black White'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-wmns-clifton-8-black-1119394-bwht",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the Hoka One One Clifton 8 in the stunning 'Black White' colorway! These shoes are a must-have for all athletes and fitness enthusiasts, providing unbeatable comfort and support during intense training sessions.\n\nCrafted with expert precision, the Clifton 8 features a breathable upper made from high-quality materials, keeping your feet cool and dry during strenuous workouts. The lightweight design ensures maximum mobility and agility, allowing you to move freely and swiftly towards your goals.\n\nEquipped with Hoka's signature cushioning technology, the Clifton 8 offers unparalleled shock absorption, reducing the impact of each step and preventing injuries. The impressive traction sole ensures a stable and secure footing on any surface, giving you the confidence to push yourself to the limit and reach new heights.\n\nDesigned with both style and performance in mind, the sleek 'Black White' colorway offers a timeless aesthetic that seamlessly matches any workout outfit. Elevate your training game and experience the ultimate in comfort, support, and style with the Hoka One One Clifton 8. Don't miss out on this must-have addition to your athletic footwear collection!",
    "price": "$198",
    "variants": {
      "BLACK": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_5e01fe4e-89bc-459e-949c-15c64659dfb7_540x.jpg?v=1662197628"
      }
    },
    "audience": [
      "Women's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "Hoka One One Clifton 8 'Aquarelle'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-wmns-clifton-8-aquarelle-1119394-aebl",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the perfect blend of comfort and style - the (WMNS) Hoka One One Clifton 8 'Aquarelle' 1119394-AEBL. Designed with the latest innovative technology, these shoes offer an unparalleled level of comfort that makes them a must-have for runners and athletes of all levels.\n\nThe upper is made of a breathable mesh material, which ensures your feet stay cool and dry even during the most intense workouts. The shoe features a Meta-Rocker design that creates a smooth ride and promotes natural movement. The Early-stage Meta-Rocker encourages a smooth transition through the gait cycle, resulting in a smoother ride and less fatigue.\n\nThe Clifton 8 also boasts a lightweight EVA foam sole, which provides optimal cushioning and support for your feet. This makes it perfect for high-intensity training sessions or long-distance runs. The unique 'Aquarelle' colorway adds a touch of charm to your workout attire.\n\nWith a seamless construction and a padded collar that cradles the ankle, the Hoka One One Clifton 8 is the perfect choice for those seeking the ultimate blend of comfort, style, and functionality. Don't let sore feet hold you back from achieving your fitness goals. Try the Hoka One One Clifton 8 'Aquarelle' today and take your workouts to the next level!",
    "price": "$188",
    "variants": {
      "blue": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_186ee67a-ea36-4a87-b675-cbe9130ada4a_540x.jpg?v=1662134861"
      }
    },
    "audience": [
      "Women's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "HOKA ONE ONE Bondi 7",
    "url": "https://www.kickscrew.com/products/hoka-one-one-wmns-bondi-7-black-iris-ballad-blue-1110519-bibbl",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Step up your running game with the (WMNS) HOKA ONE ONE Bondi 7 1110519-BIBBL! This shoe delivers supreme comfort with every stride thanks to its plush midsole that offers excellent cushioning and support. You'll feel like you're running on clouds!\n\nThe upper is made of breathable mesh that allows your feet to stay cool and dry, even on the toughest of runs. The shoe fits like a glove, hugging your feet for a secure and comfortable fit.\n\nThe rubber outsole provides excellent traction, giving you the confidence to take on any terrain. Whether you're a seasoned runner or a beginner just starting out, this shoe is perfect for all levels.\n\nWith a stylish design featuring a blue and black colorway, the (WMNS) HOKA ONE ONE Bondi 7 1110519-BIBBL is sure to turn heads. Plus, it's available in women's sizes, so you can find the perfect fit for your feet.\n\nDon't settle for mediocre running shoes – upgrade to the (WMNS) HOKA ONE ONE Bondi 7 1110519-BIBBL and take your running to the next level!",
    "price": "$206",
    "variants": {
      "DARK BLUE": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_7936c44b-6f63-4359-a340-748611630948_540x.jpg?v=1668105464"
      }
    },
    "audience": [
      "Women's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "HOKA ONE ONE Clifton Edge",
    "url": "https://www.kickscrew.com/products/hoka-one-one-wmns-clifton-edge-almond-milk-1110511-ambg",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the latest release from HOKA ONE ONE - the Clifton Edge 1110511-AMBG! This stylish women's shoe offers the perfect blend of performance and style, making it a must-have for any active woman.\n\nCrafted with precision and care, this shoe features cutting-edge technology that offers unparalleled comfort and support. The Clifton Edge boasts a unique, extended heel, which provides added stability and support during your runs or workouts.\n\nDesigned for the modern, on-the-go woman, this shoe is perfect for any activity, from a quick jog in the park to an intense workout at the gym. With its sleek design and eye-catching colorway, the Clifton Edge 1110511-AMBG is sure to turn heads wherever you go.\n\nThe HOKA ONE ONE Clifton Edge is available in women's sizes and is suitable for all foot types. So why wait? Add the Clifton Edge 1110511-AMBG to your shoe collection today and experience the perfect blend of comfort, style, and performance in one incredible shoe!",
    "price": "$169",
    "variants": {
      "DEFAULT COLOR": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_c9725365-10f2-4ac7-86b6-ef0b783314b7_540x.jpg?v=1662197626"
      }
    },
    "audience": [
      "Women's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "Hoka One One Clifton 7 'Blue Haze'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-wmns-clifton-7-black-iris-blue-haze-1110509-bibh",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the (WMNS) Hoka One One Clifton 7 'Blue Haze' 1110509-BIBH - a must-have for runners of all levels. With its sleek design and impressive features, this shoe is sure to become your new go-to for every run.\n\nFeaturing a stylish blue haze colorway, this shoe is both trendy and functional. The breathable mesh upper keeps your feet cool and comfortable, while the plush cushioning provides a responsive feel with every stride.\n\nBut don't let its lightweight feel fool you - the Hoka One One Clifton 7 is built to withstand even the toughest runs. The durable outsole provides excellent traction and durability, so you can tackle any terrain with ease.\n\nWhether you're a seasoned veteran or just starting out, the Hoka One One Clifton 7 'Blue Haze' 1110509-BIBH is the perfect shoe for all your running needs. So why wait? Add it to your cart today and experience the ultimate combination of style and performance!",
    "price": "$188",
    "variants": {
      "BLUE/ORANGE": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_786c9a5f-1683-4ffc-b531-7f3c400edded_540x.jpg?v=1662197926"
      }
    },
    "audience": [
      "Women's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "HOKA ONE ONE Kaha GTX",
    "url": "https://www.kickscrew.com/products/hoka-one-one-wmns-kaha-gtx-black-1112031-basn",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Looking for the ultimate hiking shoe that will keep you comfortable and protected no matter the weather or terrain? Look no further than the (WMNS) HOKA ONE ONE Kaha GTX 1112031-BASN.\n\nThis remarkable hiking shoe is redesigned with the latest materials and technology to provide you with the best performance possible. The GTX (Gore-Tex) lining makes it completely waterproof, so you don't have to worry about wet feet when crossing streams or walking in the rain.\n\nThe Kaha GTX also features a midsole that uses HOKA's signature cushioning to provide maximum shock absorption and stability on any terrain. Meanwhile, the Vibram® MegagRIP outsole provides superior traction and durability, ensuring you can confidently tackle any trail.\n\nAnd let's not forget about comfort. With a plush collar and tongue, and a padded insole, your feet are sure to remain comfortable and blister-free throughout even the longest hikes.\n\nBut the Kaha GTX isn't just a practical hiking shoe - it's also stylish. The sleek black and white design, coupled with the HOKA logo on the side, make it a statement piece that pairs well with any hiking outfit.\n\nSo if you want a high-performing, durable, and stylish hiking shoe that will take you anywhere, you need the (WMNS) HOKA ONE ONE Kaha GTX 1112031-BASN. Order yours today and start exploring.",
    "price": "$348",
    "variants": {
      "BLACK": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_6e5d9843-b8d6-47a6-8444-44b003822027_540x.jpg?v=1662064111"
      }
    },
    "audience": [
      "Women's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "Hoka One One Ora Recovery Slide 'Black'",
    "url": "https://www.kickscrew.com/products/hoka-one-one-wmns-ora-recovery-slide2-black-1099674-bblc",
    "category": "Beach & Pool Slides/Slippers",
    "description": "Introducing the (WMNS) Hoka One One Ora Recovery Slide in 'Black', the perfect pair of slides to give your feet some well-deserved post-workout TLC. These slides are designed to help your feet recover faster, thanks to the ultra-cushioned midsole that cradles your feet in supreme comfort. \n\nFeaturing a sleek black design, these slides are not only practical but also stylish, making them perfect for everyday wear. The slip-on design means you can easily slide them on and off, making them the ultimate go-to footwear for errands, post-workout lounging, or even a day at the beach.\n\nCrafted with Hoka One One's signature technology, these slides are meticulously designed with the needs of athletes in mind. Whether you're a professional athlete or simply someone who enjoys working out regularly, these slides will help you feel rejuvenated by promoting blood flow and reducing inflammation.\n\nSo why wait? If you're looking for a pair of slides that can help your feet recover faster, look no further than the (WMNS) Hoka One One Ora Recovery Slide in 'Black'. Order yours today and step into unparalleled comfort and style!",
    "price": "$104",
    "variants": {
      "BLACK": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_668e2789-0664-498b-82f5-bcce2ad0b5f2_540x.jpg?v=1662055344"
      }
    },
    "audience": [
      "Women's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "Hoka One One Bondi 7 'White'",
    "url": "https://www.kickscrew.com/products/wmns-hoka-one-one-bondi-7-treple-white-1110519-wwh",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the (WMNS)Hoka One One Bondi 7 'White' - the perfect blend of style, comfort and performance for your feet! \n\nCrafted with innovative technology, these sneakers are designed to offer a cloud-like experience with each step, making them perfect for high-intensity workouts or everyday wear. The breathable upper knit offers a snug yet flexible fit, while the soft and plush tongue and collar provide added cushioning and support to your feet.\n\nEquipped with a full-length EVA midsole, the Bondi 7 provides superior shock absorption, while the Meta-Rocker technology ensures a smooth and effortless transition from heel to toe. Whether you're pounding the pavement, hitting the gym or just going about your day, these sneakers will keep your feet comfortable, supported and looking chic.\n\nSo, if you're looking for a pair of sneakers that can keep up with your active lifestyle, look no further than the (WMNS)Hoka One One Bondi 7 'White'. Available now in multiple languages, including English, French, German, Italian, Spanish, and Greek, for multilingual customers. Order now and experience the ultimate in comfort and style!",
    "price": "$152",
    "variants": {
      "": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_f656ccc6-9456-4db2-a07b-e035b5f8265d_540x.jpg?v=1682001035"
      }
    },
    "audience": [
      "Women's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "HOKA ONE ONE Bondi 8 'White'",
    "url": "https://www.kickscrew.com/products/wmnshoka-one-one-bondi-8-white-1127952-wwh",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the latest addition to our collection, the HOKA ONE ONE Bondi 8 in 'White' – the perfect blend of style, comfort, and performance. Designed for women, this shoe promises to revolutionize your running experience.\n\nWith its sleek and stylish design, the Bondi 8 is sure to turn heads wherever you go. But it's not just about the looks. The shoe features a cushioned midsole that provides unmatched comfort, ensuring you stay comfortable even during long runs.\n\nDon't let its lightweight design deceive you – the HOKA ONE ONE Bondi 8 is built for performance. The shoe's unique design provides exceptional support and stability, helping you take on any terrain with confidence.\n\nWhether you're a seasoned runner or just starting, the HOKA ONE ONE Bondi 8 in 'White' is the perfect shoe for you. With sizes available for all foot types and shapes, you're sure to find the perfect fit.\n\nSo what are you waiting for? Upgrade your running game today with the HOKA ONE ONE Bondi 8 – the ultimate combination of style, comfort, and performance. Buy now and take the first step towards achieving your running goals.",
    "price": "$165",
    "variants": {
      "": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_059417e7-b7ba-4ed5-8116-c3124dcc37f0_540x.jpg?v=1678953770"
      }
    },
    "audience": [
      "Women's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "HOKA ONE ONE Bondi X 'Black White'",
    "url": "https://www.kickscrew.com/products/wmnshoka-one-one-bondi-x-black-white-1113513-bwht",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the (WMNS) HOKA ONE ONE Bondi X 'Black White' 1113513-BWHT, the perfect blend of comfort and style! Whether you're hitting the pavement for a morning jog, running errands around town, or simply looking to upgrade your sneaker game, these shoes have got you covered.\n\nCrafted with expert precision and attention to detail, the Bondi X 'Black White' features a sleek black and white design that's sure to turn heads. But it's not just about looks - these shoes are also made for maximum comfort.\n\nFeaturing HOKA ONE ONE's trademark cushioning system, these shoes provide unparalleled support and shock absorption, making them the ideal choice for long walks, runs, or standing on your feet all day. And with their durable construction, you can be sure these shoes will provide reliable performance for miles to come.\n\nSo why settle for boring, uncomfortable shoes when you can have the best of both worlds? With the (WMNS) HOKA ONE ONE Bondi X 'Black White' 1113513-BWHT, you'll look and feel your best no matter where your adventures take you. Don't let this amazing opportunity pass you by! Order yours today and experience the ultimate in comfort and style.",
    "price": "$170",
    "variants": {
      "": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_ae2e267b-8bba-438d-9137-56af1d5029a3_540x.jpg?v=1683537397"
      }
    },
    "audience": [
      "Women's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "HOKA ONE ONE Mafate Speed 4 'Camellia Peach Parfait'",
    "url": "https://www.kickscrew.com/products/wmnshoka-one-one-mafate-speed-4-camellia-peach-parfait-1131056-cppf",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the (WMNS)HOKA ONE ONE Mafate Speed 4 'Camellia Peach Parfait' – the perfect shoe for runners who demand nothing but the best. Crafted with exceptional attention to detail, this shoe is a harmonious blend of style, comfort, and performance that will take your running experience to new heights.\n\nThe Mafate Speed 4 features a stunning camellia peach parfait colorway that will make you stand out on the track or the trails. Its lightweight construction and premium quality materials ensure that your feet stay comfortable, no matter how long you run. The shoe is made with HOKA ONE ONE's innovative Meta-Rocker technology that promotes efficient transitions and enhances stability.\n\nThe shoe's ultra-cushioned midsole provides superior support and absorbs impact, making it perfect for long-distance runs. The Vibram MegaGrip outsole offers exceptional traction, giving you confidence and control on any terrain. And with its breathable mesh upper, this shoe will keep your feet cool and comfortable even during the most demanding runs.\n\nSo whether you're a seasoned athlete or just getting started on your fitness journey, the (WMNS)HOKA ONE ONE Mafate Speed 4 'Camellia Peach Parfait' is the perfect shoe to help you achieve your goals. Order yours today and experience the ultimate in comfort, style, and performance.",
    "price": "$297",
    "variants": {
      "": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_3c55df5a-f616-4a66-b58c-6b4122e02587_540x.jpg?v=1684302117"
      }
    },
    "audience": [
      "Women's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "HOKA ONE ONE Clifton 8 'Black'",
    "url": "https://www.kickscrew.com/products/wmnshoka-one-one-clifton-8-black-1119394-bblc",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the (WMNS)HOKA ONE ONE Clifton 8 'Black' 1119394-BBLC - the ultimate running shoe that combines performance and style in perfect harmony. Designed with the newest running technology, this shoe ensures that you will have a one-of-a-kind running experience. \n\nCrafted with a sleek and stylish black finish, these running shoes are the perfect balance of form and functionality. Utilizing HOKA's signature plush, lightweight cushioning system, this shoe provides an unmatched level of support and comfort that will have you feeling like you're running on clouds.\n\nBuilt for long-lasting durability, the (WMNS)HOKA ONE ONE Clifton 8 'Black' 1119394-BBLC is perfect for running enthusiasts looking for a shoe that can last through the toughest of workouts. The sturdy construction is designed to withstand even the harshest of outdoor conditions while giving you optimal performance.\n\nTake your running game to the next level with the (WMNS)HOKA ONE ONE Clifton 8 'Black' 1119394-BBLC. Don't settle for an ordinary running shoe, make a statement with a shoe that effortlessly combines performance and style. Order yours today and experience a world-class running experience like no other!",
    "price": "$190",
    "variants": {
      "": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_0976dd66-e6fc-4157-bc2b-d437089840e1_540x.jpg?v=1678953612"
      }
    },
    "audience": [
      "Women's"
    ]
  },
  {
    "brand": "Hoka",
    "title": "HOKA ONE ONE Speedgoat 5 'Blue Coral Camellia'",
    "url": "https://www.kickscrew.com/products/wmnshoka-one-one-speedgoat-5-blue-coral-camellia-1123158-bccml",
    "category": "Marathon Running Shoes/Sneakers",
    "description": "Introducing the (WMNS)HOKA ONE ONE Speedgoat 5 'Blue Coral Camellia' 1123158-BCCML, the perfect blend of style and performance for every run! Whether you're a seasoned pro or just starting out, these shoes will take your training to the next level.\n\nWith their striking blue coral camellia colorway, these shoes are sure to turn heads wherever you go. But these shoes aren't just about looks - they're packed with features that will help you crush your goals. The Speedgoat 5 is the latest and greatest iteration of the HOKA ONE ONE Speedgoat line, and it's been designed with input from top ultrarunner Karl Meltzer to ensure maximum performance.\n\nOne of the standout features of these shoes is the wide midsole, which provides a stable base for your foot and helps you maintain your balance even on uneven terrain. The midsole also features HOKA's signature cushioning technology, which offers a plush feel and helps to reduce impact on your joints.\n\nThe outsole of the (WMNS)HOKA ONE ONE Speedgoat 5 'Blue Coral Camellia' 1123158-BCCML is made from durable Vibram Megagrip rubber, which provides excellent traction even in wet conditions. This means you can tackle any trail with confidence, no matter the weather.\n\nThese shoes are also designed with comfort in mind. The breathable mesh upper keeps your feet",
    "price": "$168",
    "variants": {
      "": {
        "image": "https://cdn.shopify.com/s/files/1/0603/3031/1875/products/main-square_6b391024-a1cb-4cf0-a1f1-28de9f84ad4d_540x.jpg?v=1682054516"
      }
    },
    "audience": [
      "Women's"
    ]
  }
]